[
	{
		"component": "header",
		"variant": 2,
		"value": "Virtual Reality"
	},
	{
		"component": "text",
		"value": "Virtual reality (often just called VR) is the name for computer technology that makes a person feel like they are somewhere else. It uses software to produce images, sounds and other sensations to create a different place, so that a user feels like he or she is really a part of this other place. That other place can be a real place (to take a tour in another country, for instance) or imaginary (playing a game).<br>Most current virtual reality environments are primarily visual experiences, displayed either on a computer screen or through special stereoscopic displays, but some simulations include additional sensory information, such as sound through speakers or headphones.<br>The simplest form of virtual reality is a 3-D image that can be explored interactively at a personal computer, usually by manipulating <span style=\"\">keys</span> or the mouse so that the content of the image moves in some direction or zooms in or out. More sophisticated efforts involve such approaches as wrap-around display screens, actual rooms augmented with wearable computers, and haptics devices that let you feel the display images."
	},
	{
		"component": "header",
		"variant": 3,
		"value": "Virtual reality can be divided into:"
	},
	{
		"component": "text",
		"value": "The simulation of a real environment for training and education.<br>The development of an imagined environment for a game or interactive story."
	},
	{
		"component": "text",
		"value": "Explore more about Virtual Reality by reading these articles."
	},
	{
		"component": "text",
		"value": "In simple English : <a href=\"https://kids.kiddle.co/Virtual_reality\">Choose me</a>",
		"decoration": {
			"type": "number",
			"value": null
		}
	},
	{
		"component": "text",
		"value": "In medium English : <a href=\"https://en.wikipedia.org/wiki/Virtual_reality\">Click me</a>",
		"decoration": {
			"type": "number",
			"value": null
		}
	},
	{
		"component": "text",
		"value": "In advance English : <a href=\"https://www.wired.com/story/wired-guide-to-virtual-reality/\">Click here</a>",
		"decoration": {
			"type": "number",
			"value": null
		}
	},
	{
		"component": "header",
		"variant": 2,
		"value": "Tips"
	},
	{
		"component": "text",
		"value": "If you don't understand any word please google it."
	}
]