[
	{
		"component": "header",
		"variant": 1,
		"value": "Coordinates and Box Tuples"
	},
	{
		"component": "text",
		"value": "Image pixels are addressed with x- and y-coordinates, which respectively specify a pixel’s horizontal and vertical location in an image. The origin is the pixel at the top-left corner of the image and is specified with the notation (0, 0). The first zero represents the x-coordinate, which starts at zero at the origin and increases going from left to right. The second zero represents the y-coordinate, which starts at zero at the origin and increases going down the image. This bears repeating: y-coordinates increase going downward, which is the opposite of how you may remember y-coordinates being used in math class. Figure 17-1 demonstrates how this coordinate system works."
	},
	{
		"component": "text",
		"value": "Many of Pillow’s functions and methods take a box tuple argument. This means Pillow is expecting a tuple of four <span style=\"\">integer</span> coordinates that represent a rectangular region in an image. The four <span style=\"\">integers</span> are, in order, as follows:"
	},
	{
		"component": "text",
		"value": "Figure 17-1. The x- and y-coordinates of a 27×26 image of some sort of ancient data storage device"
	},
	{
		"component": "text",
		"value": "Left: The x-coordinate of the leftmost edge of the box."
	},
	{
		"component": "text",
		"value": "Top: The y-coordinate of the top edge of the box."
	},
	{
		"component": "text",
		"value": "Right: The x-coordinate of one pixel to the right of the rightmost edge of the box. This <span style=\"\">integer</span> must be greater than the left <span style=\"\">integer</span>."
	},
	{
		"component": "text",
		"value": "Bottom: The y-coordinate of one pixel lower than the bottom edge of the box. This <span style=\"\">integer</span> must be greater than the top <span style=\"\">integer</span>."
	},
	{
		"component": "text",
		"value": "Figure 17-2. The area represented by the box tuple (3, 1, 9, 6)"
	},
	{
		"component": "text",
		"value": "Note that the box includes the left and top coordinates and goes up to but does not include the right and bottom coordinates. For example, the box tuple (3, 1, 9, 6) represents all the pixels in the black box in Figure 17-2."
	}
]