{
	"Backend_key1": "Do log ko mil kar sabse pehle yeh videos dekhni hai\n",
	"Backend_key2": "What is Back-end Development?\n",
	"Backend_key3": "Back-end development includes the ‘server-side’ of a software, `application` or website.  Back-end development is the process of making the website or program functional. Back-end `code` makes it possible for a website to access the da`tab`ase and fetch information. The most common languages used in this process are `Python`, C/C++, Swift  and PHP. \n",
	"Backend_key4": "Iska mtlb hai ki Back-end development me hum software ya program ko karyatmak (functional) banate hai. Jo sabse zyada common languages isme use hoti hai vo hai `Python`, C/C++, Swift  aur PHP. Is me hum ‘serve-side’ par kaam karte hai.\nAgar aapko Back-end development ke bare me detail me padna hai to aap neeche diye gaye links pe ja sakte hai :\n",
	"Backend_key5": "Ab aapko 30 mins ke liye aapas mei `english` mei inn topics ke baarein mei baat karni hai.\n",
	"Backend_key6": "Baat karte karte, aap observe karein, ki aap kitne tech words use kar paa rahe hai.\n",
	"Backend_key7": "Aur agar aapka partner koi aisa tech word bolta hai, jo aapko nahi pata, ya aap generally use nahi kartein. Inn words ko bhi samajhne ki phir koshish karein.\n",
	"Backend_key8": "Iss discussion ko karte hue, aap inn points ke baarein mei bhi soch sakte hai:\n",
	"Backend_key9": "Back-end kya hai?\n",
	"Backend_key10": "Framework kya hota hai ?\n",
	"Backend_key11": "Kya Back-end ke bina website chal sakti hai ?\n\n\n\n",
	"Backend_key12": "Agar aapko Back-end development ke bare me detail me padna hai to aap neeche diye gaye links pe ja sakte hai :\n",
	"Backend_key13": "<span><a href=\"https://en.wikipedia.org/wiki/Front_and_back_ends\">yaha click kare</a></span><br><br>\n<span><a href=\"https://www.coursereport.com/blog/front-end-development-vs-back-end-development-where-to-start\">Yaha click kare</a></span>\n",
	"Backend_key14": "**Tips**:\n1 - Aap subtitles/captions on kar sakte hai, `YouTube` Video dekhte hue\n2 - Aap speed kam ya jyada kar sakte hai, video ke liye, jisse ki aap acche se dekh payein\n"
}