{
	"facebook_key1": "## Facebook\n\n",
	"facebook_key2": "Facebook, Inc. is an American online social media and social networking service company based in Menlo Park, California. Its website was launched on February 4, 2004, by Mark Zuckerberg, along with fellow Harvard College students and roommates Eduardo `Save`rin, Andrew McCollum, Dustin Moskovitz and Chris Hughes.\n",
	"facebook_key3": " ## How Does Facebook Work? ”The Front End\"\n\n",
	"facebook_key4": "Facebook uses a variety of services, tools, and programming languages to make up its core infrastructure. At the front end, their servers run a LAMP (Linux, Apache, MySQL, and PHP) stack with Memcache. \n",
	"facebook_key5": " ## How Does Facebook Work? \"The Back End\"\n\n",
	"facebook_key6": "Facebook’s backend services are written in a variety of different programming languages including C++, Java, `Python`, and Erlang. Their philosophy for the creation of services is as follows:\n",
	"facebook_key7": "Create a service if needed\n",
	"facebook_key8": "Create a framework/toolset for easier creation of services\n",
	"facebook_key9": "Use the right programming language for the task\n\n\n",
	"facebook_key10": "## Aap yeh videos dekhein:\n\n\n",
	"facebook_key11": "### Ab aapko 30 mins ke liye aapas mei english mei baat karni hai.\n\n\n",
	"facebook_key12": "Baat karte karte, aap observe karein, ki aap kitne tech words use kar paa rahe hai.\n",
	"facebook_key13": "Aur agar aapka partner koi aisa tech word bolta hai, jo aapko nahi pata, ya aap generally use nahi kartein. Inn words ko bhi samajhne ki phir koshish karein.\n",
	"facebook_key14": "Iss discussion ko karte hue, aap inn points ke baarein mei bhi soch sakte hai:\n",
	"facebook_key15": "What is the technology used in facebook?\n",
	"facebook_key16": "What software does facebook used?\n",
	"facebook_key17": "What is an API facebook?\n",
	"facebook_key18": "What is a facebook SDK?\n",
	"facebook_key19": "When facebook is started how many people works there?\n",
	"facebook_key20": "How facebook is `code`d?\n",
	"facebook_key21": "If you are working in facebook as a developer what chenges you want to make or what features you want to add?\n",
	"facebook_key22": "Suppose you want to make your own app then what features you want in your app?\n\n\n",
	"facebook_key23": "You can know more about this topic\n",
	"facebook_key24": "\n",
	"facebook_key25": "You can know more about this topic\n"
}