{
	"introduction_key1": "Introduction to Web Scraping\n",
	"introduction_key2": "Socho aap jaise hi google pe kuch search karte ho, woh duniya mein woh saare web pages jinme aapki search term aati hai unko laake dikha deta hai. Yeh karne ke liye google ke paas bahot saare web pages ka data hai. Normally dunia mein koi bhi web page uspe HTML likhi hoti hai. HTML ka use kar ke Chrome jaise browsers usko sundar dikhate hain. Lekin scraping ka use kar ke hum uss web page ki information dikha sakte hain. Jaise aap jab 'NavGurukul' search karte ho toh woh top pe NavGurukul ke website ko dikha deta hai. Yeh karne ke liye Google ne NavGurukul ki website ko scrape kara hua hai.\n",
	"introduction_key3": "Web scraping ek process hai jisme ek user software ya fir bots ka use kar ke websites se data extract karta hai. Ise ek tarah se copying keh sakte hai jisme hum websites se vo data extract karte hai jiski hume zarurat hai aur fir vo data ko hum ek jagha `save` karte hai. Baad me hum use data par analysis bhi run karsakte hai.\n",
	"introduction_key4": "Iss\n",
	"introduction_key5": "link ko padh ke aap scraping ko aur behtar samajh sakte ho. Jo cheezein samajh nahi aati unko ache se apne friends ki help leke samjho :)\n",
	"introduction_key6": "Scraping ke aur bahot saare interesting cases hote hain. Kuch use cases ko humne neeche explain kia hua hai.\n",
	"introduction_key7": "Examples of Web Scraping\n",
	"introduction_key8": "Trivago\n",
	"introduction_key9": "Trivago ek **Hotel Comparison Engine** hai. Maan lein hum Jaipur jaa rahe hain. Hum wahan rehne ke liye MakeMyTrip jaisi websites ka use kar ke hotels book kara sakte hain. Lekin hotels book karane ki itni saari websites hain, humein saari check karke sabsi sasti dhundni bahot mushkil hoti hai. Yahan **Trivago** humare liye ek hotel ki price saari online booking websites se nikaal ke ek jagah pe dikhata hai. Yeh karne ke liye woh saari hotel booking websites ko scrape karta hai. Upar di hui ad ko dekh ko isko aur ache se samajh sakte ho.\n",
	"introduction_key10": "Google News\n",
	"introduction_key11": "Google News, web scraping ka ek bahut hi accha example. Google News bahut saari news websites ki\n",
	"introduction_key12": "**Headlines**\n",
	"introduction_key13": "aur un\n",
	"introduction_key14": "**Headlines ki Details**\n",
	"introduction_key15": "extract karke humare samne present kar deta hai. Agar aap\n",
	"introduction_key16": "iss\n",
	"introduction_key17": "link ko khol kar dekhe to aapko dikhega ki google news\n",
	"introduction_key18": "**Times of India**\n",
	"introduction_key19": ",\n",
	"introduction_key20": "**The Hindu**\n",
	"introduction_key21": ",\n",
	"introduction_key22": "**NDTV**\n",
	"introduction_key23": ",\n",
	"introduction_key24": "**News18**\n",
	"introduction_key25": ",\n",
	"introduction_key26": "**Hindustan Times**\n",
	"introduction_key27": "jaisi websites se data extract karke print karta hai.\n",
	"introduction_key28": "Indeed.com\n",
	"introduction_key29": "Indeed.com ek employment related search engine hai jo web scraping ka use karta hai. Agar aap\n",
	"introduction_key30": "Indeed.com\n",
	"introduction_key31": "pr jate hai aur koi job title karte hai to Indeed.com vo saari jobs jo aapke job description se match karti hai un sabhi ko alag alag employemetn related websites se extract karke appke samne print kr deta hai. Sochiye alag alag websites ko open kar ke unme job dhundna aasan hai ya fir ek website me.\n"
}