{
	"ProjectMakingItSnowUsingLibrary_key1": "# Using Library\n\n\n",
	"ProjectMakingItSnowUsingLibrary_key2": "Internet pe javascript ki bahut saari libraries hai. Javascript ki library mein bahut saare functions, methods aur objects pre-defined hote hain. Inse humara kaam bahut aasan ho jaata hai. Hum inko apne projects mein directly use kar sakte hain. Ye javascript libraries khud javascript mein hi likhe hote hain. \n",
	"ProjectMakingItSnowUsingLibrary_key3": "Kisi library ko apne source `code` mein include karne ke liye apne html `file` ke head tags ke beech mein apne library ka link include karna hota hai\n",
	"ProjectMakingItSnowUsingLibrary_key4": "## Kisi bhi website par snowfall\n\n\n",
	"ProjectMakingItSnowUsingLibrary_key5": "Iss project mein hum kisi bhi website par snowfall karayenge.\n",
	"ProjectMakingItSnowUsingLibrary_key7": "Aap `Code`pen website pe koi sa bhi pen(page) chuniye. Maine ",
	"ProjectMakingItSnowUsingLibrary_key8": "ye",
	"ProjectMakingItSnowUsingLibrary_key9": " chuna ",
	"ProjectMakingItSnowUsingLibrary_key10": "Apne pen ke sabse upar aur <head> tag ke beech mein ye library include karein:\n",
	"ProjectMakingItSnowUsingLibrary_key11": "Check aapke page par snowfall ho raha hai ya nahi\n",
	"ProjectMakingItSnowUsingLibrary_key12": "Observer karein ki mouse pointer ka direction change hone se snowfall ka direction bhi change ho raha hai. \n",
	"ProjectMakingItSnowUsingLibrary_key13": "Iss library mein Snowfall object define kiya gaya hai - jiski madad se aap Snowfall ki properties change kar sakte hain:\nApne javascript `file` mein\n\n",
	"ProjectMakingItSnowUsingLibrary_key14": "**Homework**\n",
	"ProjectMakingItSnowUsingLibrary_key15": "Apne snow ko apne pasand ka color aur activity dijiye\n",
	"ProjectMakingItSnowUsingLibrary_key16": "Google karke javascript ke aur bhi libraries explore kijiye jinse aap mazedar chizen kar sake\nAap [cornify.com] bhi explore kar sakte hain.\n\n\n",
	"ProjectMakingItSnowUsingLibrary_key17": "Aage hum Javascript mein Khud se Objects banana aur Events detect karna  (jaise click, mouse drag etc.) seekhenge. Abhi Library use karke kisi bhi site mein snowfall dal kar mazey kijiye. Cornify.com ki library bhi use karne ki kosish kijiye.\n"
}