[
	{
		"component": "header",
		"variant": 3,
		"value": "Manthan Selection Criteria"
	},
	{
		"component": "text",
		"value": "In order to be fair and transparent, we have documented the process of selection of students for Manthan. Manthan selection is based on the following criteria:"
	},
	{
		"component": "text",
		"value": "<b>Attitude</b>: This is the first and most important criteria for Manthan selection. Preference will be given to students who have shown discipline, sincerity, and respect for other community members in their behavior. Those students who have exhibited unruly behavior will not be considered for Manthan. DISCOs on campus, along with Governor, will take judgement on this.",
		"decoration": {
			"type": "number",
			"value": 1
		}
	},
	{
		"component": "text",
		"value": "<b>Academics</b>: Your sincerity in academics will also be taken into consideration for your Manthan selection. You will be considered for Manthan only if you have been putting in sincere efforts in your studies. This is important because Manthan should be a way to explore new understandings, alongside your technical skills. If you are not sincere towards your studies, we will encourage you to increase your efforts there first, before exploring new learnings.",
		"decoration": {
			"type": "number",
			"value": 2
		}
	},
	{
		"component": "text",
		"value": "<b>Interest</b>: There are many people who apply for the same Manthan opportunity. We will identify who is suitable for a specific opportunity based on the interest that you have shown. Your interest will be judged based on the form that you fill and a personal interview. If your form shows very low level of interest, then personal interview might not happen. In the form, the more detailed your answers are, the more interest it shows.",
		"decoration": {
			"type": "number",
			"value": 3
		}
	},
	{
		"component": "header",
		"variant": 3,
		"value": "Council Members and Award Winners:"
	},
	{
		"component": "text",
		"value": "There will be special consideration for Council members in upto two Manthan opportunities. This consideration will be based on how well you have fulfilled your Council responsibilities. If you have put in sincere effort in your Council duties, you will be given <b>preference</b> in two Manthan opportunities. This doesn't mean that you will definitely be selected. It means that if two students are similar on other criteria, a student who has sincerely served the community will get a preference.",
		"decoration": {
			"type": "number",
			"value": null
		}
	},
	{
		"component": "text",
		"value": "Similar process will apply to the <b>winners</b> of <b>Dashrath Manjhi</b> and <b>Mary Kom</b> awards. Award winners will get a preference in two Manthan opportunities whenever they choose to apply.",
		"decoration": {
			"type": "number",
			"value": null
		}
	}
]