{
	"review-of-python’s-time-functions_key1": "Review of <span style=\"\">Python</span>’s Time Functions",
	"review-of-python’s-time-functions_key2": "Dates and times in <span style=\"\">Python</span> can involve quite a few different data types and functions. Here’s a review of the three different types of values used to represent time:",
	"review-of-python’s-time-functions_key3": "A Unix epoch timestamp (used by the time module) is a <span style=\"\">float</span> or <span style=\"\">integer</span> value of the number of seconds since 12 AM on January 1, 1970, UTC.",
	"review-of-python’s-time-functions_key4": "A datetime object (of the datetime module) has <span style=\"\">integers</span> stored in the attributes year, month, day, hour, minute, and second.",
	"review-of-python’s-time-functions_key5": "A timedelta object (of the datetime module) represents a time duration, rather than a specific moment.",
	"review-of-python’s-time-functions_key6": "Here’s a review of time functions and their parameters and return values:",
	"review-of-python’s-time-functions_key7": "The time.time() function returns an epoch timestamp <span style=\"\">float</span> value of the current moment.",
	"review-of-python’s-time-functions_key8": "The time.sleep(seconds) function stops the program for the amount of seconds specified by the seconds argument.",
	"review-of-python’s-time-functions_key9": "The datetime.datetime(year, month, day, hour, minute, second) function returns a datetime object of the moment specified by the arguments. If hour, minute, or second arguments are not provided, they default to 0.",
	"review-of-python’s-time-functions_key10": "The datetime.datetime.now() function returns a datetime object of the current moment.",
	"review-of-python’s-time-functions_key11": "The datetime.datetime.fromtimestamp(epoch) function returns a datetime object of the moment represented by the epoch timestamp argument.",
	"review-of-python’s-time-functions_key12": "The datetime.timedelta(weeks, days, hours, minutes, seconds, milliseconds, microseconds) function returns a timedelta object representing a duration of time. The function’s <span style=\"\">key</span>word arguments are all optional and do not include month or year.",
	"review-of-python’s-time-functions_key13": "The total_seconds() method for timedelta objects returns the number of seconds the timedelta object represents.",
	"review-of-python’s-time-functions_key14": "The strftime(format) method returns a <span style=\"\">string</span> of the time represented by the datetime object in a custom format that’s based on the format <span style=\"\">string</span>. See <span style=\"\">Tab</span>le 15-1 for the format details.",
	"review-of-python’s-time-functions_key15": "The datetime.datetime.strptime(time<i><span style=\"\">string</span>, format) function returns a datetime object of the moment specified by time</i><span style=\"\">string</span>, parsed using the format <span style=\"\">string</span> argument. See <span style=\"\">Tab</span>le 15-1 for the format details."
}