{
	"Hosting_key1": "Hosting kya hai ?",
	"Hosting_key2": "Internet me aapke blog ya website ke liye ek jagah ki jarurat hoti hai jise hum Internet ki language me web hosting kahte hai. Jab hum hum internet me hosting khareedte hai to hume ek space ( jagah ) milti hai jaha humara blogs or website active rahta hai aur ish jagah ko hum ek naam dete hai jishse hum hamare webste ya blogs ko dekhte hai, ushe domain kahte hai.",
	"Hosting_key3": "{ In simple and easy words - \"web hosting provides a means to access your website <span style=\"\">files</span> to a storage space and access to all people\". }",
	"Hosting_key4": "[ seedhe aur aasaan shabdon mein –“web hosting aapakee website <span style=\"\">files</span> ko ‘storage space’ yaani rahane kee jagah aur ‘access’ yaani sab logon tak pahunchane ka jariya pradaan karatee hai “| ]",
	"Hosting_key5": "Eg:- jish tarah aapko dharti per rahne ke liye ek jagah ya plot ki jarurat hoti hai, ushi tarah Internet me apke blogs ko bhi ek jagah ki jarurat hoti hai, jishe hum web hosting kahte hai.<br>Ishi ke andar hamare saare posts, photos, videos, <span style=\"\">files</span> etc. <span style=\"\">save</span> rahta hai, and ye 24 hours active rahta hai jishse hamara blogs haamesha online rahe.",
	"Hosting_key6": "Hosting aur domain me kya difference hoti hai:-",
	"Hosting_key7": "How Web Hosting works (Web hosting कैसे कार्य करती है?)",
	"Hosting_key8": "Hosting service aapki website <span style=\"\">files</span> ko web service per store kar deti hai. Jab koi bhi  aapki website tak pahuchne ke liye ushka address ya URL apne browsser me likhta hai, <span style=\"\">tab</span> ye web serviers ush customer ke request ko accept karte huye ushke computer tak aapki <span style=\"\">files</span> ki ek copy pahucha deti hai , jishke result me customer ke computer per aapki website open ho jaati hai.",
	"Hosting_key9": "<span><img src=\"https://www.znetlive.com/blog/wp-content/<span style=\"\">uploads</span>/2016/01/Web-hosting-ki-karya-pranali.jpg\"&gt;</span>",
	"Hosting_key10": "Types of Hosting :",
	"Hosting_key11": "<i>Web industry me different types ke web service available hai.-</i>",
	"Hosting_key12": "Shared Server hosting",
	"Hosting_key13": "Virtual Private Server (VPS) hosting",
	"Hosting_key14": "Dedicated Server hosting",
	"Hosting_key15": "Shared Server hosting:-",
	"Hosting_key16": "Ye hosting ek hostal mein rahane ke saman hai.  jis prakaar hostal mein aap bahuton ke sang apane rahane ka sthaan baantate hain, ushi  prakaar is hosting prakaar ke antargat ek physichal server par bahut saaree websites ki mezabaanee kee jaatee hai. shared server in sabhi websites  ko web space aur CPU, RAM  jaise sansaadhano ko ek saath istamaal karane kee suvidha upalabdh karaata hain jisake parinaamasvaroop ish hosting prakaar kee laagat baki dono  prakaar ki hostings se kam hotee hai.",
	"Hosting_key17": "Virtual Private Server (VPS) hosting:-",
	"Hosting_key18": "Ye hosting ek flate mein rahane ke saman hai, jahaan aap bhale hee aap apana main get sabake sang share kare par apane ghar par ek aur extra gate hone se aapako apane selfnity (privecy) bhi praapt hoti hai.",
	"Hosting_key19": "VPS hosting virtualization takaneek ka prayog karati hai, jisake antargat ek physical server ko virtually different server mein divide kiya jaata hai, parinaamavash ek hee server par hote hue bhee baki websites aapake hisse ke web space aur sansaadhano ka upayog nahi kar paatee hain. ish kaaran ye hosting aapako privecy  aur suraksha (protection)  jaise laabh pradaan karati hai.",
	"Hosting_key20": "Behtar jankaari ke liye aap ye videos dekhe, ishse aapka basic concept clear ho jayega.",
	"Hosting_key21": "Aap ish link per jaker inke baare me jyada jaankari le sakte hai.",
	"Hosting_key22": "https://www.catchhow.com/web-hosting-kya-hai/",
	"Hosting_key23": "Ab aapko 30 mins ke liye aapas mei english mei inn topics ke baarein mei baat karni hai.<br>Baat karte karte, aap observe karein, ki aap kitne tech words use kar paa rahe hai.",
	"Hosting_key24": "Aur agar aapka partner koi aisa tech word bolta hai, jo aapko nahi pata, ya aap generally use nahi kartein. Inn words ko bhi samajhne ki phir koshish karein",
	"Hosting_key25": "Iss discussion ko karte hue, aap inn points ke baarein mei bhi soch sakte hai:",
	"Hosting_key26": "Hosting kya hai ?",
	"Hosting_key27": "Hosting kitne prakar ke hote hai?",
	"Hosting_key28": "Hosting and domain me kya difference hai?",
	"Hosting_key29": "Hosting kyu jaroori hai?",
	"Hosting_key30": "Agar aap apne website ko hosting nahi karenge to kya hoga?",
	"Hosting_key31": "<b>Tips</b>:",
	"Hosting_key32": "Aap subtitles/captions on kar sakte hai, YouTube Video dekhte hue",
	"Hosting_key33": "Aap speed kam ya jyada kar sakte hai, video ke liye, jisse ki aap acche se dekh payein"
}