{
	"Encoding_key1": "<h2 id=\"encodinganddecodingbraappahleyevideosdekhlijiyeishseaapkaconceptclearhojayegaandaagesamajhnemeaasanihogi\">Encoding and Decoding :-<br>Aap pahle ye videos dekh lijiye, ishse aapka concept clear ho jayega and aage samajhne me aasani hogi.</h2>",
	"Encoding_key2": "<h3 id=\"encoding\">Encoding:-</h3>",
	"Encoding_key3": "Encoding ek aishi prakriya hai jisame daata ko ek aise formet mein badal diya jaata hai jise kee kishi dooshre system dwara upayog kiya ja sakata hai.  Eg.  yadi hamaare paas kuchh daata aur hamen is daata ko kishi doosare system ya computer ko process karane ke liye dena hai to hamen apne daata ko us formet mein hi badalana hoga jise ki yah doosara process ya computer samajhata hai, anyatha yah system hamaare daata ko proses hi nahi kar paayega kyonki is system ko ek vishesh formet mein hi daata chaahie hoga.  encoding ko computer, networking, elwctronics etc. kshetron mein upayog kiya jaata hai.",
	"Encoding_key4": "<span><img src=\"https://i.ytimg.com/vi/90fME0sT7ko/maxresdefault.jpg<br>\"></span>",
	"Encoding_key5": "Ya ish link per jaye <br>",
	"Encoding_key6": "http://techhindistuff.blogspot.com/2018/06/what-is-encoding-in-computing-in-hindi.html",
	"Encoding_key7": "<h2 id=\"decodingbrdicodingspanstylecodespankosaadapaathyakishibhipraaroopmeinbadalnekiprakriyahaijobaadkiprakriyaonkeliyeupayogeehaidecodingencodingkeoppositehaiyahenspanstylecodespanddetasanchaarprasaaranaurspanstylefilesspankounakeoriginalstatesmeinchangekaratahai\">Decoding:-<br>dicoding <span style=\"\">code</span> ko saada paath ya kishi bhi praaroop mein badalne ki prakriya hai jo baad ki prakriyaon ke liye upayogee hai. decoding encoding ke opposite hai. yah en<span style=\"\">code</span>d deta sanchaar prasaaran aur <span style=\"\">files</span> ko unake original states mein change karata hai.</h2>",
	"Encoding_key8": "<span><img src=\"https://i.ytimg.com/vi/3per0Uq3BnA/maxresdefault.jpg<br>\"></span>",
	"Encoding_key9": "Behtar jaankari ke liye aap ish video ko poora dekhiye..",
	"Encoding_key10": "<h2 id=\"lettercoding\">Letter coding:-</h2>",
	"Encoding_key11": "In letter coding type of questions, the real alphabets in a word are replaced be certain other alphabets according to a specific rule to form its <span style=\"\">code</span>. The candidate is required to detect the common rule and answer the questions accordingly.",
	"Encoding_key12": "Iss discussion ko karte hue, aap inn points ke baarein mei bhi soch sakte hai:",
	"Encoding_key13": "What is encoding?",
	"Encoding_key14": "What is decoding?",
	"Encoding_key15": "What is the difference between encoding and decoding?",
	"Encoding_key16": "What is letter coding?",
	"Encoding_key17": "What is encoding and decoding in java?<br><br><br><br>",
	"Encoding_key18": "<b>Tips</b>:",
	"Encoding_key19": "Aap subtitles/captions on kar sakte hai, YouTube Video dekhte hue",
	"Encoding_key20": "Aap speed kam ya jyada kar sakte hai, video ke liye, jisse ki aap acche se dekh payein"
}