{
	"managing-complex-regexes_key1": "Managing Complex Regexes",
	"managing-complex-regexes_key2": "Regular expressions are fine if the text pattern you need to match is simple. But matching complicated text patterns might require long, convoluted regular expressions. You can mitigate this by telling the re.compile() function to ignore whitespace and comments inside the regular expression <span style=\"\">string</span>. This “verbose mode” can be enabled by passing the <span style=\"\">variable</span> re.VERBOSE as the second argument to re.compile().",
	"managing-complex-regexes_key3": "Now instead of a hard-to-read regular expression like this:",
	"managing-complex-regexes_key4": "phoneRegex = re.compile(r'((\\d{3}|(\\d{3}))?(\\s|-|.)?\\d{3}(\\s|-|.)\\d{4}<br>(\\s<i>(ext|x|ext.)\\s</i>\\d{2,5})?)')<br>you can spread the regular expression over multiple lines with comments like this:",
	"managing-complex-regexes_key5": "phoneRegex = re.compile(r'''(<br>    (\\d{3}|(\\d{3}))?            # area <span style=\"\">code</span><br>    (\\s|-|.)?                    # separator<br>    \\d{3}                         # first 3 digits<br>    (\\s|-|.)                     # separator<br>    \\d{4}                         # last 4 digits<br>    (\\s<i>(ext|x|ext.)\\s</i>\\d{2,5})?  # extension<br>    )''', re.VERBOSE)<br>Note how the previous example uses the triple-quote <span style=\"\">syntax</span> (''') to create a multiline <span style=\"\">string</span> so that you can spread the regular expression definition over many lines, making it much more legible.",
	"managing-complex-regexes_key6": "The comment rules inside the regular expression <span style=\"\">string</span> are the same as regular <span style=\"\">Python</span> <span style=\"\">code</span>: The # symbol and everything after it to the end of the line are ignored. Also, the extra spaces inside the multiline <span style=\"\">string</span> for the regular expression are not considered part of the text pattern to be matched. This lets you organize the regular expression so it’s easier to read."
}