{
	"spoken-english-week3_key1": "Hello!! <br>This is your Class 3 for Spoken English course module.",
	"spoken-english-week3_key2": "Level 1",
	"spoken-english-week3_key3": "Pair and Share",
	"spoken-english-week3_key4": "What indoor or outdoor game do you like to play?",
	"spoken-english-week3_key5": "Why do you like this game?",
	"spoken-english-week3_key6": "When did you start playing this game?",
	"spoken-english-week3_key7": "Who do you play this game with?",
	"spoken-english-week3_key8": "Where do you play this game?<br><br>",
	"spoken-english-week3_key9": "<b>Objective</b> - The aim of this Level 1 pair share is to encourage comprehension<br>and the difference between who-what-when-where-why. ",
	"spoken-english-week3_key10": "Game Time:",
	"spoken-english-week3_key11": "The Similar game is to figure out why the first pair of words go together so that you can finish the second word pair.<br>Example :<br>..Banana is to Tree as milk is to Cow.<br>..Up is to Down as Over is to Under<br>..Rock is to Heavy as Feather is to Light<br>..Big is to small as Full is to empty",
	"spoken-english-week3_key12": "Reference : <a href=\"https://www.youtube.com/watch?v=bbXR43hMSV8\">Link</a>",
	"spoken-english-week3_key13": "Word of the Week -",
	"spoken-english-week3_key14": "<b>Protect</b><br>(verb)<br>Definition - Keep safe from harm or injury, <span style=\"\">save</span>, take care of, look after<br>Usage - I will protect my friends and family",
	"spoken-english-week3_key15": "Homework:",
	"spoken-english-week3_key16": "Use the word protect when talking to teachers/friends/others this week and<br>make a note of how many times you used it. ",
	"spoken-english-week3_key17": "Level 2",
	"spoken-english-week3_key18": "Pair and Share:<br>What is your favorite game or sport? Describe this game/sport, and why you<br>like it.<br>Objective - The aim of this Level 2 pair share is to use one's vocabulary to describe logistical/practical aspects of the game/sport, as well as to use reasoning to describe their interest in the game/sport.",
	"spoken-english-week3_key19": "Game Time:",
	"spoken-english-week3_key20": "Analogy/ Similar Game - An analogy shows comparison between things that<br>have similar features, often used to help explain a principle or idea. The Game<br>is to figure out why the first pair of words go together so that you can finish the second word pair.",
	"spoken-english-week3_key21": "Example:",
	"spoken-english-week3_key22": "Nurse is to Patient as Teacher is to Student<br>Allow is to Permit as Find is to Locate<br>Fatigue is to yawning as itching is to Scratching"
}