{
    "bubble-sort_key1": "छंटाई",
    "bubble-sort_key2": "<b>छँटाई</b> एक बहुत ही महत्वपूर्ण प्रक्रिया है, आप इसे अक्सर देखेंगे। छँटाई (Sorting) का अर्थ है किसी क्रम में व्यवस्थित करना जैसे किसी क्रम को ऊँचाई, वजन, नाम, चिह्नों आदि के अनुसार व्यवस्थित करना।",
    "bubble-sort_key3": "उदाहरण :-",
    "bubble-sort_key4": "छोटे से बड़े ( <b>आरोही क्रम(Ascending order)</b> ) में अंक व्यवस्थित करें।",
    "bubble-sort_key5": "नामों को वर्णानुक्रम(alphabatical) में क्रमबद्ध करने के लिए ( <b>कालानुक्रमिक आरोही क्रम(Chronological Ascending Order)</b> )।",
    "bubble-sort_key6": "ऊंचाई को कम से उच्च ( <b>आरोही क्रम</b> ) में व्यवस्थित करना।",
    "bubble-sort_key7": "वजन को उच्च से कम ( <b>अवरोही क्रम(Descending Order)</b>) में व्यवस्थित करना। बबल सॉर्ट सॉर्टिंग का एक तरीका है, जो <b>आरोही</b> या <b>अवरोही</b> क्रम में संख्याओं के अनुक्रम को व्यवस्थित करता है।",
    "bubble-sort_key8": "बबल सॉर्ट को समझना",
    "bubble-sort_key9": "इस diagram को देखें। आप यहाँ से भी <a href=\"https://medium.com/karuna-sehgal/an-introduction-to-bubble-sort-d85273acfcd8\">Bubble sort</a> के बारे में पढ़ सकते हैं।",
    "bubble-sort_key10": "बबल सॉर्ट",
    "bubble-sort_key11": "पहले और दूसरे तत्वों(elements) की तुलना करें।",
    "bubble-sort_key12": "अगर बाद में बड़ा तत्व है, तो कुछ मत करो।",
    "bubble-sort_key13": "यदि बड़ा तत्व पहले है, केवल तभी इसे स्वैप करें। ( <b>स्वैप का</b> अर्थ है - <b>इंटरचेंज</b> - पहले तत्व को दूसरे से और दूसरे तत्व को पहले वाले से बदलें)।",
    "bubble-sort_key14": "अब, दूसरे और तीसरे के साथ भी ऐसा ही करें यानी तत्वों की तुलना करें और उन्हें स्वैप करें।",
    "bubble-sort_key15": "यही प्रक्रिया दोहराएं।",
    "bubble-sort_key16": "<b>एक पुनरावृत्ति(iteration) के</b> बाद सबसे बड़ी संख्या चरम दाईं ओर पहुंच जाएगी।",
    "bubble-sort_key17": "ये पुनरावृत्तियां उतनी बार चलेंगी जितने तत्व list में मौजूद हैं  - इसके द्वारा, <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">array</span> को सॉर्ट किया जाएगा।",
    "bubble-sort_key18": "सबसे पहले इसे <b>नोटबुक और पेन</b> की मदद से करें, इससे आपकी समझ बेहतर होगी।",
    "bubble-sort_key19": "फिर, <span style=\"\">code</span> की सहायता से <b>इस Algorithm</b> को लागू करें। यह एक कठिन सवाल है, अगर ऐसा करने में 4 से 5 घंटे लगते हैं, तो भी ठीक है।"
}