{
	"Project11_key1": "create 1 html/CSS page where it displays clock and todays date and year as like this https://`code`pen.io/josephshambrook/full/xmtco. Try that for not seeing the `code`.You can use transform and transform-origin css style properties for showing the hands of clock.(Hint: try \"transform\" and \"transform-origin\")\n\n",
	"Project11_key2": "for getting present day we use https://www.w3schools.com/js/js_dates.asp. For getting date or month or year from objects wer have the pre-defined methods like this https://www.w3schools.com/js/js_date_methods.asp. Get them and store them in seperate varaibles to use it later.\n\n\n",
	"Project11_key3": "For showing date you need to change html data,, for that you can use innerHTML, getElementById or any other method you can use it and show it.\n",
	"Project11_key4": "Write a function for extracting hour, miunutes, seconds from date object. And with the help of them you need to change the position of hands in clock and it shows the current time. for showing time in clock you need to change hours minutes and seconds to degreed. After converting into degrees you need to use transform style property and make the hands position into correct.\n\n",
	"Project11_key5": "you need to change the clock regulary for each second, upward function is going to update the time constantly. for that hint is setInterval() use it effectively and use the transiltion style property and move the clock smoothly.\n\n",
	"Project11_key6": "In your web browser you can store the previous period dates also permanently in localstorage.\n\n\n",
	"Project11_key7": "https://www.w3schools.com/html/html5_webstorage.asp\n",
	"Project11_key8": "By the previous period date it would calculate the avaerage difference in betwwen in period dates..\n\n\n\n",
	"Project11_key9": "and because of current date that is showing upward it show how many days left to you for next cycle periods.\n",
	"Project11_key10": "if it showing 7 days left to your next period. you can show some indicator if you are reaching to near period like some thing else according to your feel.\n",
	"Project11_key11": "Apne web browser mein aap apne last period date ko permanently store kar sakte hain using localStorage.\n",
	"Project11_key12": "Look at this period game that aims to educate people about periods. Can you think of a similar game in javascript?\n"
}