{
	"Project6_key1": "Local Storage\n",
	"Project6_key2": "Think how banks are doing login work for their users and how they are saying that your session time is out when you are logged in and leave it like that only and please login again? How? How ? How? \n",
	"Project6_key3": "Please go through this to find a solution.\n",
	"Project6_key4": "https://blog.logrocket.com/localstorage-javascript-complete-guide/\n",
	"Project6_key5": "You understood right how to store details as `key` value pairs.\n",
	"Project6_key6": "Todo `Application`\n",
	"Project6_key7": "video\n",
	"Project6_key8": "Here you need to make a bucket list of tasks that you need to do this we can use for further reference how we are organizing our tasks. You can make it as advanced things and also think on it and improvise too if you want.\n",
	"Project6_key9": "https://github.com/vknayak/JS-projects/blob/main/Project6/index.html\n",
	"Project6_key10": "https://github.com/vknayak/JS-projects/blob/main/Project6/script.js\n",
	"Project6_key11": "In our todo `application` how much of work we have, \nFirst work - adding a task whatever that he enters into an `input`.\nSecond work - Showing tasks after added a task from `input`\nThird work - give an option to clear all task\nFourth work- give a delete option to each task\n",
	"Project6_key12": "Function\n",
	"Project6_key13": "write a function addBtn which do subtasks mention below\n",
	"Project6_key14": "get the `input`1 value whatever the user is entering for task\n",
	"Project6_key15": "get the local storage values by getItem function if it is null create a new list or parse it after getting from local storage into normal list\n",
	"Project6_key16": "push the new task that you got from `input`1 and set that in localstorage by using setItem function\n",
	"Project6_key17": "and show all tasks function is useful to show the tasks to you, after adding current task to the new list give that as a parameter to showtasks then show task will show you the tasks in li.\n\n### function Showtasks \n\n\n",
	"Project6_key18": "write a function ShowTasks is which will do\n",
	"Project6_key19": "got the list as a parameter and it will help you to show the list\n",
	"Project6_key20": "get the `input`1 value whatever the user is entering for task\n",
	"Project6_key21": "get the todolist value where you want to `save` all the todos by writing\nSee the ul tag in html, it is empty you need to fill that by using li aka listItems\n",
	"Project6_key22": "get the footer value for writing the how many tasks that you have\n",
	"Project6_key23": "get the local storage values by getItem function if it is null create a new list or parse it after getting from local storage into normal list\n",
	"Project6_key24": "After getting all tods from localstorage we need to run a `loop` for creating a list of tasks that defines each task with a button of deeleteTodo. deleteTodo function which will take 1 parameter of the index of each task\n\n\n",
	"Project6_key25": "Read this to understand how to give the\n",
	"Project6_key26": "innerHtml value\n",
	"Project6_key27": ".\n",
	"Project6_key28": "Update the todolist value with all lists that we made\n",
	"Project6_key29": "Update footer value with the total task that we have and say them that you have these many tasks todo\n",
	"Project6_key30": "and update the `input`1 value means that `input` box value should to empty\n\n\n\n### Fucntion clearALl, \nwhich will do\n",
	"Project6_key31": "clear all todos by emptying the localstorage values by using removeItem\n",
	"Project6_key32": "and update the footer value also to zero tasks because after deleting there are no tasks to do\n",
	"Project6_key33": "And no list items means not tasks need to show in web page\n\n\n\n",
	"Project6_key34": "Function deleteTodo\n",
	"Project6_key35": "which takes 1 parameter of index value from the task and use that index to find the task and delete that task and show remaining tasks  after deleting the particular send the remaining list to showtasks function and it will show the remaining tasks.\n"
}