{
	"manipulating-images-with-pillow_key1": "Manipulating Images with Pillow",
	"manipulating-images-with-pillow_key2": "Now that you know how colors and coordinates work in Pillow, let’s use Pillow to manipulate an image. Figure 17-3 is the image that will be used for all the interactive <span style=\"\">shell</span> examples in this chapter. You can download it from <span><a href=\"http://nostarch.com/automatestuff/\">http://nostarch.com/automatestuff/</a></span>.",
	"manipulating-images-with-pillow_key3": "Once you have the image <span style=\"\">file</span> Zophie.png in your current working directory, you’ll be ready to load the image of Zophie into <span style=\"\">Python</span>, like so:",
	"manipulating-images-with-pillow_key4": "Figure 17-3. My cat Zophie. The camera adds 10 pounds (which is a lot for a cat).",
	"manipulating-images-with-pillow_key5": "To load the image, you import the Image module from Pillow and call Image.open(), passing it the image’s <span style=\"\">file</span>name. You can then store the loaded image in a <span style=\"\">variable</span> like CatIm. The module name of Pillow is PIL to make it backward compatible with an older module called <span style=\"\">Python</span> Imaging Library, which is why you must run from PIL import Image instead of from Pillow import Image. Because of the way Pillow’s creators set up the pillow module, you must use the from PIL import Image form of import <span style=\"\">statement</span>, rather than simply import PIL.",
	"manipulating-images-with-pillow_key6": "If the image <span style=\"\">file</span> isn’t in the current working directory, change the working directory to the folder that contains the image <span style=\"\">file</span> by calling the os.chdir() function.",
	"manipulating-images-with-pillow_key7": "The Image.open() function returns a value of the Image object data type, which is how Pillow represents an image as a <span style=\"\">Python</span> value. You can load an Image object from an image <span style=\"\">file</span> (of any format) by passing the Image.open() function a <span style=\"\">string</span> of the <span style=\"\">file</span>name. Any changes you make to the Image object can be <span style=\"\">save</span>d to an image <span style=\"\">file</span> (also of any format) with the <span style=\"\">save</span>() method. All the rotations, resizing, cropping, drawing, and other image manipulations will be done through method calls on this Image object.",
	"manipulating-images-with-pillow_key8": "To shorten the examples in this chapter, I’ll assume you’ve imported Pillow’s Image module and that you have the Zophie image stored in a <span style=\"\">variable</span> named catIm. Be sure that the zophie.png <span style=\"\">file</span> is in the current working directory so that the Image.open() function can find it. Otherwise, you will also have to specify the full absolute path in the <span style=\"\">string</span> argument to Image.open()."
}