[
	{
		"component": "text",
		"value": "<h2 id=\"whatisrouterbrrouterekelectronicdevicehaijokaicomputernetworkkowiredyawirelessconnectionkemadyamseeksathjodtehairouterekcomputernetworkhaijodusrecomputernetworkseconnectkrtahai\">WHAT IS ROUTER<br>Router ek electronic device hai  jo kai computer network ko wired ya wireless connection ke madyam se ek sath jodte hai. Router ek computer network hai jo dusre computer  network se connect krta hai.</h2>"
	},
	{
		"component": "header",
		"variant": 2,
		"value": "Aap yeh videos dekhein:"
	},
	{
		"component": "youtube",
		"value": "IYfGA9p5gZc"
	},
	{
		"component": "text",
		"value": "<h2 id=\"howrouterworksbrrouterpacketkoeknetworksedusrenetworkmaiforwardkarnekakamkrtahairoutersourcesedestinationaddresstakpacketbhejtahairouterkamukhaykampacketkoreceivekrnaorreceiverkodeliverkarnahai\">How Router Works<br>Router, packet ko ek network se dusre network mai forward karne ka kam krta hai. Router source se destination address tak packet bhejta hai.Router ka mukhay kam packet ko receive krna or receiver ko deliver karna hai.</h2>"
	},
	{
		"component": "text",
		"value": "EX:- Aapne apne friend ko facebook message send kiya jo abhi delhi me hai sbse pehle vo message ek packet mai convert ho jayega or pass vale router ke pass phuch jata hai. Ab router, routing protocol se routing <span style=\"\">tab</span>le ko check karta hai.Routing <span style=\"\">tab</span>le ke aas-pass jitne bhe router hai un sbhi ka address or path distance rahta hai,fir iske baad router ke pass forward kiya jata hai. Us packet me receiver ka IP address hota hai jisse shortest path ko check krta hai or router ke pass send kiya jata hai or ise tarah packet receiver computer ke pass phuch jata hai."
	},
	{
		"component": "youtube",
		"value": "haMJtZazJ-w"
	},
	{
		"component": "header",
		"variant": 3,
		"value": "Ab aapko 30 mins ke liye aapas mei english mei baat karni hai."
	},
	{
		"component": "text",
		"value": "Baat karte karte, aap observe karein, ki aap kitne tech words use kar paa rahe hai."
	},
	{
		"component": "text",
		"value": "Aur agar aapka partner koi aisa tech word bolta hai, jo aapko nahi pata, ya aap generally use nahi kartein. Inn words ko bhi samajhne ki phir koshish karein."
	},
	{
		"component": "text",
		"value": "Iss discussion ko karte hue, aap inn points ke baarein mei bhi soch sakte hai:"
	},
	{
		"component": "text",
		"value": "Router kya hote hain?",
		"decoration": {
			"type": "number",
			"value": 1
		}
	},
	{
		"component": "text",
		"value": "Kya router hardware aur software se bana hota hai?",
		"decoration": {
			"type": "number",
			"value": 2
		}
	},
	{
		"component": "text",
		"value": "Routers kaha use hote hain?",
		"decoration": {
			"type": "number",
			"value": 3
		}
	}
]