{
	"word-documents_key1": "Word Documents",
	"word-documents_key2": "<span style=\"\">Python</span> can create and modify Word documents, which have the .docx <span style=\"\">file</span> extension, with the <span style=\"\">python</span>-docx module. You can install the module by running pip install <span style=\"\">python</span>-docx. (Appendix A has full details on installing third-party modules.)",
	"word-documents_key3": "Note",
	"word-documents_key4": "When using pip to first install <span style=\"\">Python</span>-Docx, be sure to install <span style=\"\">python</span>-docx, not docx. The installation name docx is for a different module that this book does not cover. However, when you are going to import the <span style=\"\">python</span>-docx module, you’ll need to run import docx, not import <span style=\"\">python</span>-docx.",
	"word-documents_key5": "If you don’t have Word, LibreOffice Writer and OpenOffice Writer are both free alternative <span style=\"\">applications</span> for Windows, OS X, and Linux that can be used to open .docx <span style=\"\">files</span>. You can download them from <span><a href=\"https://www.libreoffice.org\">https://www.libreoffice.org</a></span> and <span><a href=\"http://openoffice.org\"></a></span>, respectively. The full documentation for <span style=\"\">Python</span>-Docx is available at <span><a href=\"https://<span style=\"\">python</span>-docx.readthedocs.org/\"&gt;https://<span style=\"\">python</span>-docx.readthedocs.org/</a></span>. Although there is a version of Word for OS X, this chapter will focus on Word for Windows.",
	"word-documents_key6": "Compared to plaintext, .docx <span style=\"\">files</span> have a lot of structure. This structure is represented by three different data types in <span style=\"\">Python</span>-Docx. At the highest level, a Document object represents the entire document. The Document object contains a list of Paragraph objects for the paragraphs in the document. (A new paragraph begins whenever the user presses ENTER or RETURN while typing in a Word document.) Each of these Paragraph objects contains a list of one or more Run objects. The single-sentence paragraph in Figure 13-4 has four runs."
}