{
	"CMS_key1": "CMS(Control Management System):-",
	"CMS_key2": "CMS ek computer ka software hai jo digital content ko banane, edit, modify or Publish karne ke kam me liya jata hai.Iss se phele CMS software ka use computer ki <span style=\"\">file</span> ko manage karne ke liye kiya jata tha.Lekin ab iska use web pages ko manage karne ke liye kiya jata hai.CMS ki madad se kai log ek hi website par kam kar sakte hai yani website ko Update kar sakte hai.",
	"CMS_key3": "CMS ke kuch functions hai:",
	"CMS_key4": "Ek website ko jaldi banane me madad karta hai.*",
	"CMS_key5": "CMS kisi bhi content ko badle bina ek primary template se madad deta hai.",
	"CMS_key6": "Iska use karna asan hota hai.",
	"CMS_key7": "Yeh SEO(Search engine optimization) friendly URL(unique research locator) provide karta hai.",
	"CMS_key8": "Yeh ek admin panel provide karta hai jisme bahut si languages provide ki jati hai.",
	"CMS_key9": "Agar aapko cms ke bare me aur samajna hai toh aap in links pe click karke yeh videos Dekh sakte hai.Agar aap english me comfor<span style=\"\">tab</span>le hai toh english video dekh sakte hai nahi toh hindi me dekh sakte hai.",
	"CMS_key10": "Do log ko mil kar sabse pehle yeh videos dekhni hai",
	"CMS_key11": "Mujhe umeed hai ki aap in videos ki madad se ache se samajh payenge.",
	"CMS_key12": "Ab aapko 30 mins ke liye aapas mei <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">english</span> mei inn topics ke baarein mei baat karni hai.",
	"CMS_key13": "Baat karte karte, aap observe karein, ki aap kitne tech words use kar paa rahe hai.",
	"CMS_key14": "Aur agar aapka partner koi aisa tech word bolta hai, jo aapko nahi pata, ya aap generally use nahi kartein. Inn words ko bhi samajhne ki phir koshish karein.",
	"CMS_key15": "Iss discussion ko karte hue, aap inn points ke baarein mei bhi soch sakte hai:",
	"CMS_key16": "what is full from of CMS?",
	"CMS_key17": "Define Cms?",
	"CMS_key18": "Functions of CMS?",
	"CMS_key19": "what are use of CMS?",
	"CMS_key20": "Full from of SEO?"
}