[
	{
		"component": "header",
		"variant": 1,
		"value": "Analyzing the Screenshot"
	},
	{
		"component": "text",
		"value": "Say that one of the steps in your GUI automation program is to click a gray button. Before calling the click() method, you could take a screenshot and look at the pixel where the script is about to click. If it’s not the same gray as the gray button, then your program knows something is wrong. Maybe the window moved unexpectedly, or maybe a pop-up dialog has blocked the button. At this point, instead of continuing—and possibly wreaking havoc by clicking the wrong thing—your program can “see” that it isn’t clicking on the right thing and stop itself."
	},
	{
		"component": "text",
		"value": "PyAutoGUI’s pixelMatchesColor() function will return <span style=\"\">True</span> if the pixel at the given x- and y-coordinates on the screen matches the given color. The first and second arguments are <span style=\"\">integers</span> for the x- and y-coordinates, and the third argument is a tuple of three <span style=\"\">integers</span> for the RGB color the screen pixel must match. Enter the following into the interactive <span style=\"\">shell</span>:"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": ">>> import pyautogui<br>   >>> im = pyautogui.screenshot()<br>❶ >>> im.getpixel((50, 200))"
	},
	{
		"component": "text",
		"value": "(130, 135, 144)"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": "❷ >>> pyautogui.pixelMatchesColor(50, 200, (130, 135, 144))"
	},
	{
		"component": "text",
		"value": "<span style=\"\">True</span>"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": "❸ >>> pyautogui.pixelMatchesColor(50, 200, (255, 135, 144))"
	},
	{
		"component": "text",
		"value": "<span style=\"\">False</span><br>After taking a screenshot and using getpixel() to get an RGB tuple for the color of a pixel at specific coordinates ❶, pass the same coordinates and RGB tuple to pixelMatchesColor() ❷, which should return <span style=\"\">True</span>. Then change a value in the RGB tuple and call pixelMatchesColor() again for the same coordinates ❸. This should return <span style=\"\">false</span>. This method can be useful to call whenever your GUI automation programs are about to call click(). Note that the color at the given coordinates must exactly match. If it is even slightly different—for example, (255, 255, 254) instead of (255, 255, 255)—then pixelMatchesColor() will return <span style=\"\">False</span>."
	}
]