[
	{
		"component": "header",
		"variant": 1,
		"value": "Dragging the Mouse"
	},
	{
		"component": "text",
		"value": "Dragging means moving the mouse while holding down one of the mouse buttons. For example, you can move <span style=\"\">files</span> between folders by dragging the folder icons, or you can move appointments around in a calendar app."
	},
	{
		"component": "text",
		"value": "PyAutoGUI provides the pyautogui.dragTo() and pyautogui.dragRel() functions to drag the mouse cursor to a new location or a location relative to its current one. The arguments for dragTo() and dragRel() are the same as moveTo() and moveRel(): the x-coordinate/horizontal movement, the y-coordinate/vertical movement, and an optional duration of time. (OS X does not drag correctly when the mouse moves too quickly, so passing a duration <span style=\"\">key</span>word argument is recommended.)"
	},
	{
		"component": "text",
		"value": "To try these functions, open a graphics-drawing <span style=\"\">application</span> such as Paint on Windows, Paintbrush on OS X, or GNU Paint on Linux. (If you don’t have a drawing <span style=\"\">application</span>, you can use the online one at <span><a href=\"http://sumopaint.com/.\">http://sumopaint.com/.</a></span>) I will use PyAutoGUI to draw in these <span style=\"\">applications</span>."
	},
	{
		"component": "text",
		"value": "With the mouse cursor over the drawing <span style=\"\">application</span>’s canvas and the Pencil or Brush tool selected, enter the following into a new <span style=\"\">file</span> <span style=\"\">editor</span> window and <span style=\"\">save</span> it as spiralDraw.py:"
	},
	{
		"component": "text",
		"value": "import pyautogui, time<br>❶ time.sleep(5)<br>❷ pyautogui.click()    # click to put drawing program in focus<br>   distance = 200<br>   while distance &gt; 0:<br>❸     pyautogui.dragRel(distance, 0, duration=0.2)   # move right<br>❹     distance = distance - 5<br>❺     pyautogui.dragRel(0, distance, duration=0.2)   # move down<br>❻     pyautogui.dragRel(-distance, 0, duration=0.2)  # move left<br>       distance = distance - 5<br>       pyautogui.dragRel(0, -distance, duration=0.2)  # move up<br>When you run this program, there will be a five-second delay ❶ for you to move the mouse cursor over the drawing program’s window with the Pencil or Brush tool selected. Then spiralDraw.py will take control of the mouse and click to put the drawing program in focus ❷. A window is in focus when it has an active blinking cursor, and the actions you take—like typing or, in this case, dragging the mouse—will affect that window. Once the drawing program is in focus, spiralDraw.py draws a square spiral pattern like the one in Figure 18-2."
	},
	{
		"component": "text",
		"value": "Figure 18-2. The results from the pyautogui.dragRel() example"
	},
	{
		"component": "text",
		"value": "The distance <span style=\"\">variable</span> starts at 200, so on the first iteration of the while <span style=\"\">loop</span>, the first dragRel() call drags the cursor 200 pixels to the right, taking 0.2 seconds ❸. distance is then decreased to 195 ❹, and the second dragRel() call drags the cursor 195 pixels down ❺. The third dragRel() call drags the cursor –195 horizontally (195 to the left) ❻, distance is decreased to 190, and the last dragRel() call drags the cursor 190 pixels up. On each iteration, the mouse is dragged right, down, left, and up, and distance is slightly smaller than it was in the previous iteration. By <span style=\"\">loop</span>ing over this <span style=\"\">code</span>, you can move the mouse cursor to draw a square spiral."
	},
	{
		"component": "text",
		"value": "You could draw this spiral by hand (or rather, by mouse), but you’d have to work slowly to be so precise. PyAutoGUI can do it in a few seconds!"
	},
	{
		"component": "header",
		"variant": 2,
		"value": "Note"
	},
	{
		"component": "text",
		"value": "You could have your <span style=\"\">code</span> draw the image using the pillow module’s drawing functions—see Chapter 17 for more information. But using GUI automation allows you to make use of the advanced drawing tools that graphics programs can provide, such as gradients, different brushes, or the fill bucket."
	}
]