[
	{
		"component": "header",
		"variant": 1,
		"value": "Moving the Mouse"
	},
	{
		"component": "text",
		"value": "Now that you understand screen coordinates, let’s move the mouse. The pyautogui.moveTo() function will instantly move the mouse cursor to a specified position on the screen. <span style=\"\">Integer</span> values for the x- and y-coordinates make up the function’s first and second arguments, respectively. An optional duration <span style=\"\">integer</span> or <span style=\"\">float</span> <span style=\"\">key</span>word argument specifies the number of seconds it should take to move the mouse to the destination. If you leave it out, the default is 0 for instantaneous movement. (All of the duration <span style=\"\">key</span>word arguments in PyAutoGUI functions are optional.) Enter the following into the interactive <span style=\"\">shell</span>:"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": ">>> import pyautogui<br>>>> for i in range(10):"
	},
	{
		"component": "text",
		"value": "pyautogui.moveTo(100, 100, duration=0.25)<br>  pyautogui.moveTo(200, 100, duration=0.25)<br>  pyautogui.moveTo(200, 200, duration=0.25)<br>  pyautogui.moveTo(100, 200, duration=0.25)"
	},
	{
		"component": "text",
		"value": "This example moves the mouse cursor clockwise in a square pattern among the four coordinates provided a total of ten times. Each movement takes a quarter of a second, as specified by the duration=0.25 <span style=\"\">key</span>word argument. If you hadn’t passed a third argument to any of the pyautogui.moveTo() calls, the mouse cursor would have instantly teleported from point to point."
	},
	{
		"component": "text",
		"value": "The pyautogui.moveRel() function moves the mouse cursor relative to its current position. The following example moves the mouse in the same square pattern, except it begins the square from wherever the mouse happens to be on the screen when the <span style=\"\">code</span> starts running:"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": ">>> import pyautogui<br>>>> for i in range(10):"
	},
	{
		"component": "text",
		"value": "pyautogui.moveRel(100, 0, duration=0.25)<br>  pyautogui.moveRel(0, 100, duration=0.25)<br>  pyautogui.moveRel(-100, 0, duration=0.25)<br>  pyautogui.moveRel(0, -100, duration=0.25)"
	},
	{
		"component": "text",
		"value": "pyautogui.moveRel() also takes three arguments: how many pixels to move horizontally to the right, how many pixels to move vertically downward, and (optionally) how long it should take to complete the movement. A negative <span style=\"\">integer</span> for the first or second argument will cause the mouse to move left or upward, respectively."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Getting the Mouse Position"
	},
	{
		"component": "text",
		"value": "You can determine the mouse’s current position by calling the pyautogui.position() function, which will return a tuple of the mouse cursor’s x and y positions at the time of the function call. Enter the following into the interactive <span style=\"\">shell</span>, moving the mouse around after each call:"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": ">>> pyautogui.position()"
	},
	{
		"component": "text",
		"value": "(311, 622)"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": ">>> pyautogui.position()"
	},
	{
		"component": "text",
		"value": "(377, 481)"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": ">>> pyautogui.position()"
	},
	{
		"component": "text",
		"value": "(1536, 637)<br>Of course, your return values will vary depending on where your mouse cursor is."
	}
]