[
	{
		"component": "header",
		"variant": 1,
		"value": "Shutting Down Everything by Logging Out"
	},
	{
		"component": "text",
		"value": "Perhaps the simplest way to stop an out-of-control GUI automation program is to log out, which will shut down all running programs. On Windows and Linux, the logout hot<span style=\"\">key</span> is CTRL-ALT-DEL. On OS X, it is -SHIFT-OPTION-Q. By logging out, you’ll lose any un<span style=\"\">save</span>d work, but at least you won’t have to wait for a full reboot of the computer."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Pauses and Fail-Safes"
	},
	{
		"component": "text",
		"value": "You can tell your script to wait after every function call, giving you a short window to take control of the mouse and <span style=\"\">key</span>board if something goes wrong. To do this, set the pyautogui.PAUSE <span style=\"\">variable</span> to the number of seconds you want it to pause. For example, after setting pyautogui.PAUSE = 1.5, every PyAutoGUI function call will wait one and a half seconds after performing its action. Non-PyAutoGUI instructions will not have this pause."
	},
	{
		"component": "text",
		"value": "PyAutoGUI also has a fail-safe feature. Moving the mouse cursor to the upper-left corner of the screen will cause PyAutoGUI to raise the pyautogui.FailSafeException exception. Your program can either handle this exception with try and except <span style=\"\">statements</span> or let the exception crash your program. Either way, the fail-safe feature will stop the program if you quickly move the mouse as far up and left as you can. You can disable this feature by setting pyautogui.FAILSAFE = <span style=\"\">False</span>. Enter the following into the interactive <span style=\"\">shell</span>:"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": ">>> import pyautogui<br>>>> pyautogui.PAUSE = 1<br>>>> pyautogui.FAILSAFE = True"
	},
	{
		"component": "text",
		"value": "Here we import pyautogui and set pyautogui.PAUSE to 1 for a one-second pause after each function call. We set pyautogui.FAILSAFE to <span style=\"\">True</span> to enable the fail-safe feature."
	}
]