{
	"return-values-and-return-statements_key1": "Return Values and return <span style=\"\">Statements</span>",
	"return-values-and-return-statements_key2": "When you call the len() function and pass it an argument such as 'Hello', the function call evaluates to the <span style=\"\">integer</span> value 5, which is the length of the <span style=\"\">string</span> you passed it. In general, the value that a function call evaluates to is called the return value of the function.",
	"return-values-and-return-statements_key3": "When creating a function using the def <span style=\"\">statement</span>, you can specify what the return value should be with a return <span style=\"\">statement</span>. A return <span style=\"\">statement</span> consists of the following:",
	"return-values-and-return-statements_key4": "The return <span style=\"\">key</span>word",
	"return-values-and-return-statements_key5": "The value or expression that the function should return",
	"return-values-and-return-statements_key6": "When an expression is used with a return <span style=\"\">statement</span>, the return value is what this expression evaluates to. For example, the following program defines a function that returns a different <span style=\"\">string</span> depending on what number it is passed as an argument. Type this <span style=\"\">code</span> into the <span style=\"\">file</span> <span style=\"\">editor</span> and <span style=\"\">save</span> it as magic8Ball.py:",
	"return-values-and-return-statements_key7": "❹ r = random.randint(1, 9)<br>❺ fortune = getAnswer(r)<br>❻ print(fortune)<br>When this program starts, <span style=\"\">Python</span> first imports the random module ❶. Then the getAnswer() function is defined ❷. Because the function is being defined (and not called), the execution skips over the <span style=\"\">code</span> in it. Next, the random.randint() function is called with two arguments, 1 and 9 ❹. It evaluates to a random <span style=\"\">integer</span> between 1 and 9 (including 1 and 9 themselves), and this value is stored in a <span style=\"\">variable</span> named r.",
	"return-values-and-return-statements_key8": "The getAnswer() function is called with r as the argument ❺. The program execution moves to the top of the getAnswer() function ❸, and the value r is stored in a parameter named answerNumber. Then, depending on this value in answerNumber, the function returns one of many possible <span style=\"\">string</span> values. The program execution returns to the line at the bottom of the program that originally called getAnswer() ❺. The returned <span style=\"\">string</span> is assigned to a <span style=\"\">variable</span> named fortune, which then gets passed to a print() call ❻ and is printed to the screen.",
	"return-values-and-return-statements_key9": "Note that since you can pass return values as an argument to another function call, you could shorten these three lines:",
	"return-values-and-return-statements_key10": "r = random.randint(1, 9)<br>fortune = getAnswer(r)<br>print(fortune)<br>to this single equivalent line:",
	"return-values-and-return-statements_key11": "print(getAnswer(random.randint(1, 9)))<br>Remember, expressions are composed of values and <span style=\"\">operators</span>. A function call can be used in an expression because it evaluates to its return value.",
	"return-values-and-return-statements_key12": "The None Value",
	"return-values-and-return-statements_key13": "In <span style=\"\">Python</span> there is a value called None, which represents the absence of a value. None is the only value of the NoneType data type. (Other programming languages might call this value null, nil, or undefined.) Just like the Boolean <span style=\"\">True</span> and <span style=\"\">False</span> values, None must be typed with a capital N.",
	"return-values-and-return-statements_key14": "This value-without-a-value can be helpful when you need to store something that won’t be confused for a real value in a <span style=\"\">variable</span>. One place where None is used is as the return value of print(). The print() function displays text on the screen, but it doesn’t need to return anything in the same way len() or <span style=\"\">input</span>() does. But since all function calls need to evaluate to a return value, print() returns None. To see this in action, enter the following into the interactive <span style=\"\">shell</span>:",
	"return-values-and-return-statements_key15": "Hello!",
	"return-values-and-return-statements_key16": "<span style=\"\">True</span><br>Behind the scenes, <span style=\"\">Python</span> adds return None to the end of any function definition with no return <span style=\"\">statement</span>. This is similar to how a while or for <span style=\"\">loop</span> implicitly ends with a continue <span style=\"\">statement</span>. Also, if you use a return <span style=\"\">statement</span> without a value (that is, just the return <span style=\"\">key</span>word by itself), then None is returned."
}