[
	{
		"component": "header",
		"variant": 1,
		"value": "The copy Module’s copy() and deepcopy() Functions"
	},
	{
		"component": "text",
		"value": "Although passing around references is often the handiest way to deal with lists and dictionaries, if the function modifies the list or dictionary that is passed, you may not want these changes in the original list or dictionary value. For this, <span style=\"\">Python</span> provides a module named copy that provides both the copy() and deepcopy() functions. The first of these, copy.copy(), can be used to make a duplicate copy of a mu<span style=\"\">tab</span>le value like a list or dictionary, not just a copy of a reference. Enter the following into the interactive <span style=\"\">shell</span>:"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": ">>> import copy<br>>>> spam = ['A', 'B', 'C', 'D']<br>>>> cheese = copy.copy(spam)<br>>>> cheese[1] = 42<br>>>> spam<br>['A', 'B', 'C', 'D']<br>>>> cheese<br>['A', 42, 'C', 'D']"
	},
	{
		"component": "text",
		"value": "Now the spam and cheese <span style=\"\">variables</span> refer to separate lists, which is why only the list in cheese is modified when you assign 42 at index 1. As you can see in Figure 4-7, the reference ID numbers are no longer the same for both <span style=\"\">variables</span> because the <span style=\"\">variables</span> refer to independent lists."
	},
	{
		"component": "text",
		"value": "cheese = copy.copy(spam) creates a second list that can be modified independently of the first."
	},
	{
		"component": "text",
		"value": "If the list you need to copy contains lists, then use the copy.deepcopy() function instead of copy.copy(). The deepcopy() function will copy these inner lists as well."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Summary"
	},
	{
		"component": "text",
		"value": "Lists are useful data types since they allow you to write <span style=\"\">code</span> that works on a modifiable number of values in a single <span style=\"\">variable</span>. Later in this book, you will see programs using lists to do things that would be difficult or impossible to do without them."
	},
	{
		"component": "text",
		"value": "Lists are mu<span style=\"\">tab</span>le, meaning that their contents can change. Tuples and <span style=\"\">strings</span>, although list-like in some respects, are immu<span style=\"\">tab</span>le and cannot be changed. A <span style=\"\">variable</span> that contains a tuple or <span style=\"\">string</span> value can be overwritten with a new tuple or <span style=\"\">string</span> value, but this is not the same thing as modifying the existing value in place—like, say, the append() or remove() methods do on lists."
	},
	{
		"component": "text",
		"value": "<span style=\"\">Variables</span> do not store list values directly; they store references to lists. This is an important distinction when copying <span style=\"\">variables</span> or passing lists as arguments in function calls. Because the value that is being copied is the list reference, be aware that any changes you make to the list might impact another <span style=\"\">variable</span> in your program. You can use copy() or deepcopy() if you want to make changes to a list in one <span style=\"\">variable</span> without modifying the original list."
	}
]