{
	"task9_key1": "Task 9",
	"task9_key2": "Generally jab hum koi bhi data scrape karte hain uss website se toh uss website ke servers pe bahot load padta hai. Abhi toh aap sirf bahot thodi si requests maar rahe ho IMDB ke servers pe. Lekin aap yeh socho ki agar aapko IMDB ki saari movies scrape karni hai. IMDB pe duniya bhar ki movies ka data hai. Matlab kuch crore movie hongi. Agar aap 10 crore movies ka data scrape kar rahe ho toh yeh karna padega:",
	"task9_key3": "Har movie ka main page khol ke uska data scrape karna.",
	"task9_key4": "Uss movie ka cast wala page khol ke saare actors aur actresses ki list scrape karna.",
	"task9_key5": "Matlab agar 10 crore movies scrape ho rahi hai, toh around 20 crore requests kar rahe hoge aap IMDB ke servers pe. Itni saari requests se IMDB ki servers pe load padega aur iss chakar mein IMDB ke servers humein block kar denge. ",
	"task9_key6": "Bahot important hai yeh samjhna ki websites scrapers ko kyun block karti hai aur hum isko kaise prevent kar sakte hai. You should spend some time researching and understanding this. Aur better hoga ki aap yeh apne kuch friends ke saath padh ke samjho. Akele karke utni clarity nahi milegi. Google karke samjho :) Neeche main kuch links de raha hun jahan se aap apni research shuru kar sakte ho.",
	"task9_key7": "https://www.quora.com/I-was-scraping-a-website-and-they-blocked-me-How-can-I-get-around-this",
	"task9_key8": "https://www.quora.com/How-do-you-prevent-yourself-from-being-blocked-when-scraping-a-websites-data-like-Oodle-does-to-craigslist",
	"task9_key9": "https://www.octoparse.com/blog/scrape-websites-without-being-blocked",
	"task9_key10": "Yeh links padhte hue aapko bahot saari new terms milegi. Aapko unn saari terms ke baare mein ache se research kar ke samjhna padega.",
	"task9_key11": "Generally jab bhi websites aapke scrapers ko block karte hain toh woh aapke computers ya laptop ke public IP ko block karte hain. Best yeh hai ki aap apne phone ke hotspot se internet ka use kar ke scraping karo. Phones apna assigned IP har baar internet on/off karne pe change kar dete hain. Toh agar aap kabhi b lock hue bhi toh jaldi se IP change kar sakte hain. Jab aapko ek website block karegi toh aap request maaroge toh kuch <span style=\"\">error</span> aane lagegi.",
	"task9_key12": "Abhi blocking ko prevent karne ke liye humein IMDB ko dikhane ki zaroorat hai ki hum ek human user hain aur scraper nahi hai. Generally jab bhi human users website ka use karte hain toh har request mein (page khulne mein) alag alag time hota hai. Lekin yahan humara <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">get_movie_list_details</span> ek <span style=\"\">loop</span> mein ek baad baad ek request maar raha hai. Iss task mein aapko apni har request ke beeche mein ek 1 se 3 ke beech mein kuch random seconds ka sleep timer lagana hai.",
	"task9_key13": "Iske liye aapko <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">random.randint</span> ka use kar ke ek random <span style=\"\">integer</span> choose karo 1 aur 3 ke beech mein. Fir <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">time.sleep</span> ka use kar ke apne program ko utni der ke liye sleep karvao.",
	"task9_key14": "Yeh task complete kar ne ke baad aapko <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">get_movie_list_details</span> wala function saari 250 movies ki list ke saath call karna hai. Yeh bhi ensure kar lena ki aapka <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">scrape_movie_details</span> wala function aapke data ko cache kar raha hai. Aur ek baar apna <span style=\"\">code</span> chala ke saari 250 movies ki poori details cache mein store kar lo ki aage wala saara <span style=\"\">code</span> likhna asaan ho.",
	"task9_key15": "Hint",
	"task9_key16": "<span style=\"\">Python</span> ke sheel mein ek <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">help</span> function hota hai. Aap uss function mein koi bhi object ya dusra function doge toh woh uski documentation dikha dega. Documentation woh hoti hai jo programmers apna <span style=\"\">code</span> likhte hue dusre programmers ke liye likhte hai. Kisi bhi function ki documetation dekh ke woh function use karna asan ho jayega.",
	"task9_key17": "<span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">random.randint</span> ka documentation dekhne ke liye aapko apne <span style=\"\">shell</span> mein yeh <span style=\"\">code</span> chalana padega:",
	"task9_key18": "Isko try karo. Aise hi aap neeche waale <span style=\"\">code</span> chala ke <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">time.sleep</span> ki documentation dekh sakte ho.",
	"task9_key19": "Agar aapko ek function ki documentation dekhni hai toh uss function ko call kare bina <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">help</span> mein pass karo. Agar call kar ke pass kar do toh woh uss function ki return value ki documentation dikhayega. Basically <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">help</span> ko jo bhi object milta hai woh uski documentation dikhata hai.",
	"task9_key20": "Solution Video :-",
	"task9_key21": "<b>Created by Vishal Gaddam</b>",
	"task9_key22": "(",
	"task9_key23": "vishal18@navgurukul.org",
	"task9_key24": ")"
}