{
	"task14_key1": "Task 14",
	"task14_key2": "Saari movies ke cast wale page pe lead actors aur actresses ki list top pe di hoti hai. Jaise Anand ka caste page kuch aisa dikhta hai.",
	"task14_key3": "Anand Cast Page",
	"task14_key4": "List mein jinn actors/actresses ka naam pehle hota hai woh lead actors hote hain generally. Jo movie mein kam dikhte hain unka naam neeche hota hai. Humne yeh dekhna hai ki kaunse actors/actresses ke saath kaun kaun act karta hai? Toh humein aisa <span style=\"\">code</span> likhna hai jo yeh wale questions answer kar paye:",
	"task14_key5": "Amitabh Bachan ke saath kaunse actors aur actresses sabse zyada act karte hain?",
	"task14_key6": "Deepika Padukone ke saath kaun kaun si actors/actresses sabse zyada act karte hain?",
	"task14_key7": "Lekin abhi apne analysis ko asaan banane ke liye hum har movie ke top ke 5 actors/actresses ki baat karenge. Uske neeche wale pe aap baad mein analysis kar ke dekh sakte ho?",
	"task14_key8": "Yeh karne ke liye aapko ek <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">analyse_co_actors</span> naam ka function likhna hai jo ki <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">movies_list</span> naam ka ek parameter lega. Iss parameter mein saari movies aur unki cast ki list hogi. Basically jo list aapka updated <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">get_movie_list_details</span> wala function return karta hai woh iss function mein parameter ki tarah jayegi. Iss list mein har movie ki details ke saath saath uski cast ki details bhi honi chaiye. Yeh <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">movies_list</span> kuch aisi dikhegi:",
	"task14_key9": "Yeh list leke aapke function ko ek dictionary return karni hai jiska structure kuch aisa hoga:",
	"task14_key10": "Iss dictionary mein dekho kaise top level pe actors ki IMDB ki ID hai aur naam nahi. ID humesha unique hoti hai lekin shayad kuch do logon ke naam same ho sakte hain. Isliye jab bhi aap <span style=\"\">code</span> likh rahe ho toh koshish karo ki ID ke basis pe apni conditions likh rahe ho aur naam ke hisaab se nhi.",
	"task14_key11": "Isko samjhne ke liye Facebook pe apne naam ki Search Karo. Aapko hundreds of log milenge jinka shayad aapke vala naam hai. Lekin Facebook ke liye sab alag hai. Woh isliye hai kyunki FB unki ID ke hisaab se <span style=\"\">code</span> likhta hai aur na hi naam ke hisaab se.",
	"task14_key12": "Top level pe IMDB ID waali ek <span style=\"\">key</span> jiski value mein bhi ek aur dictionary hai. Iss dictionary mein uss actor ka naam hai jiski woh ID hai <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">\"name\"</span> naam ki ek <span style=\"\">key</span> mein. Fir ek <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">frequent_co_actors</span> ki list hai. Iss list mein kuch dictinaries hain. Jinmein yeh sab data hai:",
	"task14_key13": "<span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">name</span>: Uss actor ka naam jo Rajesh Khanna ke saath acting karta hai.",
	"task14_key14": "<span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">imdb_id</span>: Uss actor ki IMDB ID jiska naam likha hua hai.",
	"task14_key15": "<span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">num_movies</span>: Total kitni movies mein woh actor <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">\"Rajesh Khanna\"</span> ke saath aaya hai.",
	"task14_key16": "Remember abhi ke liye aapne saari 250 movies ki caste ke top 5 members pe hi aapne yeh analysis run karna hai.",
	"task14_key17": "Bonus",
	"task14_key18": "<span style=\"\">Python</span> mein ek Plotly naam ki library hoti hai. Aap usse kuch interesting graphs plot kar sakte ho. Aap uska use kar ke apne analysis ke around kuch ache graphs plot kar sakte ho."
}