{
	"task10_key1": "Task 10",
	"task10_key2": "Ab humne saari 250 movies ki list toh scrape kar li hai. Iss task mein humne kuch aur analysis.",
	"task10_key3": "Abhi tak humne directors aur languages ka analysis alag alag se kia tha. Toh humare paas yeh data tha ki har director ki total kitni movies hain aur languages ke hisaab se bhi movies ki frequency thi. Ab humein in dono ko combine karna hai?",
	"task10_key4": "Ab humein yeh samajhna hai ki <b>Kaunse directors kaun kaun si languages mein movies banante hain? Aise kaunse diectors hai jo ek se zyada langauges mein movies direct karte hain?</b>",
	"task10_key5": "Iske liye aap ek function likhoge jiska naam hoga <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">analyse_language_and_directors</span>. Yeh function ek parameter lega called <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">movies_list</span>. Iss parameter mein woh list hogi jo <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">get_movie_list_details</span> wala function return karta hai. Matlab woh list kuch aisi dikhegi:",
	"task10_key6": "<b>Yeh dhyan rakhna ki aapne yeh analysis saari 250 movies ki list pe run karna hai.</b>",
	"task10_key7": "Aapke function ka return value ek dictionary hoga. Yeh dictionary kuch aisi dikhegi:",
	"task10_key8": "Kyunki har movies mein director aur languages dono lists hain aur ek <span style=\"\">string</span> nahi hai. Agar ek movie ke 2 directors aur saath saath 2 languages bhi hai toh uss movie ki counting dono languages mein bhi hogi, aur dono directors mein bhi hogi.",
	"task10_key9": "Hint",
	"task10_key10": "Nested loops ka use karo :)",
	"task10_key11": "Solution Video :",
	"task10_key12": "<b>Created by</b> vishal18@navgurukul.org"
}