{
	"task4_key1": "Task 4",
	"task4_key2": "Ab humne movies ki list se ek ache se structure mein unki details nikalne ka scraper toh likh liya hai <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">scrape_top_list()</span> waale function mein. Aap agar notice karoge toh har <b>Top Rated Indian Movies</b> waali list mein har movie ka ek alag link diya hua hai. Iss linked page pe uss movie ki saari details depth mein likhi hui hain. Iss task mein humne ek aur function likhna hai jo uss movie ke saari indivual details nikalega.",
	"task4_key3": "Anand IMDB",
	"task4_key4": "Iss function ka naam ",
	"task4_key5": "<span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">scrape_movie_details</span>",
	"task4_key6": "hoga. Yeh function ek parameter lega called ",
	"task4_key7": "<span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">movie_url</span>",
	"task4_key8": "jismein uss movie ka URL hai jiski details nikalni hai. Iss function ko ek dictionary return karni hogi. Iss dictionary ka structure neeche diya hua hai. Agar aap yeh <span style=\"\">code</span> Anand movie (",
	"task4_key9": "https://www.imdb.com/title/tt0066763/",
	"task4_key10": ") ke liye chala rahe ho toh woh function neeche di hui dictionary return karega.",
	"task4_key11": "Kuch important cheezein aapko apne dimaag mein rakhni hai when writing the <span style=\"\">code</span> for this function.",
	"task4_key12": "Upar waali dictionary mein har value ki data type ko gaur se dekho. Yahan dia hua data type aur aapki final dictionary ka output same hona chaiye.",
	"task4_key13": "Genre mein ek strings ki list hai. Kyunki Anand ki sirf ek hi Genre hai toh usme sirf ek string hai. Kuch movies ki multiple genre hoti hai aur woh comma se seperated diye hote hain. Toh uss case mein genre waali list mein alag alag strings hone chaiye. Aisi ek movie <b>Andhadhun</b> (https://www.imdb.com/title/tt8108198/) hai.",
	"task4_key14": "Anand ka toh ek hi director hai isliye uski <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">\"director\"</span> waali list mein sirf <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">[\"Hrishikesh Mukherjee\"]</span> hai. Lekin kuch movies hoti hai jinme ek se zyada director hote hain. Unn movies mein saare directors ka naam comma seperated hona chaiye. <b>Taare Zameen Par</b> (https://www.imdb.com/title/tt0986264/) ek aisi movie hai jiske IMDB ke hisaab se 2 directors hain.",
	"task4_key15": "Directors aur Genre ki tarah ek movie mein multiple languages ka use bhi kia ho sakta hai. Isiliye <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">languages</span> waali dictionary key bhi list of strings ki honi chaiye. Nayakan ek aisi movie hai jismein multiple languages hain. (https://www.imdb.com/title/tt0093603/)",
	"task4_key16": "Notice karo <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">\"runtime\"</span> key mein bas ek integer hain. Waise runtime jo hai woh <b>2h 13m</b> jaise format mein dia hota hai. Aapko iss format ko sirf minutes mein convert karna hoga. Jaise <b>2h 13m</b> 133 minutes ban jayega kyunki <b>(2*60) + 13 = 133</b>. Isliye 133 minutes.",
	"task4_key17": "Submit karne se pehle apne <span style=\"\">code</span> ko at least 10 movies ke alag alag pages ke test karke dekho ki aapka <span style=\"\">code</span> sahi results return kar raha hai.",
	"task4_key18": "Solution",
	"task4_key19": "<b>Created by Vishal Gaddam</b>",
	"task4_key20": "(",
	"task4_key21": "vishal18@navgurukul.org",
	"task4_key22": ")"
}