{
	"chapter-11_key1": "# Chapter 11\n\n",
	"chapter-11_key2": "The webbrowser module has an open() method that will launch a web browser to a specific URL, and that’s it. The requests module can download `files` and pages from the Web. The BeautifulSoup module parses HTML. Finally, the selenium module can launch and control a browser.\n",
	"chapter-11_key3": "The requests.get() function returns a Response object, which has a text attribute that contains the downloaded content as a `string`.\n",
	"chapter-11_key4": "The raise_for_status() method raises an exception if the download had problems and does nothing if the download succeeded.\n",
	"chapter-11_key5": "The status_`code` attribute of the Response object contains the HTTP status `code`.\n",
	"chapter-11_key6": "After opening the new `file` on your computer in 'wb' “write binary” mode, use a for `loop` that iterates over the Response object’s iter_content() method to write out chunks to the `file`. Here’s an example:\n",
	"chapter-11_key7": "`save``File` = open('`file`name.html', 'wb')\nfor chunk in res.iter_content(100000):\n    `save``File`.write(chunk)\nF12 brings up the developer tools in Chrome. Pressing CTRL-SHIFT-C (on Windows and Linux) or ⌘-OPTION-C (on OS X) brings up the developer tools in Firefox.\n",
	"chapter-11_key8": "Right-click the element in the page, and select Inspect Element from the menu.\n",
	"chapter-11_key9": "'#main'\n",
	"chapter-11_key10": "'.highlight'\n",
	"chapter-11_key11": "'div div'\n",
	"chapter-11_key12": "'button[value=\"favorite\"]'\n",
	"chapter-11_key13": "spam.getText()\n",
	"chapter-11_key14": "linkElem.attrs\n",
	"chapter-11_key15": "The selenium module is imported with from selenium import webdriver.\n",
	"chapter-11_key16": "The find_element_* methods return the first matching element as a WebElement object. The find_elements_* methods return a list of all matching elements as WebElement objects.\n",
	"chapter-11_key17": "The click() and send_`keys`() methods simulate mouse clicks and `key`board `keys`, respectively.\n",
	"chapter-11_key18": "Calling the submit() method on any element within a form submits the form.\n",
	"chapter-11_key19": "The forward(), back(), and refresh() WebDriver object methods simulate these browser buttons.\n"
}