{
	"Mentor_Mentee_System_key1": "## Mentor : Mentee System\n\n\n",
	"Mentor_Mentee_System_key2": "## Mentor\n\n\n",
	"Mentor_Mentee_System_key3": "**A mentor is a student who guides another student by building trust and modeling positive behaviors. An effective mentor understands that her role is to be like a teacher, a motivator, a role model, an advisor and should be a very strong support system to the mentee.**\n",
	"Mentor_Mentee_System_key4": " At Navgurukul,\n",
	"Mentor_Mentee_System_key5": "A mentor should be allotted to new students to help them in their studies.\n",
	"Mentor_Mentee_System_key6": "A mentor should give at least 1 hour daily.\n",
	"Mentor_Mentee_System_key7": "A mentor should take interviews of their mentee by the end of the week.\n",
	"Mentor_Mentee_System_key8": "After taking the interview, the mentor should update the Progress Tracker sheet for her mentee based on her mentee’s interview performance.\n",
	"Mentor_Mentee_System_key9": "For the interview, the mentor can also ask her mentee to make a presentation/ video of that given topic.\n",
	"Mentor_Mentee_System_key10": "This progress Tracker Sheet is handled by TNP’s(Training and Placement Coordinators).\n",
	"Mentor_Mentee_System_key11": "If the mentee feels that her mentor needs to work or improve her explanation skills then the mentor can ask her mentee to take a class with lots of real-life examples on the given topic. This will not only improve their explanation skills but also help in boosting her confidence.\n\n\n\n",
	"Mentor_Mentee_System_key12": "**The selection process of a mentor is not very specific, any student can become a mentor if she completes her topics and can handle their mentees’ academics effectively. Every student has to become a mentor either weak or strong.**\n",
	"Mentor_Mentee_System_key13": "## Benefits of mentoring for Mentors:-\n\n\n",
	"Mentor_Mentee_System_key14": "Boosts self-confidence.\n",
	"Mentor_Mentee_System_key15": "Builds self-awareness.\n",
	"Mentor_Mentee_System_key16": "Develops Leadership skills.\n",
	"Mentor_Mentee_System_key17": "Communication skills and learn the art of    giving feedback to mentees.\n",
	"Mentor_Mentee_System_key18": "Learn the art of asking questions.\n",
	"Mentor_Mentee_System_key19": "Becomes an active listener.\n\n\n",
	"Mentor_Mentee_System_key20": "## Mentee\n\n\n",
	"Mentor_Mentee_System_key21": "**The mentee is the student who learns from the mentors and utilizes that knowledge to complete that particular topic and also further studies.**\n",
	"Mentor_Mentee_System_key22": "So, here in Navgurukul, there is a Mentor/Mentee Tree designed where it's shown who is the mentor of whom.\n"
}