[
	{
		"component": "header",
		"variant": 1,
		"value": "General Body Meeting"
	},
	{
		"component": "text",
		"value": "General body NavGurukul ke sabhi sabhi students se milkar bani hai. Council ki performance ko review karne ke liye har mahine general body ki ek meeting hogi. Is meeting me council ki sabhi committees poori general body ke saamne apne pichle ek mahine ke kaam aur experiences ko Good, Bad and Ugly format me rakhengi. Ye GBU report Center ke sath bhi share ki jayegi. "
	},
	{
		"component": "text",
		"value": "GUB format me report banane ke liye ise ek guideline ki tarah use kiya ja sakta hai: "
	},
	{
		"component": "text",
		"value": "<b>The Good:</b> "
	},
	{
		"component": "text",
		"value": "Campus me kya positive change laaye gaye? ",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Council ka member bankar is dauraan aapne kin challenges ko overcome kiya? ",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "<b>The Bad:</b>"
	},
	{
		"component": "text",
		"value": "Wo cheezein jo galat ho gayi lekin aapko unse seekhne ko mila aur unhe thodi mehnat se theek kiya ja sakta hai.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "<b>The Ugly:</b>"
	},
	{
		"component": "text",
		"value": "Wo cheezein jo bahut jyada kharab ho gayi. Jinhe high priority par rakhkar jaldi se resolve karne ki zaroorat hai. ",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Is exercise ka motive hai ki council members apne kaam ko acche se review karke poori community ke saath share kar sakein. Is se unke apni pichli galatiyon ke through unhe ye acknowledge karne me madad milegi ki kis area me unhe jayda effort lagane ki zaroorat hai."
	},
	{
		"component": "text",
		"value": "Is meeting me general body ke members bhi appreciation aur disappointment share kar sakte hain. Unse expect kiya jata hai ki council ke kaam ko aur behtar banane ke liye wo constuctive feedback provide karein."
	}
]