[
	{
		"component": "header",
		"variant": 2,
		"value": "Introduction"
	},
	{
		"component": "header",
		"variant": 3,
		"value": "What is Probation?"
	},
	{
		"component": "text",
		"value": "If a student does end up on academic probation, don't panic. Being placed on academic probation is usually not the same as being asked to leave campus. Students are given a probationary period to demonstrate that they can indeed make successful academic progress.  "
	},
	{
		"component": "text",
		"value": "Academic probation is to indicate that a student is not making progress Navgurukul required for completion of the software development course. It also means that a student’s grades and/or overall performance are not high enough to continue on campus if they do not improve.  "
	},
	{
		"component": "header",
		"variant": 3,
		"value": "What leads to Academic Probation?"
	},
	{
		"component": "text",
		"value": "Every student who is joining Navgurukul will be in the probation period for the first two months. A student is further placed on Academic Probation based on the following criteria.  "
	},
	{
		"component": "header",
		"variant": 4,
		"value": "Based on the review of Coaches and Academic Associate, if it is found that a student is not serious about their academics"
	},
	{
		"component": "text",
		"value": "And is not cleear with their previous concepts",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Making unnecessary excuses to avoid coding continuously for 15 days,",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Not giving 7 hours at least for coding in a day.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "header",
		"variant": 4,
		"value": "If a student is failing to maintain 70% of their engagement in academic activities such as"
	},
	{
		"component": "text",
		"value": "Conducting Stand up,",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Participating in Academic circles,",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Involving in Pair-Peer Learning",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Taking classes",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Conducting and participating in interviews,",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Mentoring students",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Attending volunteer run sessions",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "If the student receives three red flags continuously in weekly assessment tests.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "header",
		"variant": 3,
		"value": "How can you clear the Academic Probation?"
	},
	{
		"component": "header",
		"variant": 4,
		"value": "The student should be given a personal mentor and an advisor in resolving academic probation"
	},
	{
		"component": "text",
		"value": "They will take the assistance of their assigned mentors daily in solving their problems in learning.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Once in a week T&amp;Ps will interview probationary students.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Assigned mentors will give updates to Academic associates on alternate days. Students should make extra efforts and give extra time to studies, a change in his/her day to day schedule and share a proposed timeline to cope up with the studies.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "header",
		"variant": 4,
		"value": "Make a list of what he/she needs to do day-wise for a month"
	},
	{
		"component": "text",
		"value": "Week 1 : Dry run needs to be done till the topic that student is doing under the guidance of the respective mentor, and then T&amp;P will interview them and then work on feedback.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Week 2: Each student needs to plan 3 classes till the topic with properdocumentation which they need to share before the class and T&amp;P will interviewthem, then work on feedback.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Week 3: Sprint and Projects decided by academic associates.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Week 4: For checking their improvement we will give a new topic to completewithin the timeline.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "The academic associates will take the final interview.Set up a personal hackathon often in this period, if needed",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "header",
		"variant": 3,
		"value": "SOP needs to be followed during Academic Probation"
	},
	{
		"component": "header",
		"variant": 4,
		"value": "Step: 1:"
	},
	{
		"component": "text",
		"value": "Weekly feedback on progression to be given to the student by an Academic Associate or T&amp;P and same to be communicated to the Academic lead/Program Manager (if student performance improved no need to follow next step)"
	},
	{
		"component": "header",
		"variant": 4,
		"value": "Step: 2:"
	},
	{
		"component": "text",
		"value": "In case if still there is no performance improvement after a month of feedback he/she should be placed under probation after discussing with the Academic lead/Program Manager"
	},
	{
		"component": "text",
		"value": "Join discussion with the Student, Academic Associate, and Academiclead/Program Manager on feedback and scope of the improvement plan",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Academic Associate should send a formal notice to the student over the email.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Campus team to assign an advisor/mentee to the student who will mentorpersonally for a month",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Student to prepare a study planner and share the details with the team (tracker to be shared by the team)",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Student to cut down from all the extracurricular activities in which he/she isenrolled",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "The student will be free to indulge in a personal hackathon, unlimited until theprobation period continue",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Academic associate to closely monitor the student for a month and help him/herwith timely feedback and guidance",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "header",
		"variant": 3,
		"value": "Step: 3:"
	},
	{
		"component": "text",
		"value": "After completion of 30 days in probation Academic Associate reviews the performance and shares the final report with the team."
	},
	{
		"component": "text",
		"value": "If there is improvement in the student’s progress, then the probationary periodwill be discontinued.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "If there is no satisfactory progress, as decided by the Academic Associate, step 4 needs to be followed.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "header",
		"variant": 3,
		"value": "Step:4:"
	},
	{
		"component": "text",
		"value": "A joint discussion with the student, student Parents/Guardian, Academic Associate, Academic lead, Program Manager, and Program Lead"
	},
	{
		"component": "header",
		"variant": 4,
		"value": "Team to discuss with the student and his/her parents/guardian if he/she is willing to give a last try"
	},
	{
		"component": "text",
		"value": "If the student is willing to try, the team has to give a grace period of 15days to work with the student and help him/her improve academically",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "If the student is not willing to give it a try, share the final termination notice with the student, parents/guardian, and partners",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "header",
		"variant": 3,
		"value": "Step: 5:"
	},
	{
		"component": "text",
		"value": "If there is improvement in the student’s progress, then the probationary period will be discontinued."
	},
	{
		"component": "text",
		"value": "If there is no satisfactory progress, as decided by the Academic Associate, share the final termination notice with the student, parents/guardian, and partners"
	}
]