[
	{
		"component": "header",
		"variant": 3,
		"value": "<ol><br><li>Introduction</li><br></ol>"
	},
	{
		"component": "text",
		"value": "The purpose of the policy is to create a safe environment in the campus with<br>regards to herself and others including the students and team members. The<br>need of the policy is to provide a space for the student to reflect, understand and take accoun<span style=\"\">tab</span>ility and responsibility for his/her actions and reactions."
	},
	{
		"component": "text",
		"value": "Keeping in mind the usage of probation in the current document is not to provide<br>any form of threatening and non-inclusivity approach. It is drafted in a way<br>aligning to the thought and vision of the organization, NavGurukul, which caters<br>to re-working and supporting the overall performance of the student."
	},
	{
		"component": "header",
		"variant": 3,
		"value": "<ol start=\"2\"><br><li>What leads to culture probation?</li><br></ol>"
	},
	{
		"component": "text",
		"value": "Where a student has been found responsible for violating the environment,<br>discipline, rules and regulations and has been engaged in an activity which<br>is unaccep<span style=\"\">tab</span>le and poses threat to the immediate community."
	},
	{
		"component": "header",
		"variant": 3,
		"value": "<ol start=\"3\"><br><li>SOP needs to be followed during Culture Probation</li><br></ol>"
	},
	{
		"component": "header",
		"variant": 4,
		"value": "Step 1:"
	},
	{
		"component": "text",
		"value": "There needs to be a detailed conversation regarding the student between<br>the DISCO and community manager about the history of the student."
	},
	{
		"component": "header",
		"variant": 4,
		"value": "Step 2 :"
	},
	{
		"component": "text",
		"value": "If the incidences of disciplinary issues are surpassing the limit, the<br>community manager will <span style=\"\">loop</span> in the Program Manager along with Program lead<br>for discussing the issue in a joint call."
	},
	{
		"component": "header",
		"variant": 4,
		"value": "Step 3:"
	},
	{
		"component": "text",
		"value": "As the second warning will be provided by the Program Lead along with<br>the campus team to the student, which will be <span style=\"\">execute</span>d a) via joint call b) via<br>email with detailed information."
	},
	{
		"component": "header",
		"variant": 4,
		"value": "Step 4 :"
	},
	{
		"component": "text",
		"value": "The email will be the third warning stage for the student , which will have<br>a probation tenure of the student (one month probation period), jointly decided<br>by the team."
	},
	{
		"component": "header",
		"variant": 4,
		"value": "Step 5:"
	},
	{
		"component": "text",
		"value": "The final stage will be suspension. After following all the above steps if there is no sign of improvement, the campus team jointly with the lead will opt for suspension of the student and discuss the same with the associated<br>stakeholders (NGO Partners/Guardians)."
	},
	{
		"component": "header",
		"variant": 3,
		"value": "<ol start=\"4\"><br><li>Additional Step to be followed by Campus Team</li><br></ol>"
	},
	{
		"component": "header",
		"variant": 4,
		"value": "Step 1 :"
	},
	{
		"component": "text",
		"value": "The community manager needs to maintain the tracker of the students creating repetitive and multiple disciplinary issues in the campus."
	},
	{
		"component": "header",
		"variant": 4,
		"value": "Step 2:"
	},
	{
		"component": "text",
		"value": "The following tracker needs to be shared with the campus team + outreach team and with the DISCO."
	},
	{
		"component": "header",
		"variant": 4,
		"value": "Step 3 :"
	},
	{
		"component": "text",
		"value": "While the student who is culture probation period, they will be exempted<br>to participate in council elections/ stand for any of the council post."
	}
]