{
	"WritingUserStory_key1": "Kaafi baar jab hum koi `application` banana chahte hain to hum iss baat par atak jaate hain ki hum shuru kahan se karein?\nIse aap programmer's *hurdle*(jise paar karna mushkil hai) keh sakte hain....Hum itni saari cheeze saath mein sochne lag jaate hain ki humara dimaag blank ho jata hai. Ye bahut normal baat hai aur aisa sabke saath hota hai.\n",
	"WritingUserStory_key2": "Programming mein iss situation se nikalne ke liye kai tools bhi hain. Ek aisa hi powerful tool hai - User Stories likhna.\n",
	"WritingUserStory_key3": "Aap apne app ke saare functionalities (behaviour) ko sequentially (1,2,3..)likhiye. Hur functionality ko jitna breakdown kar sakte hain karein.\n",
	"WritingUserStory_key4": "Ab har functionality ko *user story* form mein aise likhe:\n",
	"WritingUserStory_key5": "**As a <*type of user*> I want <*some function*> so that <*some reason*>**\n",
	"WritingUserStory_key6": "Iss tarah se har functionality ke liye aap user story likh sakte hain. \n",
	"WritingUserStory_key7": "Ache user story hamesha INVEST follow karte hain:\n",
	"WritingUserStory_key8": "I -> Independent\nN -> Negotiable\nV -> Valuabel\nE -> Estimable\nS -> Small\nT -> Tes`tab`le\n",
	"WritingUserStory_key9": "INVEST acronym ko samjhne ke liye aap\n",
	"WritingUserStory_key10": "yahan\n",
	"WritingUserStory_key11": "padh sakte hain.\nIss ko padhne mei aap 15-20 minutes spend kar sakte hai.\n",
	"WritingUserStory_key12": "User stories ke baare mein aur janna hai toh aap\n",
	"WritingUserStory_key13": "yahan\n",
	"WritingUserStory_key14": "aur\n",
	"WritingUserStory_key15": "yahan\n",
	"WritingUserStory_key16": "padh sakte hain.\nAap isko padhne mein 30 min - 1 hour spend kar sakte hain.\n",
	"WritingUserStory_key17": "`Application` par kaam karte hue hum har user story ko alag-alag fulfill karne ki kosis karte hain. \nIsse hamara pura `application` chote functions mein breakdown ho jata hai jisse humara kaam asan ho jata hai.\n",
	"WritingUserStory_key18": "**Self-Practice**\nIss activity ko aap akele kariye, aur karne mein 1 se 2 ghante lagaiye. Agar nahi hota hai, toh aap aage badh sakte hain, aur jab aapko lagta hai ki aapke paas koi fresh idea hai toh isey aap dobara karein.\n",
	"WritingUserStory_key19": "Ek Javascript `Application` sochiye jo aap design karna chahte hon. Aapka `application` ek game ho sakta hai ya aisa `application` ho sakta hai jo aapke aaspas kisi problem ko solve kare.\n",
	"WritingUserStory_key20": "Ab upar diye hue instructions ko follow karte hue, apne `application` ko *user stories* mein breakdown karein. Apne `application` ke har functionality ko user story ka form dein.\n",
	"WritingUserStory_key21": "Kya aapko apna `application` pehle se kam intimidating lag raha hai?\n",
	"WritingUserStory_key22": "Kya aapke user story INVEST acronym follow karte hain? Apne peer ko dikha kar check karvaiye ki aapki user story kaun kaun se elements ko follow karte hain.\n\n",
	"WritingUserStory_key23": "Apne friend (peer) ko apne user-story dikhaiye. Aapka friend ko user-story padh kar aapke `application` ke baare mein sab kuch pata chal jaana chahiye. Agar use kuch confusion hai, to aap wapas se user story mein kaam kijiye taki woh better understandable ho.\n"
}