{
	"json_xml_key1": "# JSON\n\n",
	"json_xml_key2": "Json ek aasaan text-based open source data-interchange ka format hai . yah pooree tarah se independent language hai aur is ka jyadatar hisaa modern programming languages ke saath use kiya ja sakata hai .\n",
	"json_xml_key3": "json javascript object notation par sthir hai . json object server aur client ke beech data ko transfer karane ke lie upayog kiya jaata hai .\njson xml par kaee phaayade hain haalaanki xml ek hee purpose ke lie work karata hai .\njson `file` ko .json extension se banaya jaata hai . json ka internet media type \"`application`/json\" hai .\njson array,object, `string`, number aur values ko supports karata hai\n",
	"json_xml_key4": "## JSON Example\n\n",
	"json_xml_key5": "aapako is example se maloom hoga ki apane topic aur edition ke aadhaar par books se sambandhit jaanakaaree store karane ke lie json ka upayog kaise karate hai.\n",
	"json_xml_key6": "uparokt example dekhane ke baad aap neeche ek aur example dekh sakate hai jisko json.htm ke roop mein `save` kiya gaya hai .\n",
	"json_xml_key7": "# XML\n\n\n",
	"json_xml_key8": "xml ka upayog vyaapak roop se data-interchange pattarn ke roop mein bhi kiya jaata hai. isalie ham un donon ke beech compare karane kee koshish karenge .\n",
	"json_xml_key9": "hamaara compare karane ka purpose yah nahin hai ki kaun nishchit roop se us line mein nahin hai balki ham yah samajhane kee koshish karenge ki kaun sa specefic data store karane ke lie upyukt hai .\n",
	"json_xml_key10": "xml json ke compare mein bahut adhik complex hai .\n",
	"json_xml_key11": "xml ke lie schhaim(metadata) ko discribe karane ke lie kai characteristics hain.\n",
	"json_xml_key12": "xml mein xml data se query karane ke lie Xquery specify hai.lekin json maano JAQL, JSONiq aadi shaamil hote hai lekin ye general roop se upayog nahin hote hai.\n",
	"json_xml_key13": "xml mein XSLT ko specification kiya gaya hai.jo kisee bhee xml document mein ek style ko laagoo karane ke lie upayog kiya ja sakata hai. haalaanki json mein kuchh nahin hai.\n\n\n",
	"json_xml_key14": "# Do log ko mil kar sabse pehle yeh videos dekhni hai\n\n\n\n",
	"json_xml_key15": "## JSON Example\n\n",
	"json_xml_key16": "## XML Example\n\n",
	"json_xml_key17": "# Ab aapko 30 mins ke liye aapas mei english mei inn topics ke baarein mei baat karni hai.\n\n",
	"json_xml_key18": "Baat karte karte, aap observe karein, ki aap kitne tech words use kar paa rahe hai.\nAur agar aapka partner koi aisa tech word bolta hai, jo aapko nahi pata, ya aap generally use nahi kartein. Inn words ko bhi samajhne ki phir koshish karein.\n",
	"json_xml_key19": "# Iss discussion ko karte hue, aap inn points ke baarein mei bhi soch sakte hai:\n\n",
	"json_xml_key20": "What is Json?\n",
	"json_xml_key21": "What is XML?\n",
	"json_xml_key22": "Json aur XML mai antar kya hain?\n",
	"json_xml_key23": "Xml Html se kaise alag hain?\n",
	"json_xml_key24": "XML ke benifits kya hain?\n"
}