{
	"bonus-task2_key1": "# Bonus Task 2\n\n\n",
	"bonus-task2_key2": "Socho ki har movie ko rating kaise mili hai? Basically IMDB ke bahot saare users ne apne apne hisaab se uss movie ko 1 to 10 ke beech mein ek score dia hai. Inn saare scores ki average nikaal ke uss movie ki rating banti hai.\n",
	"bonus-task2_key3": "Jaise maan lo 10 users ne ek movie ko following rating di hai:\n",
	"bonus-task2_key4": "**User 1 -** 5\n",
	"bonus-task2_key5": "**User 2 -** 6\n",
	"bonus-task2_key6": "**User 3 -** 8\n",
	"bonus-task2_key7": "**User 4 -** 8\n",
	"bonus-task2_key8": "**User 5 -** 10\n",
	"bonus-task2_key9": "**User 6 -** 6\n",
	"bonus-task2_key10": "**User 7 -** 7\n",
	"bonus-task2_key11": "**User 8 -** 4\n",
	"bonus-task2_key12": "**User 9 -** 10\n",
	"bonus-task2_key13": "**User 10 -** 3\n\n\n",
	"bonus-task2_key14": "Kyunki **5+6+8+8+10+6+7+4+10+3** 67 hota hai aur **67/10** 6.7 hota hai toh uss movie ki total rating 6.7 hogi.\n",
	"bonus-task2_key15": "Bas farak yeh hai ki IMDB pe hazaron logon ne uss movie ko rating di hai aur unn saari rating ka average nikaal kar yeh score banta hai.\n",
	"bonus-task2_key16": "Anand movie ke page ke top par aapko yeh dikhega. Yahan agar aap 21,889 pe click karoge toh woh aapko ek page pe le jayega jahan saari ratings ka in-depth analysis kiya hua hai.\n",
	"bonus-task2_key17": "Iss analysis page dekho toh yeh batata hai ki kitne logon ne kitni kitni rating di hai. Total number of users bhi batata hai. Jab tak aap yeh course kar rahe ho shayad total number of users badh gaya ho.\n",
	"bonus-task2_key18": "Saath saath agar aap Rating by Demographic wala section dekhoge toh aapko Yeh **Age** aur **Gender** ke hisaab se rating ka data dikhata hai. Is data pe aap kuch interesting analysis run kar sakte ho:\n",
	"bonus-task2_key19": "Kaunsi movies males ko zyada pasand aati hai aur kaunse females ko? Isse aap social values of dono genders ke baare mein kuch bol sakte ho?\n",
	"bonus-task2_key20": "Males ko pasand aane wale kaunse top genres hain aur kaunse females ko pasand aane wale top genres hain?\n",
	"bonus-task2_key21": "Males ko pasand aane wale kaunse top decades? Matlab males pasand aane waali sabse zyada movies kaunse decade se hain?\n",
	"bonus-task2_key22": "Kya movie ke release year aur jin logon ne rating di hai uske beech mein koi co-relation hai?\n\n\n",
	"bonus-task2_key23": "Yahan main aapko nahi bataunga ki yeh analysis ka `code` kaise likhna hai. Better hoga ki aap apne peers ke saath dimaag laga ke yeh `code` likho. Agar nhi likha jata toh koi issue nahi hai, aap agle kuch course ko padhne ke liye aage badh sakte ho :)\n",
	"bonus-task2_key24": "Agar likha jata hai, toh aapne data analysis 101 ho chuka hai :D\n"
}