{
	"blockchain_key1": "# Blockchain\n\n",
	"blockchain_key2": "Blockchain is an universal digital ledger in which transactions made in bitcoin\nor another cryptocurrency are recorded serially and publicly.\n",
	"blockchain_key3": "## Ledger\n\n",
	"blockchain_key4": "Ledger is a book of records which maintain financial transactions.\n",
	"blockchain_key5": "## Bitcoins\n\n",
	"blockchain_key6": "Bitcoin is a digital and global money system currency. It allows people to send or\nreceive money across the internet, even to someone they don't know or don't trust. \nMoney can be exchanged without being linked to a real identity.\n",
	"blockchain_key7": "## Cryptocurrency\n\n",
	"blockchain_key8": "Cryptocurrency is a form of digital currency based on mathematics, where encryption\ntechniques are used to regulate the generation of units of currency and verify the\ntransfer of funds. Farthermore, cryptocurrencies operate independently of a central bank.\n",
	"blockchain_key9": "## Important points: \n\n",
	"blockchain_key10": "A Blockchain is a type of double entry book keeping containing information about transactions.\n",
	"blockchain_key11": "Each transaction generates a hash.\n",
	"blockchain_key12": "A hash is a `string` of numbers and letters.\n",
	"blockchain_key13": "Transactions are entered in the order in which they occurred. Order is very important.\n",
	"blockchain_key14": "The hash depends not only on the transaction but the previous transaction's hash.\nEven a small change in a transaction creates a completely new hash.\n",
	"blockchain_key15": "The nodes check to make sure a transaction has not been changed by inspecting the hash.\n\n If a transaction is approved by a majority of the nodes than it is written into a block.\n\n",
	"blockchain_key16": "Each block refers to the previous block and together make the Blockchain.\n",
	"blockchain_key17": "A Blockchain is effective as it is spread over many computers, each of which have a copy of the Blockchain.\n",
	"blockchain_key18": " These computers are called nodes.\n",
	"blockchain_key19": "The Blockchain updates itself every 10 minutes.\n\n\n\n",
	"blockchain_key20": "## Read about this topic from here.\n\n",
	"blockchain_key22": "In simple English : ",
	"blockchain_key23": "Link",
	"blockchain_key25": "In medium English : ",
	"blockchain_key26": "Link",
	"blockchain_key28": "In advanced English : ",
	"blockchain_key29": "Link"
}