[
	{
		"component": "header",
		"variant": 1,
		"value": "Project: Super Stopwatch"
	},
	{
		"component": "text",
		"value": "Say you want to track how much time you spend on boring tasks you haven’t automated yet. You don’t have a physical stopwatch, and it’s surprisingly difficult to find a free stopwatch app for your laptop or smartphone that isn’t covered in ads and doesn’t send a copy of your browser history to marketers. (It says it can do this in the license agreement you agreed to. You did read the license agreement, didn’t you?) You can write a simple stopwatch program yourself in <span style=\"\">Python</span>."
	},
	{
		"component": "text",
		"value": "At a high level, here’s what your program will do:"
	},
	{
		"component": "text",
		"value": "Track the amount of time elapsed between presses of the ENTER <span style=\"\">key</span>, with each <span style=\"\">key</span> press starting a new “lap” on the timer."
	},
	{
		"component": "text",
		"value": "Print the lap number, total time, and lap time."
	},
	{
		"component": "text",
		"value": "This means your <span style=\"\">code</span> will need to do the following:"
	},
	{
		"component": "text",
		"value": "Find the current time by calling time.time() and store it as a timestamp at the start of the program, as well as at the start of each lap."
	},
	{
		"component": "text",
		"value": "Keep a lap counter and increment it every time the user presses ENTER."
	},
	{
		"component": "text",
		"value": "Calculate the elapsed time by subtracting timestamps."
	},
	{
		"component": "text",
		"value": "Handle the <span style=\"\">Key</span>boardInterrupt exception so the user can press CTRL-C to quit."
	},
	{
		"component": "text",
		"value": "Open a new <span style=\"\">file</span> <span style=\"\">editor</span> window and <span style=\"\">save</span> it as stopwatch.py."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Step 1: Set Up the Program to Track Times"
	},
	{
		"component": "text",
		"value": "The stopwatch program will need to use the current time, so you’ll want to import the time module. Your program should also print some brief instructions to the user before calling <span style=\"\">input</span>(), so the timer can begin after the user presses ENTER. Then the <span style=\"\">code</span> will start tracking lap times."
	},
	{
		"component": "text",
		"value": "Enter the following <span style=\"\">code</span> into the <span style=\"\">file</span> <span style=\"\">editor</span>, writing a TODO comment as a placeholder for the rest of the <span style=\"\">code</span>:"
	},
	{
		"component": "header",
		"variant": 1,
		"value": "!<span style=\"\">python3</span>"
	},
	{
		"component": "header",
		"variant": 1,
		"value": "stopwatch.py - A simple stopwatch program."
	},
	{
		"component": "text",
		"value": "import time"
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Display the program's instructions."
	},
	{
		"component": "text",
		"value": "print('Press ENTER to begin. Afterwards, press ENTER to \"click\" the stopwatch.<br>Press Ctrl-C to quit.')<br><span style=\"\">input</span>()                    # press Enter to begin<br>print('Started.')<br>startTime = time.time()    # get the first lap's start time<br>lastTime = startTime<br>lapNum = 1"
	},
	{
		"component": "header",
		"variant": 1,
		"value": "TODO: Start tracking the lap times."
	},
	{
		"component": "text",
		"value": "Now that we’ve written the <span style=\"\">code</span> to display the instructions, start the first lap, note the time, and set our lap count to 1."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Step 2: Track and Print Lap Times"
	},
	{
		"component": "text",
		"value": "Now let’s write the <span style=\"\">code</span> to start each new lap, calculate how long the previous lap took, and calculate the total time elapsed since starting the stopwatch. We’ll display the lap time and total time and increase the lap count for each new lap. Add the following <span style=\"\">code</span> to your program:"
	},
	{
		"component": "text",
		"value": "#! <span style=\"\">python3</span>"
	},
	{
		"component": "header",
		"variant": 1,
		"value": "stopwatch.py - A simple stopwatch program."
	},
	{
		"component": "text",
		"value": "import time"
	},
	{
		"component": "text",
		"value": "--snip--"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": "# Start tracking the lap times.<br>❶ try:<br>❷    while True:<br>           input()<br>❸         lapTime = round(time.time() - lastTime, 2)<br>❹         totalTime = round(time.time() - startTime, 2)<br>❺         print('Lap #%s: %s (%s)' % (lapNum, totalTime, lapTime), end='')<br>           lapNum += 1<br>           lastTime = time.time() # reset the last lap time<br>❻ except KeyboardInterrupt:"
	},
	{
		"component": "text",
		"value": "# Handle the Ctrl-C exception to keep its error message from displaying.<br>   print('\\nDone.')"
	},
	{
		"component": "text",
		"value": "If the user presses CTRL-C to stop the stopwatch, the <span style=\"\">Key</span>boardInterrupt exception will be raised, and the program will crash if its execution is not a try <span style=\"\">statement</span>. To prevent crashing, we wrap this part of the program in a try <span style=\"\">statement</span> ❶. We’ll handle the exception in the except clause ❻, so when CTRL-C is pressed and the exception is raised, the program execution moves to the except clause to print Done, instead of the <span style=\"\">Key</span>boardInterrupt <span style=\"\">error</span> message. Until this happens, the execution is inside an infinite <span style=\"\">loop</span> ❷ that calls <span style=\"\">input</span>() and waits until the user presses ENTER to end a lap. When a lap ends, we calculate how long the lap took by subtracting the start time of the lap, lastTime, from the current time, time.time() ❸. We calculate the total time elapsed by subtracting the overall start time of the stopwatch, startTime, from the current time ❹."
	},
	{
		"component": "text",
		"value": "Since the results of these time calculations will have many digits after the decimal point (such as 4.766272783279419), we use the round() function to round the <span style=\"\">float</span> value to two digits at ❸ and ❹."
	},
	{
		"component": "text",
		"value": "At ❺, we print the lap number, total time elapsed, and the lap time. Since the user pressing ENTER for the <span style=\"\">input</span>() call will print a newline to the screen, pass end='' to the print() function to avoid double-spacing the <span style=\"\">output</span>. After printing the lap information, we get ready for the next lap by adding 1 to the count lapNum and setting lastTime to the current time, which is the start time of the next lap."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Ideas for Similar Programs"
	},
	{
		"component": "text",
		"value": "Time tracking opens up several possibilities for your programs. Although you can download apps to do some of these things, the benefit of writing programs yourself is that they will be free and not bloated with ads and useless features. You could write similar programs to do the following:"
	},
	{
		"component": "text",
		"value": "Create a simple timesheet app that records when you type a person’s name and uses the current time to clock them in or out."
	},
	{
		"component": "text",
		"value": "Add a feature to your program to display the elapsed time since a process started, such as a download that uses the requests module. (See Chapter 11.)"
	},
	{
		"component": "text",
		"value": "Intermittently check how long a program has been running and offer the user a chance to cancel tasks that are taking too long."
	}
]