[
	{
		"component": "header",
		"variant": 1,
		"value": "Breakpoints"
	},
	{
		"component": "text",
		"value": "A breakpoint can be set on a specific line of <span style=\"\">code</span> and forces the debugger to pause whenever the program execution reaches that line. Open a new <span style=\"\">file</span> <span style=\"\">editor</span> window and enter the following program, which simulates flipping a coin 1,000 times. <span style=\"\">Save</span> it as coinFlip.py."
	},
	{
		"component": "text",
		"value": "import random<br>   heads = 0<br>   for i in range(1, 1001):<br>❶     if random.randint(0, 1) == 1:<br>           heads = heads + 1<br>       if i == 500:<br>❷         print('Halfway done!')<br>   print('Heads came up ' + str(heads) + ' times.')<br>The random.randint(0, 1) call ❶ will return 0 half of the time and 1 the other half of the time. This can be used to simulate a 50/50 coin flip where 1 represents heads. When you run this program without the debugger, it quickly <span style=\"\">outputs</span> something like the following:"
	},
	{
		"component": "text",
		"value": "Halfway done!<br>Heads came up 490 times.<br>If you ran this program under the debugger, you would have to click the Over button thousands of times before the program terminated. If you were interested in the value of heads at the halfway point of the program’s execution, when 500 of 1000 coin flips have been completed, you could instead just set a breakpoint on the line print('Halfway done!') ❷. To set a breakpoint, right-click the line in the <span style=\"\">file</span> <span style=\"\">editor</span> and select Set Breakpoint, as shown in Figure 10-5."
	},
	{
		"component": "text",
		"value": "Setting a breakpoint"
	},
	{
		"component": "text",
		"value": "You don’t want to set a breakpoint on the if <span style=\"\">statement</span> line, since the if <span style=\"\">statement</span> is <span style=\"\">execute</span>d on every single iteration through the <span style=\"\">loop</span>. By setting the breakpoint on the <span style=\"\">code</span> in the if <span style=\"\">statement</span>, the debugger breaks only when the execution enters the if clause."
	},
	{
		"component": "text",
		"value": "The line with the breakpoint will be highlighted in yellow in the <span style=\"\">file</span> <span style=\"\">editor</span>. When you run the program under the debugger, it will start in a paused state at the first line, as usual. But if you click Go, the program will run at full speed until it reaches the line with the breakpoint set on it. You can then click Go, Over, Step, or Out to continue as normal."
	},
	{
		"component": "text",
		"value": "If you want to remove a breakpoint, right-click the line in the <span style=\"\">file</span> <span style=\"\">editor</span> and select Clear Breakpoint from the menu. The yellow highlighting will go away, and the debugger will not break on that line in the future."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Summary"
	},
	{
		"component": "text",
		"value": "Assertions, exceptions, logging, and the debugger are all valuable tools to find and prevent bugs in your program. Assertions with the <span style=\"\">Python</span> assert <span style=\"\">statement</span> are a good way to implement “sanity checks” that give you an early warning when a necessary condition doesn’t hold <span style=\"\">true</span>. Assertions are only for <span style=\"\">errors</span> that the program shouldn’t try to recover from and should fail fast. Otherwise, you should raise an exception."
	},
	{
		"component": "text",
		"value": "An exception can be caught and handled by the try and except <span style=\"\">statements</span>. The logging module is a good way to look into your <span style=\"\">code</span> while it’s running and is much more convenient to use than the print() function because of its different logging levels and ability to log to a text <span style=\"\">file</span>."
	},
	{
		"component": "text",
		"value": "The debugger lets you step through your program one line at a time. Alternatively, you can run your program at normal speed and have the debugger pause execution whenever it reaches a line with a breakpoint set. Using the debugger, you can see the state of any <span style=\"\">variable</span>’s value at any point during the program’s lifetime."
	},
	{
		"component": "text",
		"value": "These debugging tools and techniques will help you write programs that work. Accidentally introducing bugs into your <span style=\"\">code</span> is a fact of life, no matter how many years of coding experience you have."
	}
]