[
	{
		"component": "text",
		"value": "Watch this video to understand how to use what we need to install."
	},
	{
		"component": "youtube",
		"value": "cvvwkgp4HBg"
	},
	{
		"component": "text",
		"value": "For running the javascript we don’t need the npm also, it will run on your web browser,"
	},
	{
		"component": "text",
		"value": "Open your browser and click ctrl+shift+i or else right click on the page and select inspect and you will get a pop up on the left side. There you can see the console, there we will get the space to write the script of JS."
	},
	{
		"component": "text",
		"value": "Get knowledge of DOM structure."
	},
	{
		"component": "youtube",
		"value": "_GxpmQ54aqg"
	},
	{
		"component": "image",
		"value": "images/check_console.png",
		"alt": "console"
	},
	{
		"component": "header",
		"variant": 3,
		"value": "Some basic information:"
	},
	{
		"component": "text",
		"value": "Every page which is coming on a web browser can be considered an object. When a web page is loaded, the browser creates a Document Object Model of the page."
	},
	{
		"component": "text",
		"value": "document is an owner of all other objects in the webpage. A Document object represents the HTML document that is displayed in that window. The Document object has various properties that refer to other objects which allow access to and modification of document content."
	},
	{
		"component": "image",
		"value": "images/how_to_use_console.png",
		"alt": "how to use console"
	},
	{
		"component": "text",
		"value": "In the console if we are writing a document word, it will give you the whole html content of the opened website you can see in the above picture."
	},
	{
		"component": "text",
		"value": "So if you understand the document, the document is the owner of the page. So if you want to find links from that document you can easily do so by writing…"
	},
	{
		"component": "text",
		"value": "document.links"
	},
	{
		"component": "image",
		"value": "images/how_to_fetch_links.png",
		"alt": "how to fetch links"
	},
	{
		"component": "text",
		"value": "Document.links will give the list of links that are there in the whole website."
	},
	{
		"component": "text",
		"value": "Document.links[0] will give you the first link that is there in the list."
	},
	{
		"component": "image",
		"value": "images/first_link_of_the_list.png",
		"alt": "first link of the list"
	}
]