[
	{
		"component": "text",
		"value": "By giving <b>instructions</b> to the computer,we can make the computers solve complex problems."
	},
	{
		"component": "text",
		"value": "A set of <b>instructions</b> given to the computer is called a <b>program</b>.<br>The Process of giving instructions to the computer is called <b>programming</b>."
	},
	{
		"component": "text",
		"value": "Doesn't it sound simple that we give instructions(program) to the computer and the computer follows these instructions to solve a complex problem? Giving instructions to the computer is called programming. :)"
	},
	{
		"component": "text",
		"value": "But there is a small problem."
	},
	{
		"component": "text",
		"value": "Computers cannot understand our language like (Hindi, Tamil,  Kannada). Computers can only understand the machine language which is made of 0 and 1. So, it becomes difficult for us to communicate with the computer in machine language."
	},
	{
		"component": "text",
		"value": "Then how can we give instructions to the computer?"
	},
	{
		"component": "text",
		"value": "Therefore, to solve this problem we made some languages like(Java, <span style=\"\">Python</span>, JavaScript) so that we can easily give instructions to the computer. Computers can easily convert these languages into machine language with the help of “another program called a <span style=\"\">compiler</span>.”"
	},
	{
		"component": "text",
		"value": "To give instructions to the computer we need to learn any of these given languages. In this course, we are going to learn the <span style=\"\">python</span> language."
	},
	{
		"component": "text",
		"value": "We will use <span style=\"\">python</span> language to give instructions to the computer."
	},
	{
		"component": "text",
		"value": "<b>Assignment</b>"
	},
	{
		"component": "text",
		"value": "Have you ever given instructions to anybody or taken instructions from anybody. Can we call that a <b>program</b>?",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Search for Python language and its applications? How many people in the world use Java?",
		"decoration": {
			"type": "bullet"
		}
	}
]