[
	{
		"component": "header",
		"variant": 2,
		"value": "What Do Computers Do?"
	},
	{
		"component": "text",
		"value": "In our human history, there have been some great inventions that have brought progress in the lives of humans and have also provided direction to it. Ex:<b>WHEEL</b>"
	},
	{
		"component": "text",
		"value": "Humans were not able to lift or carry heavy loads to longer distances. This was due to human physical limitations.<br>By the invention of WHEEL, humans were able to carry very heavy loads as well as to travel long distances also.<br>The world became smaller to us. Hence, the invention of WHEEL solved lots of problems. Now, we can even meet our relatives staying far off and transportation of goods also became easier."
	},
	{
		"component": "text",
		"value": "Another great invention that brought a drastic change in human history-<b>COMPUTER</b>."
	},
	{
		"component": "text",
		"value": "Just as WHEELS removed our physical limitations, similarly COMPUTERS helped in expanding our brain capacity or mental limitations."
	},
	{
		"component": "text",
		"value": "The human brain can solve many complex tasks/problems. But if our brain continuously solves these complex problems, our brain will start getting tired or bored. Our brain will start making mistakes and it becomes difficult for us to solve the problem."
	},
	{
		"component": "text",
		"value": "Just as wheels removed our physical limitations, the invention of computers, helped in removing our mental limitations. By giving instructions to the Computer, we can make them perform complex tasks, continuously without making any mistakes and without getting tired."
	},
	{
		"component": "text",
		"value": "Computers don’t have their brain so they can’t think, we have to give instructions to them to make them solve any complex problem."
	},
	{
		"component": "text",
		"value": "Let's see the following video where May Li(Designer and Inventor) and Nat(Designer at Xbox) explains what computers are, how they works and how we are surrounded by computers now. Hope you'd enjoy it."
	},
	{
		"component": "youtube",
		"value": "mCq8-xTH7jA"
	},
	{
		"component": "text",
		"value": "<b>Read and search the following questions.</b><br>--   What did you learn about computers?<br>--   What are the <span style=\"\">applications</span> of computers? What kinds of problems do these <span style=\"\">applications</span> solve? Think about what kind of instructions were given to computers for these <span style=\"\">applications</span>?"
	}
]