{
	"practice-questions_key1": "Practice Questions",
	"practice-questions_key2": "Q:",
	"practice-questions_key3": "Briefly describe the differences between the webbrowser, requests, BeautifulSoup, and selenium modules.",
	"practice-questions_key4": "Q:",
	"practice-questions_key5": "What type of object is returned by requests.get()? How can you access the downloaded content as a string value?",
	"practice-questions_key6": "Q:",
	"practice-questions_key7": "What Requests method checks that the download worked?",
	"practice-questions_key8": "Q:",
	"practice-questions_key9": "How can you get the HTTP status code of a Requests response?",
	"practice-questions_key10": "Q:",
	"practice-questions_key11": "How do you save a Requests response to a file?",
	"practice-questions_key12": "Q:",
	"practice-questions_key13": "What is the keyboard shortcut for opening a browser’s developer tools?",
	"practice-questions_key14": "Q:",
	"practice-questions_key15": "How can you view (in the developer tools) the HTML of a specific element on a web page?",
	"practice-questions_key16": "Q:",
	"practice-questions_key17": "What is the CSS selector string that would find the element with an id attribute of main?",
	"practice-questions_key18": "Q:",
	"practice-questions_key19": "What is the CSS selector string that would find the elements with a CSS class of highlight?",
	"practice-questions_key20": "Q:",
	"practice-questions_key21": "What is the CSS selector string that would find all the <div> elements inside another <div> element?",
	"practice-questions_key22": "Q:",
	"practice-questions_key23": "What is the CSS selector string that would find the <button> element with a value attribute set to favorite?",
	"practice-questions_key24": "Q:",
	"practice-questions_key25": "Say you have a Beautiful Soup Tag object stored in the variable spam for the element <div>Hello world!</div>. How could you get a string 'Hello world!' from the Tag object?",
	"practice-questions_key26": "Q:",
	"practice-questions_key27": "How would you store all the attributes of a Beautiful Soup Tag object in a variable named linkElem?",
	"practice-questions_key28": "Q:",
	"practice-questions_key29": "Running import selenium doesn’t work. How do you properly import the selenium module?",
	"practice-questions_key30": "Q:",
	"practice-questions_key31": "What’s the difference between the find<i>element</i>* and find<i>elements</i>* methods?",
	"practice-questions_key32": "Q:",
	"practice-questions_key33": "What methods do Selenium’s WebElement objects have for simulating mouse clicks and keyboard keys?",
	"practice-questions_key34": "Q:",
	"practice-questions_key35": "You could call send_keys(Keys.ENTER) on the Submit button’s WebElement object, but what is an easier way to submit a form with Selenium?",
	"practice-questions_key36": "Q:",
	"practice-questions_key37": "How can you simulate clicking a browser’s Forward, Back, and Refresh buttons with Selenium?"
}