[
	{
		"component": "text",
		"value": "Hello!! <br>This is your Class 2 for Spoken English course module."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "TOPIC : FOOD"
	},
	{
		"component": "table",
		"value": [
			{
				"header": "Discussion Points",
				"items": [
					"What is your favourite food and why?",
					"What is your least favourite food and why?",
					"Have you ever cooked any meal before?"
				]
			},
			{
				"header": "Assignment for next Class",
				"items": [
					"",
					"",
					""
				]
			}
		]
	},
	{
		"component": "header",
		"variant": 3,
		"value": "Pair Share:"
	},
	{
		"component": "text",
		"value": "What is your favorite food, and why? Share any memories you have of eating this food.<br>Bonus - If you had to describe this food to an alien who just landed on Earth, how would<br>you describe it? (Tip - use your senses - touch, taste, smell, sight, sound - to describe)"
	},
	{
		"component": "header",
		"variant": 3,
		"value": "Game Time:"
	},
	{
		"component": "text",
		"value": "Name 3 [category] you like and talk about them a little"
	},
	{
		"component": "text",
		"value": "Categories may include vegetables, fruits, animals, emotions/feelings, colors,<br>sports/games, places to visit, weekend activities, school subjects, careers/jobs,<br>etc.",
		"decoration": {
			"type": "number",
			"value": 1
		}
	},
	{
		"component": "text",
		"value": "Inform students that it is okay if they don’t know the word in english, and help them translate/pronounce as needed. (",
		"decoration": {
			"type": "number",
			"value": 2
		}
	},
	{
		"component": "text",
		"value": "This game will help students increase their vocabulary with regards to aspects of their personal identity - so that English feels less foreign and more connected to them.<br><br>",
		"decoration": {
			"type": "number",
			"value": 3
		}
	},
	{
		"component": "header",
		"variant": 3,
		"value": "Word of the Week:"
	},
	{
		"component": "text",
		"value": "Persistence<br>(noun)<br>Definition - Continuing firmly in a course of action in spite of difficulty<br>Usage - Learning a new language takes hard work and persistence."
	},
	{
		"component": "header",
		"variant": 3,
		"value": "Homework:"
	},
	{
		"component": "text",
		"value": "Use the word persistence when talking to teachers/friends/others this week and make a note of how many times you used it."
	}
]