[
	{
		"component": "header",
		"variant": 2,
		"value": "Celebrity Interviews"
	},
	{
		"component": "blockquote",
		"value": "Function: Asking for and giving information about people<br>Time Limit: 90 minutes<br>Group Size: 5 - 8<br>Skill: Speaking<br>Language: Wh questions"
	},
	{
		"component": "header",
		"variant": 3,
		"value": "Preparation"
	},
	{
		"component": "text",
		"value": "Before the activity starts, all the participants will choose which celebrity they want to become in the activity and share with the entire group. No two people will become the same celebrity. Celebrities can be sportspersons, politicians, actors, actresses or any other famous people. "
	},
	{
		"component": "text",
		"value": "After the list of celebrities is ready, all of you will prepare the questions that you want to ask the respective celebrities as news reporters. You will do this individually and there will be no discussion. "
	},
	{
		"component": "text",
		"value": "You will also decide the order of the interviews and plan out the transition from moderator to news reporter to celebrity. "
	},
	{
		"component": "text",
		"value": "Tip: One way you can do this is that after the interview celebrity becomes the moderator and moderator becomes a news reporter."
	},
	{
		"component": "text",
		"value": "<b>Preparation Time: 30 minutes</b>"
	},
	{
		"component": "header",
		"variant": 4,
		"value": "Process:"
	},
	{
		"component": "text",
		"value": "Students will take turns to become celebrities, news reporters and and moderators. <br>The news reporters will be asking questions to the celebrities and the celebrities will be answering them.<br>Every celebrity will get a maximum of 10 minutes to be interviewed. <br>In these 10 minutes, all news reporters have to ask them questions and celebrity has to answer.  "
	},
	{
		"component": "text",
		"value": "Role of moderator:"
	},
	{
		"component": "text",
		"value": "The moderator will make sure that everyone is getting turns to ask questions and ensure that the interview ends in time. The moderator will change after every interview. "
	},
	{
		"component": "text",
		"value": "Time: 90 minutes"
	},
	{
		"component": "text",
		"value": "<b>Examples of questions:</b>"
	},
	{
		"component": "text",
		"value": "Where do you live?",
		"decoration": {
			"type": "number",
			"value": null
		}
	},
	{
		"component": "text",
		"value": "What is your favourite hobby?",
		"decoration": {
			"type": "number",
			"value": null
		}
	},
	{
		"component": "text",
		"value": "What do you like to do in your free time?",
		"decoration": {
			"type": "number",
			"value": null
		}
	},
	{
		"component": "text",
		"value": "Who is your role model?",
		"decoration": {
			"type": "number",
			"value": null
		}
	},
	{
		"component": "text",
		"value": "Why did you choose this profession?",
		"decoration": {
			"type": "number",
			"value": null
		}
	}
]