{
	"Function-parameters_key1": "Parameters will work as <span style=\"\">variables</span> in a function which will store arguments as values. ",
	"Function-parameters_key2": "Parameters are set on the first line of the function inside the set of parentheses, like this:",
	"Function-parameters_key3": "You can specify parameters when you define your function to accept <span style=\"\">input</span> values when your <span style=\"\">code</span> is running. The parameters work like placeholder <span style=\"\">variables</span> within a function. They're going to replaced at run time by the values (known as argument) provided to the function at the time of function calling. See  in the above example we are given 3 arguments when we are calling the function and accessing by the parameters like parameter1, parameter2, parameter3.",
	"Function-parameters_key4": "Example:",
	"Function-parameters_key5": "Example:",
	"Function-parameters_key6": "Explanation:",
	"Function-parameters_key7": "In function parameters we given two named as firstName, lastName but when we calling a function we need to pass arguments there we passed only one that is Shwetha and if we are not passing an argument the parameter which is responsible for getting the value, it won't get anything and it has undefined in it, so it prints  <b>Shwetha undefined</b> as <span style=\"\">output</span>.",
	"Function-parameters_key8": "Note:",
	"Function-parameters_key9": "You can declare as many parameters as you want. However for each parameter you write, a corresponding argument needs to be passed to the function when it is called, if not passed its value becomes undefined. ",
	"Function-parameters_key10": "Exercises:",
	"Function-parameters_key11": "Write a function name it as displayMultiply() and pass 3 parameters and in runtime take the arguments with the names num1, num2, num3 and multiply them and return the result?<br><br>",
	"Function-parameters_key12": "What is the output of the following code?<br><br>",
	"Function-parameters_key13": "What is the error in this code?",
	"Function-parameters_key14": "Write a program that will take two parameters and print its sum?<br><br><br>",
	"Function-parameters_key15": "What is the output of the following code?<br><br>",
	"Function-parameters_key16": "What is the error in the following code?<br><br>"
}