{
	"spoken-english-week14_key1": "Hello!! \nThis is your Class 14 for Spoken English course module.\n",
	"spoken-english-week14_key2": "Level 1\n",
	"spoken-english-week14_key3": "Pair and Share:\n",
	"spoken-english-week14_key4": "Conversation Topics:\n",
	"spoken-english-week14_key5": "Which teacher has inspired you, and how?\n",
	"spoken-english-week14_key6": "What will you remember most from this year?\n",
	"spoken-english-week14_key7": "What is usually the most difficult part of your day? What is your favorite part?\n",
	"spoken-english-week14_key8": "What qualities do you appreciate most in your parent/sibling/ friend?\n\n\n",
	"spoken-english-week14_key9": "Game time\n",
	"spoken-english-week14_key10": "Story Comprehension\n",
	"spoken-english-week14_key11": "The Elephant and the Hare\nOnce there was a group of elephants. They were going to visit their family, and they wanted to bring them honey. So they went and collected honey, and started walking.\n",
	"spoken-english-week14_key12": "On the road, they came across a hare. The hare wanted to go across a river, but the water was too deep. ‘Oh, Mr. Elephant,’ said the hare. ‘You look very big. Can you carry me across the water?’ The elephant said, ‘Yes, of course. You can jump on my  back.’ So the hare sat on the elephant’s back and they went across the river. The hare sniffed and smelled the honey. It smelled so good! \nThe elephant was carrying two bags of honey. Slowly, the hare went down and ate one of the bags. When she finished, she said, ‘Mr. Elephant, I am quite bored up here. Can you give me a stone to play with?’ So the elephant gave her a stone. She put the stone in the now empty bag of honey. Then she ate from the second bag of honey. When she finished, she said, ‘Mr. Elephant, I dropped my stone. Could you give me another stone? I want to throw it at the birds.’ So the elephant gave her another stone. Then she asked for another, and another. Finally, she filled up both bags with stones.\n",
	"spoken-english-week14_key13": "‘Well, Mr. Elephant,’ said the hare, ‘I will be going now. Goodbye!’ And the hare jumped off the elephant’s back and ran away. When the elephants arrived, they saw that the bags were full of stones.‘Oh no!’ cried the elephant. ‘That hare stole my honey! I must catch her!’ So the elephant ran after the hare. The hare saw too late that the elephant was coming, and he took her tail and pulled on it hard. He ripped off the skin of the hare’s tail, but the hare ran away. ‘Not so fast!’ cried the elephant. ‘I will get you!’ As the hare ran, she saw some farmers. She said, ‘Hey, you farmers! Do you see that elephant over there? You should run away, because he is running after you.’ So the farmers ran away. When the elephant saw them running, he thought that they were running after the hare.\n",
	"spoken-english-week14_key14": "Finally, he caught up to them. ‘Hey, you farmers. Have you seen a hare with a skinned tail around here?’ The farmers said,‘She went that way.’ So the elephant ran after the hare. Next, the hare saw some women cooking outside. ‘Hey you, women who are cooking! Do you see that elephant over there? You should run away, because he is running after you.’ So the women ran inside their houses. The elephant caught up to them and said, ‘Hey you, lovely women. Have you seen a hare with a skinned tail around here?’ The women answered, ‘She ran over there.’\n",
	"spoken-english-week14_key15": "The hare ran until she saw some antelopes who were eating grass. She said, ‘Hey, you antelopes. Do you see that elephant over there? You should run away, because he is running after you.’ The antelopes ran far away, but the elephant finally caught up to them. He said, ‘Hey, you antelopes. Have you seen a hare with a skinned tail around here?’ So the antelopes showed him where the hare went.\n",
	"spoken-english-week14_key16": "Finally, the hare came to a group of hares. She said, ‘Hey, other hares. Do you see that elephant over there? You should all rip the skin off your tails, because he is looking for a hare without skin on its tail.’ So all the hares quickly ripped the skin off their tails. The elephant caught up to them and said, ‘Hey, you hares. Have you seen a hare with a skinned tail around here?’ The hares said, ‘Don’t you see that all our tails are skinned?’ And they all showed their tails to the elephant. The elephant did not know what to do. He could not find the hare who stole the honey, because all the hares looked the same.\nThe hare had played a trick on him! So in the end, the elephant did not catch the hare. And from that day onwards, he never helped a hare again.\n",
	"spoken-english-week14_key17": "Questions:\n",
	"spoken-english-week14_key18": "What was your favorite part of the story?\n",
	"spoken-english-week14_key19": "How did the hare manage to escape from the elephants? \n",
	"spoken-english-week14_key20": "If you were the elephant, what strategy would you have used to find the hare?\n",
	"spoken-english-week14_key21": "Whose side are you on - the hare or the elephants - and why?\n\n\n",
	"spoken-english-week14_key22": "Word of the Week\n**Persuade**\n(verb) cause (someone) to do something through reasoning or\nargument.\n",
	"spoken-english-week14_key23": "\"it wasn't easy, but I persuaded him to do the right thing\"\n",
	"spoken-english-week14_key24": "Level 2\n",
	"spoken-english-week14_key25": "Pair and Share:\n",
	"spoken-english-week14_key26": "Conversation Topics:\n",
	"spoken-english-week14_key27": "What simple thing brings you joy?\n",
	"spoken-english-week14_key28": "What skills do you admire in others?\n",
	"spoken-english-week14_key29": "Describe the most fun teacher you had.\n",
	"spoken-english-week14_key30": "What do you find yourself thinking about often? \n\n\n",
	"spoken-english-week14_key31": "Towards the City\n",
	"spoken-english-week14_key32": "Once upon a time, in Ancient Greece, there was a man called Byzas. Byzas was the son of Nisos, the King of Megara, a city in Greece. ‘My son,’ said King Nisos one day. ‘It is time for you to go out and make your way in the world. Find your own land and build a city there.’ ‘I will make you happy, father,’ said\nByzas.\n",
	"spoken-english-week14_key33": "So Byzas went out with his men and looked for land. Butwherever they looked, there were problems. In the first place, there were thieves, men who stole from travellers. In the next place, there was bad weather: baking sun and ice-cold rain; that meant they could not plant food. In the third place, there were monsters that ate children alive. ‘I need help!’ said Byzas. ‘We have travelled for months and months, and we have found no place to build a city.’\n",
	"spoken-english-week14_key34": "So Byzas travelled to Delphi. There, there was the Oracle of Apollo. The Oracle of Apollo was a woman who spoke with the god Apollo and saw the future. She gave advice to men from all over Greece, and her advice was always good. But if you did not follow her advice well, or if you did not respect the gods, you could end up worse than before. Still, Byzas had to go, because he had no other ideas. ‘Oh, great Oracle of Apollo! I have come all the way from Megara to speak to you. My father, King Nisos, has told me to go out and build a city. But wherever I go, there are thieves, bad weather and monsters. Please tell me, where should I go to build my city?’\n",
	"spoken-english-week14_key35": "The Oracle closed her eyes and said nothing for several minutes. Byzas worried that he had said something wrong. But finally, she opened her eyes and spoke. ‘I have asked Apollo what to do. The message is clear: you will build your city on the land opposite to the Land of the Blind.’ Byzas left Delphi confused. He did not understand the Oracle’s message. ‘The Land of the Blind’? What did it mean? He asked his men, and they gave him many ideas. One said that it might mean window\nblinds, a kind of curtain. But that was too easy. Another said that it might mean a foreign land. But why would Apollo want Byzas to build his city in a foreign land?\n",
	"spoken-english-week14_key36": "For months, Byzas and his men travelled around, looking for the Land of the Blind. Everywhere they went, they asked people about it, but nobody knew where it could be. One day, they came to the Bosporus, a strait. They took their ship to Chalcedon, a city on one side of the strait, and rested there. It was a horrible place. The streets were dirty and full of thieves. That night, Byzas felt hopeless, because he had no idea where the Land of the Blind was. He could not go home to his fatherempty-handed, and he did not know what to do. The next day, feeling sad, he walked up a big hill on the side of the city. From the top of the hill, he could look out over all the houses and across the strait to the other side. Byzas gasped. ‘How can it be?’\n",
	"spoken-english-week14_key37": "On the other side of the strait, opposite Chalcedon, was a magical land. The land was green, with many beautiful flowers and trees holding beautiful fruit. Wild sheep, pigs, cows and horses walked around, fat and healthy. There were rivers and lakes with beautiful clear water. ‘How can these people live in Chalcedon, when such a magical land sits opposite them? They must be blind!’ Suddenly, Byzas remembered the words of the Oracle of Apollo: You will build your city on the land\nopposite to the Land of the Blind. Byzas started laughing. ‘I’ve found it! I’ve finally found it!’ He ran down the hill and shouted to his men, ‘Get on the ship! We’re crossing the strait.’\n",
	"spoken-english-week14_key38": "The men, confused, did what he said. When they arrived at the magical land they laughed and cheered. There, Byzas built the city of Byzantium. It was a place of riches and magic. Over the years, the city grew in size and importance. Today, it is called Istanbul, which means towards the city, because men from all around the world come there still.\n",
	"spoken-english-week14_key39": "Questions:\n",
	"spoken-english-week14_key40": "What do you like or not like about this story? \n",
	"spoken-english-week14_key41": "What questions would you want to ask the author, or what\nadditional information do you want after hearing this\nstory? \n",
	"spoken-english-week14_key42": "What is a lesson that you take from this story? \n",
	"spoken-english-week14_key43": "If you were Byzas, what strategies would you have used\nto find land? \n\n\n",
	"spoken-english-week14_key44": "Word of the Week\n",
	"spoken-english-week14_key45": "Transition: (noun) the process or a period of changing from one state or condition to another.\n",
	"spoken-english-week14_key46": "\"students in transition from one program to another\"\n",
	"spoken-english-week14_key47": "(verb) undergo or cause to undergo a process or period of transition.\n",
	"spoken-english-week14_key48": "\"the roads will be built by private industry and then transitioned into\ngovernment\"\n"
}