{
	"spoken-english-week1_key1": "Hello!! \nThis is your Class 1 for Spoken English course module.\n",
	"spoken-english-week1_key2": "TOPIC : INTRODUCTION\n",
	"spoken-english-week1_key3": "Discussion Points",
	"spoken-english-week1_key4": "Assignment for next Class",
	"spoken-english-week1_key5": "Self-introduction",
	"spoken-english-week1_key6": "What are your strengths/ positive things about you",
	"spoken-english-week1_key7": "What is your name and how do you spell that?",
	"spoken-english-week1_key8": "",
	"spoken-english-week1_key9": "Where are you from?",
	"spoken-english-week1_key10": "",
	"spoken-english-week1_key11": "When were you born? When is your birthday?",
	"spoken-english-week1_key12": "",
	"spoken-english-week1_key13": "What languages do you speak?",
	"spoken-english-week1_key14": "",
	"spoken-english-week1_key15": "What do/did you study?",
	"spoken-english-week1_key16": "",
	"spoken-english-week1_key17": "Are you working? If yes-what do you do?",
	"spoken-english-week1_key18": "",
	"spoken-english-week1_key19": "Next 30 mins\n",
	"spoken-english-week1_key20": "About 10 mins\nDescribe a day in your life in this past week !\n( Starting from when you woke up until the time you fall asleep )\nFirst the volunteer describes the day !\nThen the child describes the day !\n\n\n\n",
	"spoken-english-week1_key21": "About next 10 mins\nGAME TIME : Be it an adult or a child, playing a game is always exciting !\nWeek 1 game is called “The Imitation Game”\nThis technique will help the children to enhance their pronunciation skills :)\nRules are very simple -\nThe child repeats after you. Understand the pace and break down the sentences\nbelow accordingly. Also at any point if the child doesn’t understand the meaning of a word please define it.\n\n\n\n",
	"spoken-english-week1_key22": "Short Story -\n",
	"spoken-english-week1_key23": "Short Story -\n",
	"spoken-english-week1_key24": "Ram and Sham were in a fight. Both of them said they owned the same mango tree.They went up to Birbal and asked him to decide the matter, once and for all.  Who was the `true` owner of the mango tree? \nBirbal said, \"There is only one way to settle the matter. First, you must take all of the fruit off the tree.  Each of you should take half the mangos.  Then you must cut down the tree and divide the trunk in half.  Each of you should take half the wood, too.  Then everything will be fair.  That is what I say.”\n",
	"spoken-english-week1_key25": "Who really owned the mango tree?\n",
	"spoken-english-week1_key26": "Ram thought it was all a good idea, and he said so. \nBut Sham said, “Your Honor! I have tended that tree for seven years. If you must, give the mango tree to Ram.  But do not make us cut it down!\"\n\"What you have said to me is all I need to know,\" said Birbal.  Then he said that Sham was the `true` owner of the mango tree.\n",
	"spoken-english-week1_key27": "At the end of every session let’s teach them one word and their homework would be to try to use the word in a sentence when they talk to their friends/teachers in the school and make a note of how many times did they use it.\n\n\n",
	"spoken-english-week1_key28": "**Word of this week -**\nabandon - noun\nMeaning - complete lack of inhibition or restraint.\n"
}