{
	"spoken-english-week9_key1": "name: Spoken English: Class-9\n",
	"spoken-english-week9_key2": "Hello!! \nThis is your Class 9 for Spoken English course module.\n",
	"spoken-english-week9_key3": "# Level 1\n\n",
	"spoken-english-week9_key4": "Pair and Share: \nTopic :\n",
	"spoken-english-week9_key5": "What are the activities you do that pollutes or affects Nature/\nEarth/Environment?\n",
	"spoken-english-week9_key6": "What are the small changes we as an individual can make to\nhelp the environment?\n",
	"spoken-english-week9_key7": "What are the changes we can make as a society to improve our\nenvironment?\n\n\n",
	"spoken-english-week9_key8": "### Game time\n\n",
	"spoken-english-week9_key9": "*Homonyms* - Volunteer can explain to the student that homonyms are words that look or sound the same, but have different meanings.\nWe are going to focus on words that sound the same! Volunteer can say the word to the student, and student can respond with whatever\nmeanings or sentence examples they can think of. Volunteer can provide hints such as spelling of the words, or by using the word in a sentence to help with context. \n",
	"spoken-english-week9_key10": "Break (eg: to break a plate) - Brake (eg: I had to brake to avoid hitting the car)\n",
	"spoken-english-week9_key11": "Here (eg: I am here) - Hear (eg: I can’t hear you)\n",
	"spoken-english-week9_key12": "Be (eg: Be quiet) - Bee (eg: There is a bee in the classroom)\n",
	"spoken-english-week9_key13": "Been (eg: I have never been to the beach) - Bean (eg: I like to eat beans)\n",
	"spoken-english-week9_key14": "Bored (eg: I get bored during rainy days) - Board (eg: The teacher wrote on the board)\n",
	"spoken-english-week9_key15": "Blue (eg: My favorite color is blue) - Blew (eg: The wind blew away my papers)\n",
	"spoken-english-week9_key16": "Meet (eg: The beach is a good place to meet) - Meat (eg: I don’t eat meat)\n",
	"spoken-english-week9_key17": "Plain (eg: The pattern on this dress is plain) - Plane (eg: I saw a plane in the sky)\n",
	"spoken-english-week9_key18": "Weak (eg: The foundation of this house is weak) - Week (eg:The first day of the week is Sunday)\n",
	"spoken-english-week9_key19": "Not (eg: I do not know how to swim) - Knot (eg: I know how to tie a knot)\n\n\n",
	"spoken-english-week9_key20": "### Word of the Week\n\n",
	"spoken-english-week9_key21": "Optimistic\nadjective\nMeaning : hopeful and confident about the future.\nUsage: I am optimistic that there will soon be a vaccine for the\nvirus.\n",
	"spoken-english-week9_key22": "# Level 2\n\n",
	"spoken-english-week9_key23": "Topic :\n",
	"spoken-english-week9_key24": "What are the activities you do that pollutes or affects Nature/\nEarth/Environment?\n",
	"spoken-english-week9_key25": "What are the small changes we as an individual can make to\nhelp the environment?\n",
	"spoken-english-week9_key26": "What are the changes we can make as a society to improve our\nenvironment?\n",
	"spoken-english-week9_key27": "How can we create awareness of the problems causing\npollution within our society\n\n\n",
	"spoken-english-week9_key28": "### Game time\n\n",
	"spoken-english-week9_key29": "*Homonyms* - Volunteer can explain to the student that homonyms\nare words that look or sound the same, but have different meanings.\nVolunteer can say the word to the student, and student can respond\nwith whatever meanings or sentence examples of the word that they\ncan think of. Volunteer can provide hints such as spelling of the\nwords (if different), or by using the word in a sentence to help with\ncontext.\n",
	"spoken-english-week9_key30": "Genes (eg: We inherit genes from our parents) - Jeans (eg: My jeans are blue)\n",
	"spoken-english-week9_key31": "Piece (eg: A piece of a sweet) - Peace (eg: World peace)\n",
	"spoken-english-week9_key32": "Bat (eg 1: A bat flew into my house at night; eg 2: I lost my cricket bat)\n",
	"spoken-english-week9_key33": "Desert (eg: Rajasthan has the Thar desert) - Dessert (eg: Chocolate is my favorite dessert)\n",
	"spoken-english-week9_key34": "Left (eg1: The shop is on the left side of the bank; eg2: He left for Bangalore yesterday)\n",
	"spoken-english-week9_key35": "Wave (eg1: She forgot to wave goodbye; eg2: The beach has big waves today)\n",
	"spoken-english-week9_key36": "Ring (eg1: She got a new ring; eg2: My phone was ringing)\n",
	"spoken-english-week9_key37": "Bark (eg1: The tree bark turned yellow; eg2: The dog barks so loudly)\n",
	"spoken-english-week9_key38": "Right (eg1: 2+2 = 4, right?; eg2: I use my right hand to eat)\n",
	"spoken-english-week9_key39": "Change (eg1: I need to change my clothes; eg2: Do you have any change for 50 rupees?)\n\n\n\n",
	"spoken-english-week9_key40": "### Word of the Week\n\n",
	"spoken-english-week9_key41": "**Sincere** (adjective)\nMeaning: (1) free from pretense or deceit; proceeding from genuine feelings.\n",
	"spoken-english-week9_key42": "Usage: The student showed sincere interest in the spoken english program\n",
	"spoken-english-week9_key43": "**Sincerity** ( noun )\nMeaning : the quality of being free from pretense, deceit, or hypocrisy.\n",
	"spoken-english-week9_key44": "Usage: Her sincerity in studying helped her succeed in life\n"
}