{
	"bandwidth_key1": "name: Bandwidth\n",
	"bandwidth_key2": "# What is Bandwidth ?\n\n\n",
	"bandwidth_key3": "Bandwidth kisi network ya internet connection ki maximum data transfer\nrate ko describe karata hai.yah dekta hai ki kisi specific time par kisi specific\nconnection par kitana deta bheja ja sakata hai.udahran ke liye, ek gigabit(GB) enternet\nconnection me 1,000 Mbps ki bandwidth hai, (125 MBps). kebal modem ki help se hi \nek internet connection 25 Mbps bandwidth\nde sakata hai\nJab bandwidth ka use network ki speed ko describe karane ke lie kiya jaata hai,to yah nani dekhta\nhai ki dekhta ki bits kitni tezi se ek place se dusre place pe move karna hai. choonki deta \npackets electronic ya fiber optic cables par yaatra karate hain, sthaanaantarit pratyek \nbit kee gati nagany hai. isake bajae, bandwidth ye measure karata hai ki data ek specificconection \nki help se flow ho sakta hai.\n",
	"bandwidth_key4": "note :-yha humne appko Bandwidth samjhne ki kosish ki hai.\nabb aap baki ka content English main padhe,or yeh apko tech se related kuch words batane main help krenge or jo abko kuch complicated lage bo aap Google kr skte hai.\n",
	"bandwidth_key5": "### You can also learn from here in english with small content.\n\n\n",
	"bandwidth_key6": "Bandwidth describes the maximum data transfer rate of a network or Internet connection. It measures how much data can be sent over a specific connection in a given amount of time. For example, a gigabit Ethernet connection has a bandwidth of 1,000 Mbps, (125 megabytes per second). An Internet connection via cable modem may provide 25 Mbps of bandwidth.\n",
	"bandwidth_key7": "While bandwidth is used to describe network speeds, it does not measure how fast bits of data move from one location to another. Since data packets travel over electronic or fiber optic cables, the speed of each bit transferred is negligible. Instead, bandwidth measures how much data can flow through a specific connection at one time.\n",
	"bandwidth_key8": "# How does it work?\n\n\n",
	"bandwidth_key9": "# Type of Bandwidth :-\n\n\n",
	"bandwidth_key10": "### PUBLIC WIRELESS\n\n\n",
	"bandwidth_key11": "Long Term Evolution (LTE) cellular service, also referred to as 4G, and satellite tend to be more expensive than terrestrial services offering similar bandwidth. \n",
	"bandwidth_key12": "### PUBLIC BROADBAND\n\n\n",
	"bandwidth_key13": "The term broadband is shorthand for broad bandwidth. These high-speed Internet connections are provided through either cable or telephone companies. Broadband Internet uses multiple data channels to transfer large quantities of information.\n",
	"bandwidth_key14": "### PRIVATE NETWORKS\n\n\n",
	"bandwidth_key15": "As the name implies, private networks are not shared. They are sold through carriers as professional business services with Service Level Agreements (SLA) that include Quality of Service (QoS) terms. Because of this, contracts are significantly more expensive than best effort public broadband services and have lengthy contract durations (typically 36 to 60 months).\n"
}