{
	"hard-questions_key1": "## Hard Questions\n\n",
	"hard-questions_key2": "In final exam of class IX there are 50 students 10 % students failed. How many students passed to class X?\n\nKaksha ix kee antim pareeksha mein 50 chhaatr hain 10% chhaatr asaphal rahe. da`savee`n kaksha mein kitane chhaatr utteern hue?\n\n     a. 55 %\n     b. 45 %\n     c. 50 %\n     d. 40 %\n     \n",
	"hard-questions_key3": "In a class of 50 students, 40 % are girls. Find the number of girls and number of boys in the class?\n\n50 chhaatron kee kaksha mein, 40% ladakiyaan hain. kaksha mein ladakiyon kee sankhya aur ladakon kee sankhya gyaat keejie?\n\n     a. 20 %\n     b. 22 %\n     c. 30 %\n     d. 15 %\n     \n",
	"hard-questions_key4": "Victor gets 92 % marks in examinations. If these are 460 marks, find the maximum marks.\n\nVictor ko pareekshaon mein 92% ank mile. yadi ye 460 ank hain, to adhikatam ank praapt karen.\n\n     a. 100 m\n     b. 200 m\n     c. 250 m\n     d. 500 m\n\n",
	"hard-questions_key5": "In a certain school, 20% of students are below 8 years of age. The number of students above 8 years of age is  of the number of students of 8 years of age which is 48. What is the total number of students in the school?\n\nEk nishchit school mein, 20% student 8 varsh se kam umr ke hain. 8 varsh se adhik aayu ke student kee sankhya 8 varsh kee aayu ke student kee sankhya hai jo 48 hai. school mein student kee kul sankhya kya hai?\n\n     a. 100 %\n     b. 72 %\n     c. 80 %\n     d. 120 %\n     \n",
	"hard-questions_key6": "Two numbers A and B are such that the sum of 5% of A and 4% of B is two-third of the sum of 6% of A and 8% of B. Find the ratio of A : B.\n\nDo sankhyaen a aur b aisee hain, jinamen a ka 5% aur b ka 4% ka yog a ke 6% ke do-tihaee aur b ke 8% ka yog hai: a: b ka anupaat gyaat keejie.\n\n     a. 4:5\n     b. 2:3\n     c. 3:2\n     d. 4:3\n\n\n",
	"hard-questions_key7": "## Answers\n\n",
	"hard-questions_key8": "45 %\n",
	"hard-questions_key9": "20 %\n",
	"hard-questions_key10": "500 m\n",
	"hard-questions_key11": "100 %\n",
	"hard-questions_key12": "4:3\n"
}