{
    "About-NavGurukul_key1": "अभिषेक गुप्ता (IIT-D के पूर्व छात्र) और ऋषभ वर्मा (स्व-सिखाया प्रोग्रामर) द्वारा 2016 में शुरू किया गया, <a href=\"https://navgurukul.org/\">नवगुरुकुल</a> एक गैर-लाभकारी संगठन है जो समाज के वंचित वर्गों के छात्रों को आर्थिक रूप से स्वतंत्र बनने में मदद करता है। <b>हम अपने 1 साल के आवासीय कार्यक्रम के</b> माध्यम से छात्रों को मुफ्त में पढ़ाते हैं और <b>उन्हें एक अच्छी भुगतान वाली सॉफ्टवेयर इंजीनियरिंग नौकरी की गारंटी देते हैं</b> । हमारे छात्र माइंडट्री, थॉटवर्क्स और अनएकेडमी जैसी कंपनियों में कार्यरत हैं। <a href=\"https://www.forbesindia.com/article/30-under-30-2020/navgurukul-cracking-the-code-to-success/57717/1\">हमारे काम को फोर्ब्स</a> , <a href=\"https://timesofindia.indiatimes.com/home/sunday-times/how-a-gurukul-for-coders-is-changing-lives/articleshow/60896051.cms\">टीओआई</a> में चित्रित किया गया है और हम माइक्रोसॉफ्ट, एक्सेंचर, केपीएमजी, एन/कोर द्वारा समर्थित हैं।",
    "About-NavGurukul_key2": "अब तक, हमने डीएसईयू, पंजाब, त्रिपुरा, और ओडिशा सरकार और <b>100+ गैर सरकारी संगठनों</b> <b>सहित 9 सरकारी निकायों</b> के साथ भागीदारी की है ताकि उन छात्रों की पहचान की जा सके जो हमारे कार्यक्रम से सबसे अधिक लाभ उठा सकते हैं।",
    "About-NavGurukul_key3": "पांच वर्षों से अधिक समय से, नवगुरुकुल विभिन्न पृष्ठभूमि के छात्रों को वित्तीय रूप से टिकाऊ सेटअप में स्थानीय भाषा के पाठ्यक्रम का उपयोग करके सॉफ्टवेयर प्रोग्रामिंग सीखने और सीखने के लिए कम लागत वाले आवासीय स्थान प्रदान कर रहा है। <b>धर्मशाला, बैंगलोर, सरजापुर, पुणे, त्रिपुरा और दिल्ली</b> में हमारे परिसरों में <b>900+ छात्रों</b> की क्षमता के साथ हम गारंटीशुदा नौकरियों वाले लड़कों/लड़कियों/महिलाओं/ट्रांस महिलाओं के लिए एक साल का आवासीय पाठ्यक्रम निःशुल्क चलाते हैं जो उन्हें भुगतान करते हैं। 20,000 INR प्रति माह या अधिक। ये पाठ्यक्रम पारंपरिक इंजीनियरिंग पाठ्यक्रमों के प्रतिस्थापन हैं, जिनकी लागत 10 गुना है और 700% बेहतर परिणामों के साथ 4 गुना समय लगता है। <b>210</b> से अधिक <b>छात्रों को 60+</b> स्टार्टअप और एसएमई में रखा गया है, जिनका औसत वेतन INR 3.1 लाख प्रति वर्ष है।",
    "About-NavGurukul_key4": "<a href=\"https://navgurukul.org/\">आप हमें https://navgurukul.org/</a> पर भी विजिट कर सकते हैं।"
}