{
	"ProjectMusicalInstrument_key1": "Iss project mein aap ek musical instrument banayenge jo alag-alag \"keypress\" se alag alag note bajaye. Aapka instrument \"Sa\" \"Re\" \"Ga\" \"Ma\" \"Pa\" \"Dha\" \"Ni\" \"Sa\" - ye notes baja sakte hain ya\n",
	"ProjectMusicalInstrument_key2": "iski\n",
	"ProjectMusicalInstrument_key3": "tarah alag alag drum sounds.\n",
	"ProjectMusicalInstrument_key4": "Google pe apne instruments ke liye sound effects dhoondiye. ye \"saregama\" ke notes ho sakte hain ya koi bhi alag alag sound effects.\n",
	"ProjectMusicalInstrument_key5": "Apne `application` ka frontend design kijiye. Ye aapka musical instrument hai - isey apna design aur personal look dijiye. Ideally aapke musical instrument mein kuch buttons hone chahiye. <audio> tags use karke har button ka audio source define kijiye.\n",
	"ProjectMusicalInstrument_key6": "Apne javascript `code` mein, \"`key`press\" event ko capture kijiye.\n",
	"ProjectMusicalInstrument_key8": "Har &quot;`key`press&quot; event mein ek event object capture hota hai. Iss event object ke pre-defined properties aur methods hote hain. Aap inke baare mein ",
	"ProjectMusicalInstrument_key9": "yahan",
	"ProjectMusicalInstrument_key10": " se padh sakte hain.",
	"ProjectMusicalInstrument_key11": "`Key`press event ka \"`key`\" property mein humare `key`press event ki value store hoti hai. Aap swtich cases use karke, kaun sa `key`press hua hai, use identify kar sakte hain aur uske corresponding audio play kar sakte hain.\n",
	"ProjectMusicalInstrument_key12": "Har `key`press ke saath, agar aap chahe, to apne page ki koi CSS property bhi change kar sakte hain - jaise apne buttons ko bada karna ya usme koi background add karna etc.... Isse aapka page `key`press se responsive lagega.\n\n\n\n",
	"ProjectMusicalInstrument_key13": "**Homework**\n",
	"ProjectMusicalInstrument_key14": "Aapke musical instrument mein kya khasiyat hai?\n",
	"ProjectMusicalInstrument_key15": "Aapke musical instrument mein kya kamiyan hain? Inn kamiyon ko aap kin programming concepts ko use karke dur kar sakte hain?\n"
}