{
	"ProjectMenstrualClock_key1": "Watch the short film here:\n",
	"ProjectMenstrualClock_key2": "You can learn more about periods\n",
	"ProjectMenstrualClock_key3": "here\n",
	"ProjectMenstrualClock_key4": "and\n",
	"ProjectMenstrualClock_key5": "here\n",
	"ProjectMenstrualClock_key6": "Project Menstrual Clock v 1\n",
	"ProjectMenstrualClock_key8": "Ek HTML/CSS page banao jo date and a clock display kare. Date and Clock ",
	"ProjectMenstrualClock_key9": "iss",
	"ProjectMenstrualClock_key10": " tarah ke placeholder mein design karke dalein. Try karein ki aap `code` na dekhe.\n",
	"ProjectMenstrualClock_key11": "transform",
	"ProjectMenstrualClock_key12": " and ",
	"ProjectMenstrualClock_key13": "transform-origin",
	"ProjectMenstrualClock_key14": " css style properties use karke aap clock ke hands ko kahi bhi position kar sakte hain.\nSochiye ki css ki kaun si properties use karke aap clock ke hands ko kahi bhi position kar sakte hain. (Hint: try &quot;transform&quot; and &quot;transform-origin&quot;)",
	"ProjectMenstrualClock_key16": "JavaScript mein, present date using ",
	"ProjectMenstrualClock_key17": "Date",
	"ProjectMenstrualClock_key18": " nikale. Us date object se day, month and year alag alag nikale using the pre-defined date ",
	"ProjectMenstrualClock_key19": "methods",
	"ProjectMenstrualClock_key20": ". Usko alag `variables` mein store karein.",
	"ProjectMenstrualClock_key21": "Apne html page ke date placeholder ko modify karein taaki ab wo current date dikhaye.   Aapko iske liye DOM mei changes karne padenge. Aap kisi bhi method jaise kisi object ki innerHTML change, queryselector(), etc. use kar kar change kar sakte ho.",
	"ProjectMenstrualClock_key22": "Usi tarah javascript mein ek function likhe jo hour, minute and seconds ko Date Object se extract kare. Hour, minute and second hands ki position change karein to reflect the current time. Aapko hour, minute and second ko degrees mein convert karna padega. Aapko fir \"transform\" style property change karke hands ko sahi position karna padega.\n\n",
	"ProjectMenstrualClock_key23": "Aapko clock ko regularly update karne honga - har ek second pe. Upar ke function ko har second update karne ke liye setInterval() function ka use kijiye. Aap css ke \"transition\" property use karke clock hands ko smoothly move kar sakte hain.\n\n",
	"ProjectMenstrualClock_key25": "Apne web browser mein aap apne last period date ko permanently store kar sakte hain using ",
	"ProjectMenstrualClock_key26": "localStorage",
	"ProjectMenstrualClock_key27": ".",
	"ProjectMenstrualClock_key28": "Isi tarah apna period cycle bhi store karein. Aapka period cycle 28-35 days ke beech mein vary kar sakta hai.\n",
	"ProjectMenstrualClock_key29": "Javascript mein Current date se period date ka difference check kijiye. Agar yeh difference hai, aur maan lo 28 days ki period cycle hai, toh yeh nikaliye ki kitne din bachche hai next period mei. Clearly, yeh din 28 se kam honge. Sochiye iske liye aap ko kaunsa function use karna hoga.\n\n\n",
	"ProjectMenstrualClock_key30": "Agar result 0 ya uske aas paas hai, iska matlab period ki date aa gayi hai.\n",
	"ProjectMenstrualClock_key31": "Period date ke approach hone pe aap kisi tarah ka indicator de sakte hain - jaise change in background ya snowfall ya aur kuch. Aap khud sochiye ki aapko apne liye kis tarah ka indicator chahiye. Apne project mein us indicator ko add kijiye.\n\n",
	"ProjectMenstrualClock_key32": "Apne project mein aur kisi tarah ke changes karna chahenge jisse aapka Menstrual clock aur behter ho. Iske baare mein sochiye aur extra features ki list banaiye. \nIske liye aap\n\n",
	"ProjectMenstrualClock_key33": "Periods ke baarein mei aur research kar kar samajh sakte hai ki kaise features useful ho sakte hai\n",
	"ProjectMenstrualClock_key35": "Period tracker naam se apps dhoondh sakte hai playstore par, aur unn apps se inspire ho kar soch sakte hai ki aap kya changes karna chahte hai",
	"ProjectMenstrualClock_key36": "Look at ",
	"ProjectMenstrualClock_key37": "this",
	"ProjectMenstrualClock_key38": " period game that aims to educate people about periods. Can you think of a similar game in javascript?"
}