{
	"intro_key1": "Course ke bare me",
	"intro_key2": "Ish Course me app ko kafi sare <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">Exercises</span> milegi Jisko karke app apne <b>Logic build</b> karsakte ho ish course me jitne bi questions ha woh sare app kisi bi <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">Language</span> <i>(JavaScript, <span style=\"\">Python</span> aur Java)</i> ke through solve karsakte hai aur saat hi yeh bi <i>Test</i> karsakte ha ki kya woh <span style=\"\">code</span> sahi se kaam kar raha ha yeah nhi joh apne likha hai.",
	"intro_key3": "Course ka Structure",
	"intro_key4": "Apka <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">Day-1, Day-2, ..... Day-n</span> bolke alag alag exercises ha jishme hardin apko kuch questions karne hai aur apka target hoga ki jitne questions Day wale me ha ushe complete karna hai.",
	"intro_key5": "Course ko Istamal kese kare?",
	"intro_key6": "<b>Agar app ka program sahi <span style=\"\">output</span> nhi deh raha hai toh apne <span style=\"\">code</span> sahi ni likha hai ush samhe uska DRY RUN karke dekhe ki flow sahi  hai yeah nhi.</b>",
	"intro_key7": "<b>Yeah phir ush topic ke bare meh jara padhle ki woh kese kaam karta hai aur kya apne ushe sahi tarike se istamal kiya hai yeah nhi.</b>",
	"intro_key8": "Har ek Task me 4 sections hai",
	"intro_key9": "<ol><br><li>Reading-Material Part</li><br></ol>",
	"intro_key10": "Yahan apko Task se related kuch Reading Material milega joh apko task complete karne me help karega.",
	"intro_key11": "<ol start=\"2\"><br><li>Questions</li><br></ol>",
	"intro_key12": "Yahan apka main Task hoga joh apko karna ha upar diye gaye <i>Reading-Material</i> ko padhke<br>samjh ajayega yeh kese karna hai.",
	"intro_key13": "<ol start=\"3\"><br><li>Test</li><br></ol>",
	"intro_key14": "Yahan Apke pass apne program test karne ke liye kuch values honge jishe yeh pata chalega kya apka program joh apne likha hai woh sahi hai.",
	"intro_key15": "<ol start=\"4\"><br><li>Hint</li><br></ol>",
	"intro_key16": "Yahan apko question se related hint mil jayega ki ish question ko kese karna ha yeah app jahna ruk jayenge woh apko yahan pata chal jayega."
}