{
    "WhatIsProgramming_key1": "कंप्यूटर को <b>निर्देश</b> देकर हम जटिल समस्याओं को हल करने के लिए कंप्यूटर को तैयार कर सकते हैं।",
    "WhatIsProgramming_key2": "कंप्यूटर को दिए गए <b>निर्देशों</b> के समूह को <b>प्रोग्राम</b> कहा जाता है।<br> कंप्यूटर को निर्देश देने की प्रक्रिया <b>प्रोग्रामिंग</b> कहलाती है।",
    "WhatIsProgramming_key3": "क्या यह सरल नहीं लगता कि हम कंप्यूटर को निर्देश (प्रोग्राम) देते हैं और कंप्यूटर एक जटिल समस्या को हल करने के लिए इन निर्देशों का पालन करता है? कंप्यूटर को निर्देश देना प्रोग्रामिंग कहलाता है। :)",
    "WhatIsProgramming_key4": "लेकिन एक छोटी सी समस्या है।",
    "WhatIsProgramming_key5": "कंप्यूटर हमारी भाषा (हिंदी, तमिल, कन्नड़) की तरह नहीं समझ सकता। कंप्यूटर केवल उस मशीनी भाषा को समझ सकता है जो 0 और 1 से बनी है। इसलिए, कंप्यूटर के साथ मशीनी भाषा में संवाद करना हमारे लिए मुश्किल हो जाता है।",
    "WhatIsProgramming_key6": "फिर हम कंप्यूटर को निर्देश कैसे दे सकते हैं?",
    "WhatIsProgramming_key7": "इसलिए, इस समस्या को हल करने के लिए हमने कुछ भाषाएँ बनाईं जैसे (Java, <span style=\"\">Python</span> , JavaScript) ताकि हम कंप्यूटर को आसानी से निर्देश दे सकें। कंप्यूटर इन भाषाओं को &quot; <span style=\"\">compiler</span> नामक एक अन्य प्रोग्राम&quot; की सहायता से आसानी से मशीनी भाषा में बदल सकता हैं।",
    "WhatIsProgramming_key8": "कंप्यूटर को निर्देश देने के लिए हमें इनमें से कोई भी भाषा सीखनी होगी। इस पाठ्यक्रम में, हम <span style=\"\">python</span> भाषा सीखने जा रहे हैं।",
    "WhatIsProgramming_key9": "कंप्यूटर को निर्देश देने के लिए हम <span style=\"\">python</span> भाषा का प्रयोग करेंगे।<br><br>नीचे दी गयी वीडियो में Erica (Amazon में इंजीनियरिंग मैनेजर) और Jerome (Xbox में प्रोग्राम मैनेजर) बताते हैं कि कैसे कंप्यूटर हार्डवेयर(सर्किट, CPU, आदि) को किसी के लिखे हुए कोड द्वारा नियंत्रित किया जाता है । मूल रूप से किसी कार्य को करने के लिए हार्डवेयर और सॉफ्टवेयर एक साथ कैसे काम करते हैं। वीडियो में Microsoft के सह-संस्थापक और विंडोज OS के निर्माता Bill Gates भी बताते हैं कि OS कैसे काम करता है। ",
    "WhatIsProgramming_key10": "<b>कार्यभार</b>",
    "WhatIsProgramming_key11": "क्या आपने कभी किसी को निर्देश दिए हैं या किसी से निर्देश लिए हैं। क्या इसे हम <b>प्रोग्राम</b> कह सकते हैं ?",
    "WhatIsProgramming_key12": "पायथन भाषा और उसके अनुप्रयोगों की खोज करें? दुनिया में कितने लोग Java का इस्तेमाल करते हैं?"
}
