{
    "why_key1": "<a href=\"https://www.youtube.com/watch?v=UlpurGz1-TU&t=9s\">अंग्रेजी में पायथन का परिचय<br></a>",
    "why_key2": "<a href=\"https://www.youtube.com/watch?v=iWNpVTYSt74\">पायथन का हिंदी में परिचय<br></a>",
    "why_key3": "कोडिंग की विशेषता क्या है",
    "why_key4": "जब हम Image, audio या video फ़ाइल जैसी कोई फ़ाइल भेजना चाहते हैं, तो हम कभी-कभी उसे compress कर देते हैं या हम जिस सॉफ़्टवेयर या वेबसाइट का उपयोग करते हैं, वह उसे हमारे लिए compress कर देता है। यह compression आवश्यक है ताकि उन फ़ाइलों को स्टोर करने और  भेजने के लिए कम स्थान और डेटा का उपयोग किया जा सके। नीचे दी गयी पहली वीडियो में, एक गायक, गीतकार और मनोरंजनकर्ता, Aloe Blacc, जिन्होंने अपनी वेबसाइट भी खुद बनाई है, बताते हैं कि कोडिंग के माध्यम से फाइलों का compression कैसे होता है और यह क्यों उपयोगी है।<br><br>आज कोडिंग के ज़रुरत कई सेक्टर्स में है, उदाहरण के लिए नीचे दी गयी दूसरी वीडियो देखें जिसमें चिकित्सा विज्ञान में कोडिंग के उपयोग पर चर्चा की गई है और यह कैसे जीवन बचा सकता है, इस वीडियो में Joshua के बारे में बताया गया है जिनका एक दिन में इलाज किया गया, Algorithm के लिए डॉक्टर्स उनके Gene  Sequence का विश्लेषण करते हैं जो बिना कम्प्यूटर्स के बिना पता लगाना असंभव है।",
    "why_key5": "<span style=\"\">Python2</span> और <span style=\"\">Python3</span> . के बीच अंतर",
    "why_key6": "<b><span style=\"\">Python2</span></b>",
    "why_key7": "यह पाइथन का पुराना संस्करण है।",
    "why_key8": "Python2 में एक प्रिंट स्टेटमेंट है।",
    "why_key9": "Python2 में प्रिंट करते समय हम इस तरह लिखते हैं,",
    "why_key10": "Python2 में हम उपयोगकर्ता(user) इनपुट के लिए raw_input ka उपयोग का उपयोग करते हैं।",
    "why_key11": "Python2 में 31 कीवर्ड हैं।",
    "why_key12": "<b><span style=\"\">Python3</span></b>",
    "why_key13": "यह पायथन का नया संस्करण है।",
    "why_key14": "पायथन 3 में एक प्रिंट() है।",
    "why_key15": "Python3 में प्रिंट करते समय हम कोष्ठक () का उपयोग करते हैं।",
    "why_key16": "Python3 में हम उपयोगकर्ता(user) के इनपुट के लिए इनपुट का उपयोग करते हैं।",
    "why_key17": "Python3 में 35 कीवर्ड हैं।"
}
