{
    "WhatDoComputersDo_key1": "संगणक काय करतात?",
    "WhatDoComputersDo_key2": "आपल्या मानवी इतिहासात असे काही महान आविष्कार झाले आहेत ज्यांनी मानवाच्या जीवनात प्रगती केली आणि त्याला दिशाही दिली. उदा: <b>चक्र (चाक)</b>",
    "WhatDoComputersDo_key3": "मानवांना जास्त अंतरापर्यंत जड भार उचलणे किंवा वाहून नेणे शक्य नव्हते. हे मानवी शारीरिक मर्यादांमुळे होते.<br> चक्राच्या शोधामुळे, मानव खूप जड भार वाहून तसेच लांब अंतराचा प्रवास करण्यास सक्षम झाला.<br> जग आपल्यासाठी लहान झाले. त्यामुळे चक्राच्या शोधामुळे अनेक समस्या दूर झाल्या. आता दूरवर राहणाऱ्या आपल्या नातेवाईकांनाही भेटता येते आणि मालाची वाहतूकही सोपी झाली आहे.",
    "WhatDoComputersDo_key4": "मानवी इतिहासात आमूलाग्र बदल घडवणारा आणखी एक महान शोध - <b>संगणक</b>.",
    "WhatDoComputersDo_key5": "ज्याप्रमाणे चक्राने आपल्या शारीरिक मर्यादा दूर केल्या, त्याचप्रमाणे संगणकांनी आपल्या मेंदूची क्षमता किंवा मानसिक मर्यादा वाढवण्यात मदत केली.",
    "WhatDoComputersDo_key6": "मानवी मेंदू अनेक गुंतागुंतीची कामे/समस्या सोडवू शकतो. पण जर आपला मेंदू सतत या गुंतागुंतीच्या समस्या सोडवत राहिला तर आपला मेंदू थकायला किंवा कंटाळायला लागतो. आपला मेंदू चुका करू लागतो आणि समस्या सोडवणे आपल्यासाठी कठीण होते.",
    "WhatDoComputersDo_key7": "ज्याप्रमाणे चाकांनी आपल्या शारीरिक मर्यादा दूर केल्या, त्याचप्रमाणे संगणकाच्या शोधामुळे आपल्या मानसिक मर्यादा दूर करण्यात मदत झाली. कॉम्प्युटरला सूचना देऊन, आपण त्यांना गुंतागुंतीची कामे, कोणतीही चूक न करता आणि न थकता सतत करायला लावू शकतो.",
    "WhatDoComputersDo_key8": "संगणकांना त्यांचा मेंदू नसतो त्यामुळे ते विचार करू शकत नाहीत, कोणतीही गुंतागुंतीची समस्या सोडवण्यासाठी त्यांना सूचना द्याव्या लागतात.",
    "WhatDoComputersDo_key9": "चला संगणक कसे काम करते ते पाहू",
    "WhatDoComputersDo_key10": "<b>खालील प्रश्न वाचा आणि शोधा.</b><br> -- तुम्ही संगणकाबद्दल काय शिकलात?<br> -- संगणकाचे <span style=\"\">applications</span> काय आहेत? हे <span style=\"\">applications</span> कोणत्या प्रकारच्या समस्या सोडवतात? या <span style=\"\">applications</span> साठी संगणकांना कोणत्या प्रकारच्या सूचना दिल्या होत्या याचा विचार करा?"
}
