{
    "WhatDoComputersDo_key1": "कंप्यूटर क्या करते हैं?",
    "WhatDoComputersDo_key2": "हमारे मानव इतिहास में कुछ ऐसे महान अविष्कार हुए हैं जिन्होंने मनुष्य के जीवन में प्रगति की है और उसे दिशा भी प्रदान की है। उदाहरण: <b>पहिया</b>",
    "WhatDoComputersDo_key3": "मनुष्य अधिक दूरी तक भारी भार उठाने या ले जाने में सक्षम नहीं थे। यह मानवीय शारीरिक सीमाओं के कारण था।<br> WHEEL के आविष्कार से मनुष्य बहुत भारी भार ढोने के साथ-साथ लंबी दूरी की यात्रा करने में भी सक्षम हो गया था।<br> दुनिया हमारे लिए छोटी हो गई। इसलिए, WHEEL के आविष्कार ने बहुत सारी समस्याओं का समाधान किया। अब, हम दूर रहकर अपने रिश्तेदारों से भी मिल सकते हैं और माल का परिवहन भी आसान हो गया है।",
    "WhatDoComputersDo_key4": "एक और महान आविष्कार जिसने मानव इतिहास में भारी बदलाव लाया- <b>कंप्यूटर</b> ।",
    "WhatDoComputersDo_key5": "जैसे पहियों ने हमारी शारीरिक सीमाओं को हटा दिया, वैसे ही कंप्यूटर ने हमारे मस्तिष्क की क्षमता या मानसिक सीमाओं को बढ़ाने में मदद की।",
    "WhatDoComputersDo_key6": "मानव मस्तिष्क कई जटिल कार्यों/समस्याओं को हल कर सकता है। लेकिन अगर हमारा दिमाग लगातार इन जटिल समस्याओं को सुलझाता है तो हमारा दिमाग थकने या ऊबने लगेगा। हमारा दिमाग गलतियां करने लगेगा और हमारे लिए समस्या का समाधान करना मुश्किल हो जाएगा।",
    "WhatDoComputersDo_key7": "जिस तरह पहियों ने हमारी शारीरिक सीमाओं को हटा दिया, उसी तरह कंप्यूटर के आविष्कार ने हमारी मानसिक सीमाओं को दूर करने में मदद की। कंप्यूटर को निर्देश देकर, हम उनसे बिना कोई गलती किए और बिना थके लगातार जटिल कार्य कर सकते हैं।",
    "WhatDoComputersDo_key8": "कंप्यूटर के पास दिमाग नहीं होता है इसलिए वे सोच नहीं सकते हैं, हमें उन्हें निर्देश देना होगा कि वे किसी भी जटिल समस्या को हल करें।",
    "WhatDoComputersDo_key9": "<b>निम्न प्रश्नों को पढ़ें और खोजें।</b><br>-- आपने कंप्यूटर के बारे में क्या सीखा?<br>-- कंप्यूटर के <span style=\"\">applications</span> क्या हैं? ? ये <span style=\"\">applications</span> किस तरह की समस्याओं का समाधान करते हैं? इस बारे में सोचें कि इन <span style=\"\">applications</span> के लिए कंप्यूटर को किस तरह के निर्देश दिए गए थे?"
}