[
	{
		"component": "header",
		"variant": 1,
		"value": "Matching Specific Repetitions with Curly Brackets"
	},
	{
		"component": "text",
		"value": "If you have a group that you want to repeat a specific number of times, follow the group in your regex with a number in curly brackets. For example, the regex (Ha){3} will match the <span style=\"\">string</span> 'HaHaHa', but it will not match 'HaHa', since the latter has only two repeats of the (Ha) group."
	},
	{
		"component": "text",
		"value": "Instead of one number, you can specify a range by writing a minimum, a comma, and a maximum in between the curly brackets. For example, the regex (Ha){3,5} will match 'HaHaHa', 'HaHaHaHa', and 'HaHaHaHaHa'."
	},
	{
		"component": "text",
		"value": "You can also leave out the first or second number in the curly brackets to leave the minimum or maximum unbounded. For example, (Ha){3,} will match three or more instances of the (Ha) group, while (Ha){,5} will match zero to five instances. Curly brackets can help make your regular expressions shorter. These two regular expressions match identical patterns:"
	},
	{
		"component": "text",
		"value": "(Ha){3}<br>(Ha)(Ha)(Ha)<br>And these two regular expressions also match identical patterns:"
	},
	{
		"component": "text",
		"value": "(Ha){3,5}<br>((Ha)(Ha)(Ha))|((Ha)(Ha)(Ha)(Ha))|((Ha)(Ha)(Ha)(Ha)(Ha))<br>Enter the following into the interactive <span style=\"\">shell</span>:"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": ">>> haRegex = re.compile(r'(Ha){3}')<br>>>> mo1 = haRegex.search('HaHaHa')<br>>>> mo1.group()<br>'HaHaHa'<br><br>>>> mo2 = haRegex.search('Ha')<br>>>> mo2 == None<br>True"
	},
	{
		"component": "text",
		"value": "Here, (Ha){3} matches 'HaHaHa' but not 'Ha'. Since it doesn’t match 'Ha', search() returns None."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Greedy and Nongreedy Matching"
	},
	{
		"component": "text",
		"value": "Since (Ha){3,5} can match three, four, or five instances of Ha in the <span style=\"\">string</span> 'HaHaHaHaHa', you may wonder why the Match object’s call to group() in the previous curly bracket example returns 'HaHaHaHaHa' instead of the shorter possibilities. After all, 'HaHaHa' and 'HaHaHaHa' are also valid matches of the regular expression (Ha){3,5}."
	},
	{
		"component": "text",
		"value": "<span style=\"\">Python</span>’s regular expressions are greedy by default, which means that in ambiguous situations they will match the longest <span style=\"\">string</span> possible. The non-greedy version of the curly brackets, which matches the shortest <span style=\"\">string</span> possible, has the closing curly bracket followed by a question mark."
	},
	{
		"component": "text",
		"value": "Enter the following into the interactive <span style=\"\">shell</span>, and notice the difference between the greedy and nongreedy forms of the curly brackets searching the same <span style=\"\">string</span>:"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": ">>> greedyHaRegex = re.compile(r'(Ha){3,5}')<br>>>> mo1 = greedyHaRegex.search('HaHaHaHaHa')<br>>>> mo1.group()<br>'HaHaHaHaHa'<br><br>>>> nongreedyHaRegex = re.compile(r'(Ha){3,5}?')<br>>>> mo2 = nongreedyHaRegex.search('HaHaHaHaHa')<br>>>> mo2.group()<br>'HaHaHa'"
	},
	{
		"component": "text",
		"value": "Note that the question mark can have two meanings in regular expressions: declaring a nongreedy match or flagging an optional group. These meanings are entirely unrelated."
	}
]