[
	{
		"component": "header",
		"variant": 1,
		"value": "Project: Phone Number and Email Address Extractor"
	},
	{
		"component": "text",
		"value": "Say you have the boring task of finding every phone number and email address in a long web page or document. If you manually scroll through the page, you might end up searching for a long time. But if you had a program that could search the text in your clipboard for phone numbers and email addresses, you could simply press CTRL-A to select all the text, press CTRL-C to copy it to the clipboard, and then run your program. It could replace the text on the clipboard with just the phone numbers and email addresses it finds."
	},
	{
		"component": "text",
		"value": "Whenever you’re tackling a new project, it can be tempting to dive right into writing <span style=\"\">code</span>. But more often than not, it’s best to take a step back and consider the bigger picture. I recommend first drawing up a high-level plan for what your program needs to do. Don’t think about the actual <span style=\"\">code</span> yet—you can worry about that later. Right now, stick to broad strokes."
	},
	{
		"component": "text",
		"value": "For example, your phone and email address extractor will need to do the following:"
	},
	{
		"component": "text",
		"value": "Get the text off the clipboard."
	},
	{
		"component": "text",
		"value": "Find all phone numbers and email addresses in the text."
	},
	{
		"component": "text",
		"value": "Paste them onto the clipboard."
	},
	{
		"component": "text",
		"value": "Now you can start thinking about how this might work in <span style=\"\">code</span>. The <span style=\"\">code</span> will need to do the following:"
	},
	{
		"component": "text",
		"value": "Use the pyperclip module to copy and paste <span style=\"\">strings</span>."
	},
	{
		"component": "text",
		"value": "Create two regexes, one for matching phone numbers and the other for matching email addresses."
	},
	{
		"component": "text",
		"value": "Find all matches, not just the first match, of both regexes."
	},
	{
		"component": "text",
		"value": "Neatly format the matched <span style=\"\">strings</span> into a single <span style=\"\">string</span> to paste."
	},
	{
		"component": "text",
		"value": "Display some kind of message if no matches were found in the text."
	},
	{
		"component": "text",
		"value": "This list is like a road map for the project. As you write the <span style=\"\">code</span>, you can focus on each of these steps separately. Each step is fairly manageable and expressed in terms of things you already know how to do in <span style=\"\">Python</span>."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Step 1: Create a Regex for Phone Numbers"
	},
	{
		"component": "text",
		"value": "First, you have to create a regular expression to search for phone numbers. Create a new <span style=\"\">file</span>, enter the following, and <span style=\"\">save</span> it as phoneAndEmail.py:"
	},
	{
		"component": "text",
		"value": "<h1 id=\"spanstylepython3span\">! <span style=\"\">python3</span></h1>"
	},
	{
		"component": "header",
		"variant": 1,
		"value": "phoneAndEmail.py - Finds phone numbers and email addresses on the clipboard."
	},
	{
		"component": "text",
		"value": "import pyperclip, re"
	},
	{
		"component": "text",
		"value": "phoneRegex = re.compile(r'''(<br>    (\\d{3}|(\\d{3}))?                # area <span style=\"\">code</span><br>    (\\s|-|.)?                        # separator<br>    (\\d{3})                           # first 3 digits<br>    (\\s|-|.)                         # separator<br>    (\\d{4})                           # last 4 digits<br>    (\\s<i>(ext|x|ext.)\\s</i>(\\d{2,5}))?    # extension<br>    )''', re.VERBOSE)"
	},
	{
		"component": "header",
		"variant": 1,
		"value": "TODO: Create email regex."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "TODO: Find matches in clipboard text."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "TODO: Copy results to the clipboard."
	},
	{
		"component": "text",
		"value": "The TODO comments are just a skeleton for the program. They’ll be replaced as you write the actual <span style=\"\">code</span>."
	},
	{
		"component": "text",
		"value": "The phone number begins with an optional area <span style=\"\">code</span>, so the area <span style=\"\">code</span> group is followed with a question mark. Since the area <span style=\"\">code</span> can be just three digits (that is, \\d{3}) or three digits within parentheses (that is, (\\d{3})), you should have a pipe joining those parts. You can add the regex comment # Area <span style=\"\">code</span> to this part of the multiline <span style=\"\">string</span> to help you remember what (\\d{3}|(\\d{3}))? is supposed to match."
	},
	{
		"component": "text",
		"value": "The phone number separator character can be a space (\\s), hyphen (-), or period (.), so these parts should also be joined by pipes. The next few parts of the regular expression are straightforward: three digits, followed by another separator, followed by four digits. The last part is an optional extension made up of any number of spaces followed by ext, x, or ext., followed by two to five digits."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Step 2: Create a Regex for Email Addresses"
	},
	{
		"component": "text",
		"value": "You will also need a regular expression that can match email addresses. Make your program look like the following:"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": "<br>   #! python3<br>   # phoneAndEmail.py - Finds phone numbers and email addresses on the clipboard.<br>   import pyperclip, re<br><br>   phoneRegex = re.compile(r'''(<br>   --snip--<br><br>   # Create email regex.<br>   emailRegex = re.compile(r'''(<br>❶     [a-zA-Z0-9._%+-]+      # username<br>❷     @                      # @ symbol<br>❸     [a-zA-Z0-9.-]+         # domain name<br>       (\\.[a-zA-Z]{2,4})      # dot-something<br>       )''', re.VERBOSE)"
	},
	{
		"component": "header",
		"variant": 1,
		"value": "TODO: Find matches in clipboard text."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "TODO: Copy results to the clipboard."
	},
	{
		"component": "text",
		"value": "The username part of the email address ❶ is one or more characters that can be any of the following: lowercase and uppercase letters, numbers, a dot, an underscore, a percent sign, a plus sign, or a hyphen. You can put all of these into a character class: [a-zA-Z0-9._%+-].<br>The domain and username are separated by an @ symbol ❷. The domain name ❸ has a slightly less permissive character class with only letters, numbers, periods, and hyphens: [a-zA-Z0-9.-]. And last will be the “dot-com” part (technically known as the top-level domain), which can really be dot-anything. This is between two and four characters.<br>The format for email addresses has a lot of weird rules. This regular expression won’t match every possible valid email address, but it’ll match almost any typical email address you’ll encounter.<br>#Step 3: Find All Matches in the Clipboard Text<br>Now that you have specified the regular expressions for phone numbers and email addresses, you can let <span style=\"\">Python</span>’s re module do the hard work of finding all the matches on the clipboard. The pyperclip.paste() function will get a <span style=\"\">string</span> value of the text on the clipboard, and the findall() regex method will return a list of tuples.<br>Make your program look like the following:"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": "#! python3<br>   # phoneAndEmail.py - Finds phone numbers and email addresses on the clipboard.<br><br>   import pyperclip, re<br><br>   phoneRegex = re.compile(r'''(<br>   --snip--<br><br>   # Find matches in clipboard text.<br>   text = str(pyperclip.paste())<br>❶ matches = []<br>❷ for groups in phoneRegex.findall(text):<br>       phoneNum = '-'.join([groups[1], groups[3], groups[5]])<br>       if groups[8] != '':<br>           phoneNum += ' x' + groups[8]<br>       matches.append(phoneNum)<br>❸ for groups in emailRegex.findall(text):<br>       matches.append(groups[0])"
	},
	{
		"component": "header",
		"variant": 1,
		"value": "TODO: Copy results to the clipboard."
	},
	{
		"component": "text",
		"value": "There is one tuple for each match, and each tuple contains <span style=\"\">strings</span> for each group in the regular expression. Remember that group 0 matches the entire regular expression, so the group at index 0 of the tuple is the one you are interested in.<br>As you can see at ❶, you’ll store the matches in a list <span style=\"\">variable</span> named matches. It starts off as an empty list, and a couple for <span style=\"\">loops</span>. For the email addresses, you append group 0 of each match ❸. For the matched phone numbers, you don’t want to just append group 0. While the program detects phone numbers in several formats, you want the phone number appended to be in a single, standard format. The phoneNum <span style=\"\">variable</span> contains a <span style=\"\">string</span> built from groups 1, 3, 5, and 8 of the matched text ❷. (These groups are the area <span style=\"\">code</span>, first three digits, last four digits, and extension.)"
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Step 4: Join the Matches into a <span style=\"\">String</span> for the Clipboard"
	},
	{
		"component": "text",
		"value": "Now that you have the email addresses and phone numbers as a list of <span style=\"\">strings</span> in matches, you want to put them on the clipboard. The pyperclip.copy() function takes only a single <span style=\"\">string</span> value, not a list of <span style=\"\">strings</span>, so you call the join() method on matches.<br>To make it easier to see that the program is working, let’s print any matches you find to the <span style=\"\">terminal</span>. And if no phone numbers or email addresses were found, the program should tell the user this.<br>Make your program look like the following:"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": "#! python3<br># phoneAndEmail.py - Finds phone numbers and email addresses on the clipboard.<br><br>--snip--<br>for groups in emailRegex.findall(text):<br>    matches.append(groups[0])<br><br># Copy results to the clipboard.<br>if len(matches) > 0:<br>    pyperclip.copy('\\n'.join(matches))<br>    print('Copied to clipboard:')<br>    print('\\n'.join(matches))<br>else:<br>    print('No phone numbers or email addresses found.')"
	}
]