[
	{
		"component": "text",
		"value": "<h3 id=\"introduction\">Introduction</h3>"
	},
	{
		"component": "text",
		"value": "Data Science mein basically data ko lekar bahut saare processes and combination se ek aisa algorithm design kiya jaata hai jisse business organizations ke products ko improve kar sake aur problems ko solve kar sake.<br>Data Science teen major tech-skills se mil kar bana hai:<br>~ Mathematics Expertise<br>~ Technology Hacking Skills<br>~ Business/Strategy Acumen"
	},
	{
		"component": "text",
		"value": "<span><img src=\"http://www.exploringdatascience.com/wp-content/<span style=\"\">uploads</span>/2014/02/The-Data-Science-Clock-v1.1-Simple1.png?width=300\"&gt;</span>"
	},
	{
		"component": "text",
		"value": "Jiski detailed knowledge aap iss link se le sakte hain<br>"
	},
	{
		"component": "text",
		"value": "https://datajobs.com/what-is-data-science"
	},
	{
		"component": "text",
		"value": "<h2 id=\"reallifeexamples\">Real-Life Examples</h2>"
	},
	{
		"component": "text",
		"value": "Data Science ka sabse saral udahran yeh hai ki jaise aap Amazon ya Flipkart app/web ka use kar ke alag alag products kharidne ke liye search karte hai, <span style=\"\">tab</span> Amazon/Flipkart ke data scientists aapke dwara search ki gayi ‘<span style=\"\">key</span>words’ ke hisab se aapko us jaisa products recommend karta hai. Jaisa ki agar apne ‘Shoes’ search kiye hoge <span style=\"\">tab</span> woh aapke mail ya us mail se judi kisi bhi social medias me ‘Shoes’ ke advertisements dikhane lagta hai ya recommend karta hai."
	},
	{
		"component": "text",
		"value": "Ek dusra example yeh bhi ho sakta hai ki jaise Netflix me aap kaun se series/movies dekh rahe hai aur aapke dekhne ki average duration kitni hai. Us hisab se woh aapko movies recommend karta hai."
	},
	{
		"component": "text",
		"value": "Jab aap Facebook use karte hai aur aap kisi tarah ke posts view/like karte hai <span style=\"\">tab</span> Facebook aapke pasand ko pehchan leti hai data science ke dwara aur aage aapko waise hi posts dikhati hai."
	},
	{
		"component": "text",
		"value": "<h2 id=\"howdatascienceworks\">How Data Science works?</h2>"
	},
	{
		"component": "text",
		"value": "Data Science do type ke data pe kaam karta hai :"
	},
	{
		"component": "text",
		"value": "Structured Data",
		"decoration": {
			"type": "number",
			"value": 1
		}
	},
	{
		"component": "text",
		"value": "Unstructured Data<br><br>",
		"decoration": {
			"type": "number",
			"value": 2
		}
	},
	{
		"component": "text",
		"value": "Structured Data aise data hote hai jo human understandable form me hote hai. Jise hum asani se samajh sake. Jaise kisi <span style=\"\">tab</span>les me information di gayi rehti hai jaha pe rows aur columns ke heading di gyi rehti hai jisse pata chal jata hai ki yeh kis tarah ki data hai."
	},
	{
		"component": "text",
		"value": "Unstructured Data complicated hote hai. Ussey directly yeh nahi pata chalta ki woh data kiske baare me hai."
	},
	{
		"component": "text",
		"value": "Yeh video dekh kar data science ke baare me aur janiye:"
	},
	{
		"component": "youtube",
		"value": "LBzbsclFmHw"
	},
	{
		"component": "text",
		"value": "Ab aapko 30 mins ke liye aapas mei english mei inn topics ke baarein mei baat karni hai.<br>Baat karte karte, aap observe karein, ki aap kitne tech words use kar paa rahe hai."
	},
	{
		"component": "text",
		"value": "Aur agar aapka partner koi aisa tech word bolta hai, jo aapko nahi pata, ya aap generally use nahi kartein. Inn words ko bhi samajhne ki phir koshish karein"
	},
	{
		"component": "text",
		"value": "Iss discussion ko karte hue, aap inn points ke baarein mei bhi soch sakte hai:"
	},
	{
		"component": "text",
		"value": "Aap khud soche ki ‘Uber’ jaisi app me Data Science ka istemal kaise hota hoga?",
		"decoration": {
			"type": "number",
			"value": 1
		}
	},
	{
		"component": "text",
		"value": "Yeh sochiye ki Election Campaign me Data Science ka use kar sakte hai? Agar kar sakte hai toh kaise?<br><br><br>",
		"decoration": {
			"type": "number",
			"value": 2
		}
	},
	{
		"component": "header",
		"variant": 2,
		"value": "Agar aap ko aur thoda samajhna hai, toh yeh dekhiye"
	},
	{
		"component": "text",
		"value": "<b>Tips</b>:"
	},
	{
		"component": "text",
		"value": "Aap subtitles/captions on kar sakte hai, YouTube Video dekhte hue",
		"decoration": {
			"type": "number",
			"value": 1
		}
	},
	{
		"component": "text",
		"value": "Aap speed kam ya jyada kar sakte hai, video ke liye, jisse ki aap acche se dekh payein",
		"decoration": {
			"type": "number",
			"value": 2
		}
	}
]