{
	"introduction_key1": "Look at this example :",
	"introduction_key2": "Example:",
	"introduction_key3": "This program is trying to print numbers whose value is greater than 5.",
	"introduction_key4": "<span style=\"\">Output</span>:<br>[6, 8, 12, 14]",
	"introduction_key5": "Explanation:",
	"introduction_key6": "Filter directly works on arrays in the above example you can see. It will run a <span style=\"\">loop</span> through the entire length of the array (as in the array numbers above)",
	"introduction_key7": "When the filter function receives the first element in the numbers array i.e. 1, it checks the condition<br>is 1&gt;5, that is <span style=\"\">false</span>,So 1 is not added to our new <span style=\"\">variable</span> result. The function then moves on to the next element in the array numbers, which is 2.",
	"introduction_key8": "The filter is running for the second element in the numbers array i.e. 2, it checks the condition<br>is 2&gt;5, that is <span style=\"\">false</span> ,So 1 is not added to our new <span style=\"\">variable</span> result. The function then moves on to the next element in the array numbers, which is 6.",
	"introduction_key9": "The filter is running for the third element in the numbers array i.e. 6, it checks the condition<br>is 6&gt;5, that is <span style=\"\">true</span> ,So 6 is  added to our new <span style=\"\">variable</span> result. The function then moves on to the next element in the array numbers, which is 6.",
	"introduction_key10": "The filter is running for the fourth element in the numbers array i.e. 8, it checks the condition<br>is 8&gt;5, that is <span style=\"\">true</span> ,So 6 is  added to our new <span style=\"\">variable</span> result. The function then moves on to the next element in the array numbers, which is 12.",
	"introduction_key11": "The filter is running for the third element in the numbers array i.e. 12, it checks the condition<br>is 12&gt;5, that is <span style=\"\">true</span> ,So 12 is  added to our new <span style=\"\">variable</span> result. The function then moves on to the next element in the array numbers, which is 14.",
	"introduction_key12": "The filter is running for the third element in the numbers array i.e. 14, it checks the condition<br>is 14&gt;5, that is <span style=\"\">true</span> ,So 14 is  added to our new <span style=\"\">variable</span> result. The function then moves on to the next element in the array numbers ,And there are no other elements so it will stop running the <span style=\"\">loop</span>.",
	"introduction_key13": "As the result filter will print the new list with the elements that have been <span style=\"\">true</span> by the test condition i.e element&gt;5. So, we will get [6, 8, 12, 14].",
	"introduction_key14": "Think that you went to a shopping mall to buy a dress, the shop members show you the best collection of their dresses, but you won’t choose all, you will filter them by the design, color or by measurements.. Sometimes you may select one, sometimes if you like two you will buy two that are totally based on your conditions whether you are selecting them or  not.",
	"introduction_key15": "Note:",
	"introduction_key16": "Filter returns a new array of the original array elements (with no change to the original values). filter will only return elements where they pass some test applied in function."
}