[
	{
		"component": "header",
		"variant": 1,
		"value": "Elections"
	},
	{
		"component": "text",
		"value": "Har 3 months par, Council members elect karne ke liye DISCO elections conduct karwayega."
	},
	{
		"component": "header",
		"variant": 3,
		"value": "Nominations:"
	},
	{
		"component": "text",
		"value": "Elections se 7 din pehle DISCO nominations ke liya call karega through a message jo sabhi ko visible ho. Elections se 4 din pehle ek reminder bhi diya jayega. Wo candidates jo ki election me particular pro<span style=\"\">file</span> ke liye khud ko contest karna chahte hain, wo khud ko nominate kar sakte hain. Ek student maximum 2 posts ke liye khud ko nominate kar sakta hai."
	},
	{
		"component": "text",
		"value": "DISCO ke announcement ke baad hi Nomination liye jayenge. Nominations is <a href=\"https://goo.gl/forms/5MgDqDviAdSvI1s12\">form</a> ke through liye jayenge."
	},
	{
		"component": "header",
		"variant": 3,
		"value": "Voting:"
	},
	{
		"component": "text",
		"value": "Election me har student ek pro<span style=\"\">file</span> ke liye ek hi student ko vote dega. Votes ki counting DISCO karega. Voting anonymous hogi."
	},
	{
		"component": "header",
		"variant": 3,
		"value": "Appointment to the council:"
	},
	{
		"component": "text",
		"value": "Jis candidate ko sabse zyada vote mile hain, wahi us pro<span style=\"\">file</span> ke liye select hoga."
	},
	{
		"component": "header",
		"variant": 3,
		"value": "Appointment of GenSec:"
	},
	{
		"component": "text",
		"value": "GenSec council ke members me se chuna jayega. Saare council members elect ho jaane ke baad DISCO elected council members me se GenSec ki post ke liye nominations mangega."
	},
	{
		"component": "text",
		"value": "GenSec ke liye DISCO fir se voting karwayega. General body ke sabhi members apni pasand ke member ko GenSec chunne ke liye vote karenge."
	},
	{
		"component": "text",
		"value": "GenSec ke appointment ke liye sabse zyada votes paane wale 2 candidates ka Board of Governors interview lenge."
	}
]