[
	{
		"component": "header",
		"variant": 1,
		"value": "Section V - Rules &amp; Regulations"
	},
	{
		"component": "text",
		"value": "NavGurukul ek drug and alcohol free campus hai. Hum moral policing me vishwaas nahi rakhte, lekin course me enrolled hone ke dauraan drinking students ko distract karta hai, learning se door le jata hai aur baakiyon ke liye bhi uncomfortable situation paida kar deta hai. Isliye, hum students ka course ke duration me on ya off campus alcohol consume karna approve nahi karte.   ",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Disciplinary committee ke dwara banaye gaye schedule ka sabhi students palan karenge.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "header",
		"variant": 4,
		"value": "Koi bhi student aisi kisi bhi tarah ki activity me involve nahi hoga jisse NavGurukul ki reputation ko nuksaan ho. Prohibited activities include but are not limited to:"
	},
	{
		"component": "text",
		"value": "Kisi bhi process ya activity me alcohol ka use",
		"decoration": {
			"type": "number",
			"value": 1
		}
	},
	{
		"component": "text",
		"value": "Koi substance ya object kisi individual ya group par fekna ya daalna ",
		"decoration": {
			"type": "number",
			"value": 2
		}
	},
	{
		"component": "text",
		"value": "Verbal abuse ya physical harm ki dhamki dena",
		"decoration": {
			"type": "number",
			"value": 3
		}
	},
	{
		"component": "text",
		"value": "Kisi person ko zabardasti uski iccha ke bina kuch khilana ya pilana",
		"decoration": {
			"type": "number",
			"value": 4
		}
	},
	{
		"component": "text",
		"value": "Khud  ya kisi aur ke sath uski ki iccha ke bina kuch potentially harmful karna",
		"decoration": {
			"type": "number",
			"value": 5
		}
	},
	{
		"component": "text",
		"value": "Kisi bhi tarah ka molestation, sexual abuse ya stalking karna",
		"decoration": {
			"type": "number",
			"value": 6
		}
	},
	{
		"component": "text",
		"value": "Kisi bhi tarah ke misconduct ko sabhi community members seedha DISCO ko report karein",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Off-campus Activities: NavGurukul me, kisi bhi student ki learning bahut had tak depend karti hai peer learning par aur ye sirf tabhi possible hai jab learning group ke sabhi members campus me available hon. Ye achieve karne ke liye zaroori hai ki sabhi members study hours me bhi campus me available hon. Isliye hum DISCO ko encourage karte hain ki off campus leisure activities specific time ke liye hi rakhe. Ye community members ke saftey aur security ke liye bhi zaroori hai.",
		"decoration": {
			"type": "bullet"
		}
	}
]