{
	"Delhi_key1": "Delhi Campus with Delhi Skill &amp; Entrepreneurship University (DSEU): For 100 Girls &amp; Trans women",
	"Delhi_key2": "<b>20-month residential training program</b> in the <b>main campus of DSEU in Sector-9 Dwarka, Delhi</b>. You need to stay on campus and complete the course. It is an all-female campus including team members. ",
	"Delhi_key3": "Fully funded: We will take care of your <b>fooding, lodging, internet, and laptop</b>. You don’t need to pay anything for this. You will be required to take care of your personal &amp; medical expenses and travels. ",
	"Delhi_key4": "We provide <b>guaranteed jobs</b> post completion of the program, starting from <b>Rs. 20000/month or more</b> in SMEs &amp; Startups. ",
	"Delhi_key5": "In one year, we will provide you training on <b>Software Engineering, English Communication, Personality Development and 6month of industrial training</b>. Even if you haven’t seen or operated a laptop, it is completely fine. We will assess your current skills &amp; knowledge and start your academics from the point you need to learn from.",
	"Delhi_key6": "You will be provided <b>UGC granted Certificate by DSEU University a certificate on Advance Diploma in Software Programming</b>.  ",
	"Delhi_key7": "Our campuses are a community space. You will be required to support the campus team in <b>running & managing the campus; including cooking & cleaning</b>. Once you join, it is going to be your campus and we want all our students to participate and lead in managing various aspects of the campus operations. It will help you get a first-hand experience of becoming a leader. ",
	"Delhi_key8": "Our campuses are fully vegetarian and we provide nutritious meals including milk to make sure your health is well taken care of. You will <b>not be allowed</b> to cook or bring cooked non-vegetarian food from outside to campus. ",
	"Delhi_key9": "You will not be allowed to join our program if you are <b>applying/preparing for Govt, Jobs, working/studying full time</b>. ",
	"Delhi_key10": "Please read the following PDF &amp; poster (Google Drive links):",
	"Delhi_key11": "<a href=\"https://docs.google.com/presentation/d/1DjLzHvCAB0IHhKnphqCQbTJ4thp1CxkG/edit?usp=sharing&ouid=113053930305549942424&rtpof=true&sd=true\">DSEU Info Session Deck</a>",
	"Delhi_key12": "<a href=\"https://drive.google.com/file/d/1RJQhRqAkIfe3odMTUpmEg-iOeCeoLRTK/view?usp=sharing\">Admissions Poster - Delhi Govt.</a>",
	"Delhi_key13": "More Links:",
	"Delhi_key14": "<a href=\"https://dseu.ac.in/adspwithnavgurukul/\">DSEU Website</a>",
	"Delhi_key15": "Register before attempting the first test: <a href=\"https://admission.dseu.ac.in/AdmForms/adsp-navgurukul\">DSEU Admissions Form</a>"
}