{
    "Delhi_key1": "दिल्ली कौशल के साथ दिल्ली परिसर &amp; उद्यमिता विश्वविद्यालय (डीएसईयू): 100 लड़कियों के लिए &amp; ट्रांस महिला",
    "Delhi_key2": "<b>सेक्टर-9 द्वारका, दिल्ली में DSEU</b> के <b>मुख्य परिसर में 20 महीने का आवासीय प्रशिक्षण कार्यक्रम</b> । आपको परिसर में रहने और पाठ्यक्रम पूरा करने की आवश्यकता है। यह टीम के सदस्यों सहित एक अखिल महिला परिसर है।",
    "Delhi_key3": "पूरी तरह से वित्त पोषित: हम आपके <b>भोजन, आवास, इंटरनेट और लैपटॉप का</b> ध्यान रखेंगे। इसके लिए आपको कुछ भी भुगतान करने की आवश्यकता नहीं है। आपको अपने व्यक्तिगत और चिकित्सा खर्चों और यात्राओं का ध्यान रखना होगा।",
    "Delhi_key4": "हम कार्यक्रम के पूरा होने के बाद, <b>रुपये</b> <b>से शुरू होने वाली गारंटीकृत नौकरी</b> प्रदान करते हैं। एसएमई और स्टार्टअप्स में <b>20000/माह या अधिक।</b>",
    "Delhi_key5": "एक वर्ष में, हम आपको <b>सॉफ्टवेयर इंजीनियरिंग, अंग्रेजी संचार, व्यक्तित्व विकास और 6 महीने के औद्योगिक प्रशिक्षण</b> पर प्रशिक्षण प्रदान करेंगे। यहां तक कि अगर आपने लैपटॉप नहीं देखा या संचालित नहीं किया है, तो भी यह पूरी तरह से ठीक है। हम आपके वर्तमान कौशल और ज्ञान का आकलन करेंगे और आपके शिक्षाविदों को उस बिंदु से शुरू करेंगे जहां से आपको सीखने की जरूरत है।",
    "Delhi_key6": "<b>आपको डीएसईयू विश्वविद्यालय द्वारा यूजीसी द्वारा प्रदान किया गया सर्टिफिकेट सॉफ्टवेयर प्रोग्रामिंग में एडवांस डिप्लोमा पर एक सर्टिफिकेट</b> प्रदान किया जाएगा।",
    "Delhi_key7": "हमारे परिसर एक सामुदायिक स्थान हैं। <b>कैंपस को चलाने और प्रबंधित करने</b> में आपको कैंपस टीम का समर्थन करना होगा; <b>खाना पकाने और सफाई सहित</b> । एक बार जब आप इसमें शामिल हो जाते हैं, तो यह आपका परिसर होगा और हम चाहते हैं कि हमारे सभी छात्र परिसर के संचालन के विभिन्न पहलुओं के प्रबंधन में भाग लें और नेतृत्व करें। यह आपको एक नेता बनने का प्रत्यक्ष अनुभव प्राप्त करने में मदद करेगा।",
    "Delhi_key8": "हमारे परिसर पूरी तरह से शाकाहारी हैं और हम आपके स्वास्थ्य की अच्छी देखभाल सुनिश्चित करने के लिए दूध सहित पौष्टिक भोजन प्रदान करते हैं। आपको परिसर में बाहर से पका हुआ मांसाहारी भोजन पकाने या लाने <b>की अनुमति नहीं होगी।</b>",
    "Delhi_key9": "आपको हमारे कार्यक्रम में शामिल होने की अनुमति नहीं दी जाएगी यदि आप <b>सरकारी नौकरी के लिए आवेदन/तैयारी कर रहे हैं, काम कर रहे हैं/पूर्णकालिक अध्ययन कर रहे हैं</b> ।",
    "Delhi_key10": "कृपया निम्नलिखित पीडीएफ़ पढ़ें &amp; पोस्टर (गूगल ड्राइव लिंक):",
    "Delhi_key11": "<a href=\"https://docs.google.com/presentation/d/1DjLzHvCAB0IHhKnphqCQbTJ4thp1CxkG/edit?usp=sharing&ouid=113053930305549942424&rtpof=true&sd=true\">DSEU जानकारी सत्र डेक</a>",
    "Delhi_key12": "<a href=\"https://drive.google.com/file/d/1RJQhRqAkIfe3odMTUpmEg-iOeCeoLRTK/view?usp=sharing\">प्रवेश पोस्टर - दिल्ली सरकार।</a>",
    "Delhi_key13": "अधिक लिंक:",
    "Delhi_key14": "<a href=\"https://dseu.ac.in/adspwithnavgurukul/\">डीएसईयू वेबसाइट</a>",
    "Delhi_key15": "पहली परीक्षा का प्रयास करने से पहले पंजीकरण करें: <a href=\"https://admission.dseu.ac.in/AdmForms/adsp-navgurukul\">डीएसईयू प्रवेश फॉर्म</a>"
}