{
	"Present_Perfect_Tense_key1": "Link\n",
	"Present_Perfect_Tense_key2": "Present Perfect Tense Examples\n",
	"Present_Perfect_Tense_key3": "Present perfect tense combines the present tense and the perfect aspect used to express an event that happened in the past that has present consequences. this tense is used to show a link between the present and past and is commonly used in everyday conversations, in the news, on the radio, and when writing letters.\n",
	"Present_Perfect_Tense_key4": "Using present perfect tense\n",
	"Present_Perfect_Tense_key5": "To create the present perfect tense of any verb, you will combine the present tense of the verb \"to have\" plus the past participle of the Main verb of the sentence. the past participle of a regular verb is the base word plus -ed. you Can find a list of the past participle of irregular verbs here.\n",
	"Present_Perfect_Tense_key6": "one example of this tense is: \"have jumped.\" \"have\" is the present tense and \"jumped\" is the past participle. some other forms of this tense ARE:\n",
	"Present_Perfect_Tense_key7": "Has lived: she has lived here all her life.\n",
	"Present_Perfect_Tense_key8": "Have written: they have written three letters already.\n",
	"Present_Perfect_Tense_key9": "Have worked: I have worked here since I graduated school.\n",
	"Present_Perfect_Tense_key10": "Has done: He has finished his homework.\n",
	"Present_Perfect_Tense_key11": "Have been: We have been to Canada. \n",
	"Present_Perfect_Tense_key12": "Has forgotten: she has forgotten her folder.\n\n\n\n",
	"Present_Perfect_Tense_key13": "There ARE many different situations where the present perfect tense Can be used. It Can be used in the following ways:\n",
	"Present_Perfect_Tense_key14": "To describe an ACTION that is being repeated between the past and present. example: We have gone to the beach many times.\n",
	"Present_Perfect_Tense_key15": "To describe an ACTION that started in the past and is still continuing in the future. example: I have lived in the united states since 1990.\n",
	"Present_Perfect_Tense_key16": "To describe an ACTION that has not yet been finished. example: It has rained a Lot this month.\n",
	"Present_Perfect_Tense_key17": "To describe an ACTION that was completed in the recent past. example: I have just finished my internship at the museum.\n",
	"Present_Perfect_Tense_key18": "To describe an ACTION when time was not an important aspect. example: she has lost her wedding ring.\n\n\n\n",
	"Present_Perfect_Tense_key19": "There ARE times when you cannot use the present perfect tense. for example, you cannot use it with specific expressions of time that have already finished, such as last year, that month, when I was a baby, etc.\n",
	"Present_Perfect_Tense_key20": "Examples of present perfect tense\n",
	"Present_Perfect_Tense_key21": "Present perfect tense Can be used with expressions that ARE unspecific in time:\n",
	"Present_Perfect_Tense_key22": "I have lost my purse.\n",
	"Present_Perfect_Tense_key23": "We have seen this movie already.\n",
	"Present_Perfect_Tense_key24": "He has broken his leg.\n",
	"Present_Perfect_Tense_key25": "There has been an accident.\n\n\n\n",
	"Present_Perfect_Tense_key26": "Some examples of present perfect tense used to express an unfinished period of time ARE:\n",
	"Present_Perfect_Tense_key27": "We haven't seen her today.\n",
	"Present_Perfect_Tense_key28": "They have been to the mall twice this month.\n",
	"Present_Perfect_Tense_key29": "She has watched that show three times this week.\n\n\n\n",
	"Present_Perfect_Tense_key30": "Examples of using present perfect in talking about events that happened in the recent past but the effect of the recent event is still felt in the present include:\n",
	"Present_Perfect_Tense_key31": "The children have made a mess in the kitchen.\n",
	"Present_Perfect_Tense_key32": "He has started a new Job.\n",
	"Present_Perfect_Tense_key33": "She has finished her chores.\n\n\n\n",
	"Present_Perfect_Tense_key34": "Present perfect tense Can be used in questions as well. here ARE some examples:\n",
	"Present_Perfect_Tense_key35": "Where have I left my sandals?\n",
	"Present_Perfect_Tense_key36": "Have you visited England?\n",
	"Present_Perfect_Tense_key37": "Has she met John?\n\n\n\n",
	"Present_Perfect_Tense_key38": "Other combinations of words\n",
	"Present_Perfect_Tense_key39": "In addition, you Can use time-related adverbs in the present perfect tense, as Long as they don't refer to a time which is finished. these words include: \"already,\" \"just\" and \"yet.\" some examples of how these words ARE used ARE:\n",
	"Present_Perfect_Tense_key40": "The book came out yesterday, but I have already Read it. (already is used to express that something has happened sooner than expected.)\n",
	"Present_Perfect_Tense_key41": "She has just left the building. (just is used to convey that the event happened a short time ago.)\n",
	"Present_Perfect_Tense_key42": "He hasn't finished it yet. (yet is used in negative sentences to mean that something is expected to happen.\n\n\n",
	"Present_Perfect_Tense_key43": "Fill in the gaps with the right forms of the verbs in brackets to complete the following English sentences in Present Perfect Tense.\n",
	"Present_Perfect_Tense_key44": "They_____London this month.(leave)\n\n\n",
	"Present_Perfect_Tense_key45": "He_____ a lot of English papers.(bring)\n\n\n",
	"Present_Perfect_Tense_key46": "She____me about it.(tell)\n\n\n",
	"Present_Perfect_Tense_key47": "I_____a long letter from father this week.(get)\n\n\n\n",
	"Present_Perfect_Tense_key48": "She (just)_______; she will speak to you in a minute.(come)\n\n\n\n",
	"Present_Perfect_Tense_key49": "I______to Radio City.(be)\n\n",
	"Present_Perfect_Tense_key50": "I think the director______the town.(leave)\n\n\n\n",
	"Present_Perfect_Tense_key51": "I_____my office.(paint)\n"
}