[
	{
		"component": "header",
		"variant": 1,
		"value": "Importing Modules"
	},
	{
		"component": "text",
		"value": "All <span style=\"\">Python</span> programs can call a basic set of functions called built-in functions, including the print(), <span style=\"\">input</span>(), and len() functions you’ve seen before. <span style=\"\">Python</span> also comes with a set of modules called the standard library. Each module is a <span style=\"\">Python</span> program that contains a related group of functions that can be embedded in your programs. For example, the math module has mathematics-related functions, the random module has random number–related functions, and so on."
	},
	{
		"component": "text",
		"value": "Before you can use the functions in a module, you must import the module with an import <span style=\"\">statement</span>. In <span style=\"\">code</span>, an import <span style=\"\">statement</span> consists of the following:"
	},
	{
		"component": "text",
		"value": "The import keyword",
		"decoration": {
			"type": "number",
			"value": 1
		}
	},
	{
		"component": "text",
		"value": "The name of the module",
		"decoration": {
			"type": "number",
			"value": 2
		}
	},
	{
		"component": "text",
		"value": "Optionally, more module names, as long as they are separated by commas",
		"decoration": {
			"type": "number",
			"value": 3
		}
	},
	{
		"component": "text",
		"value": "Once you import a module, you can use all the cool functions of that module. Let’s give it a try with the random module, which will give us access to the random.randint() function."
	},
	{
		"component": "text",
		"value": "Enter this <span style=\"\">code</span> into the <span style=\"\">file</span> <span style=\"\">editor</span>, and <span style=\"\">save</span> it as printRandom.py:"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": "import random<br>for i in range(5):<br>&emsp;print(random.randint(1, 10))"
	},
	{
		"component": "text",
		"value": "When you run this program, the <span style=\"\">output</span> will look something like this:"
	},
	{
		"component": "text",
		"value": "4<br>1<br>8<br>4<br>1<br>The random.randint() function call evaluates to a random <span style=\"\">integer</span> value between the two <span style=\"\">integers</span> that you pass it. Since randint() is in the random module, you must first type random. in front of the function name to tell <span style=\"\">Python</span> to look for this function inside the random module."
	},
	{
		"component": "text",
		"value": "Here’s an example of an import <span style=\"\">statement</span> that imports four different modules:"
	},
	{
		"component": "text",
		"value": "import random, sys, os, math<br>Now we can use any of the functions in these four modules. We’ll learn more about them later in the book."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "from import <span style=\"\">Statements</span>"
	},
	{
		"component": "text",
		"value": "An alternative form of the import statement is composed of the from keyword, followed by the module name, the import keyword, and a star; for example, from random import *.<br>With this form of import statement, calls to functions in random will not need the random. prefix. However, using the full name makes for more readable code, so it is better to use the normal form of the import statement."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Ending a Program Early with sys.exit()"
	},
	{
		"component": "text",
		"value": "The last flow control concept to cover is how to terminate the program. This always happens if the program execution reaches the bottom of the instructions. However, you can cause the program to terminate, or exit, by calling the sys.exit() function. Since this function is in the sys module, you have to import sys before your program can use it."
	},
	{
		"component": "text",
		"value": "Open a new <span style=\"\">file</span> <span style=\"\">editor</span> window and enter the following <span style=\"\">code</span>, saving it as exitExample.py:"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": "import sys<br><br>while True:<br>&emsp;print('Type exit to exit.')<br>&emsp;response = input()<br>&emsp;if response == 'exit':<br>&emsp;&emsp;sys.exit()<br>&emsp;print('You typed ' + response + '.')"
	},
	{
		"component": "text",
		"value": "Run this program in IDLE. This program has an infinite <span style=\"\">loop</span> with no break <span style=\"\">statement</span> inside. The only way this program will end is if the user enters exit, causing sys.exit() to be called. When response is equal to exit, the program ends. Since the response <span style=\"\">variable</span> is set by the <span style=\"\">input</span>() function, the user must enter exit in order to stop the program."
	}
]