[
	{
		"component": "header",
		"variant": 1,
		"value": "General Body Meeting"
	},
	{
		"component": "text",
		"value": "All the students in NavGurukul comprise of the general body. The general body will meet every month to review the performance of the Council. In this meeting, the different committees under the Council will get a chance to share with the general body their experience of the past one month in a Good Bad Ugly (GBU) format. This GBU report will also be shared with the Center."
	},
	{
		"component": "text",
		"value": "The following can serve as a guideline to prepare a report in the GBU format. "
	},
	{
		"component": "text",
		"value": "<b>The Good:</b> "
	},
	{
		"component": "text",
		"value": "What were the positive changes that were brought about on campus? ",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "What were the challenges that you overcame during this period as members of the Council? ",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "<b>The Bad:</b>"
	},
	{
		"component": "text",
		"value": "The things that went wrong but you have learnt from that and can be taken care of with some efforts.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "<b>The Ugly:</b>"
	},
	{
		"component": "text",
		"value": "The things that went terribly wrong. Includes high priority things that need attention and need to be quickly resolved.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "The reason for this exercise is to give space to the council members to review their own work and share it with all members of the community. This will help them acknowledge which areas need more effect and avoid mistakes from the past. "
	},
	{
		"component": "text",
		"value": "The general body members can voice their appreciation or disappointment with the Council in this meeting. They are expected to give constructive feedback to the Council on how they can manage things better. "
	},
	{
		"component": "header",
		"variant": 3,
		"value": "The Process"
	}
]