{
	"working-with-excel-spreadsheets_key1": "Working with Excel Spreadsheets",
	"working-with-excel-spreadsheets_key2": "Excel is a popular and powerful spreadsheet <span style=\"\">application</span> for Windows. The openpyxl module allows your <span style=\"\">Python</span> programs to read and modify Excel spreadsheet <span style=\"\">files</span>. For example, you might have the boring task of copying certain data from one spreadsheet and pasting it into another one. Or you might have to go through thousands of rows and pick out just a handful of them to make small edits based on some criteria. Or you might have to look through hundreds of spreadsheets of department budgets, searching for any that are in the red. These are exactly the sort of boring, mindless spreadsheet tasks that <span style=\"\">Python</span> can do for you.",
	"working-with-excel-spreadsheets_key3": "Although Excel is proprietary software from Microsoft, there are free alternatives that run on Windows, OS X, and Linux. Both LibreOffice Calc and OpenOffice Calc work with Excel’s .xlsx <span style=\"\">file</span> format for spreadsheets, which means the openpyxl module can work on spreadsheets from these <span style=\"\">applications</span> as well. You can download the software from <span><a href=\"https://www.libreoffice.org/ \">https://www.libreoffice.org/ </a></span> and <span><a href=\"http://www.openoffice.org/\">http://www.openoffice.org/</a></span>, respectively. Even if you already have Excel installed on your computer, you may find these programs easier to use. The screenshots in this chapter, however, are all from Excel 2010 on Windows 7.",
	"working-with-excel-spreadsheets_key4": "Excel Documents",
	"working-with-excel-spreadsheets_key5": "First, let’s go over some basic definitions: An Excel spreadsheet document is called a workbook. A single workbook is <span style=\"\">save</span>d in a <span style=\"\">file</span> with the .xlsx extension. Each workbook can contain multiple sheets (also called worksheets). The sheet the user is currently viewing (or last viewed before closing Excel) is called the active sheet.",
	"working-with-excel-spreadsheets_key6": "Each sheet has columns (addressed by letters starting at A) and rows (addressed by numbers starting at 1). A box at a particular column and row is called a cell. Each cell can contain a number or text value. The grid of cells with data makes up a sheet."
}