{
	"spreadsheet-cell-inverter_key1": "Spreadsheet Cell Inverter",
	"spreadsheet-cell-inverter_key2": "Write a program to invert the row and column of the cells in the spreadsheet. For example, the value at row 5, column 3 will be at row 3, column 5 (and vice versa). This should be done for all cells in the spreadsheet. For example, the “before” and “after” spreadsheets would look something like Figure 12-13.",
	"spreadsheet-cell-inverter_key3": "Figure 12-13. The spreadsheet before (top) and after (bottom) inversion",
	"spreadsheet-cell-inverter_key4": "You can write this program by using nested for <span style=\"\">loops</span> to read in the spreadsheet’s data into a list of lists data structure. This data structure could have sheetData[x][y] for the cell at column x and row y. Then, when writing out the new spreadsheet, use sheetData[y][x] for the cell at column x and row y.",
	"spreadsheet-cell-inverter_key5": "Text <span style=\"\">Files</span> to Spreadsheet",
	"spreadsheet-cell-inverter_key6": "Write a program to read in the contents of several text <span style=\"\">files</span> (you can make the text <span style=\"\">files</span> yourself) and insert those contents into a spreadsheet, with one line of text per row. The lines of the first text <span style=\"\">file</span> will be in the cells of column A, the lines of the second text <span style=\"\">file</span> will be in the cells of column B, and so on.",
	"spreadsheet-cell-inverter_key7": "Use the readlines() <span style=\"\">File</span> object method to return a list of <span style=\"\">strings</span>, one <span style=\"\">string</span> per line in the <span style=\"\">file</span>. For the first <span style=\"\">file</span>, <span style=\"\">output</span> the first line to column 1, row 1. The second line should be written to column 1, row 2, and so on. The next <span style=\"\">file</span> that is read with readlines() will be written to column 2, the next <span style=\"\">file</span> to column 3, and so on.",
	"spreadsheet-cell-inverter_key8": "Spreadsheet to Text <span style=\"\">Files</span>",
	"spreadsheet-cell-inverter_key9": "Write a program that performs the tasks of the previous program in reverse order: The program should open a spreadsheet and write the cells of column A into one text <span style=\"\">file</span>, the cells of column B into another text <span style=\"\">file</span>, and so on."
}