{
	"encryption_key1": "name: Encryption\n",
	"encryption_key2": "## ENCRYPTION KYA HAI ?\n\n\n",
	"encryption_key3": "Encryption ek tarika hai jisse aap apne data ki safety ko increase karte hai.\nAgar hum simple language me baat kare to ye ek aisa tarika jisme hamara data \nMachinary language me `save` hota jisse sirf wahi device ya software samjh sakta hai \nJiska use karke humne apna data `save` kiya hai.Dusre device ko samjhne ya access karne ke liye. Encrypt data ka `key` use karna padega jiske baare me hum aage padhenge.\n",
	"encryption_key4": "## Thoda Aur Samjhte hai. \n\n\n",
	"encryption_key5": "Jaise mera kisi social networking ka user name hai Satyam chauhan , to ab vo social \nNetworking software mere user name ko apni machinary language me `save` karega .\nMaan lijiye usne mere username ke letters ko ek letter aage samjh kar `save` kiya jaise usne \n(s ko t, a ko b, t ko u  maanta hai ) to software ki language me mera naam Tbuzbn dibvibo\n`Save` hoga jo sirf wahi software hi samjh sakta hai.\nIsi parkaar sabhi software ka data `save` karne ka tarika alag alag hota hai. .\n",
	"encryption_key6": "## ENCRYPT\n\n\n",
	"encryption_key7": "Simple language ko machinary language me convert karna hi encrypt kahlata hai .\nJais ki hamne upar dekha ki software ne Satyam chauhan ko Tbuzbn dibvibo ki form\nConvert kar diya hai ise hi encrypt kahte hai. Is whole process ko encryption kahte hai. \n",
	"encryption_key8": "### Encryption ko sahi se samjhne ke liye in videos ko dekhe aur samjhe ki encryption kya hota hai.\n\n\n",
	"encryption_key9": "## `KEY`\n\n\n",
	"encryption_key10": "`Key` kya hota hai ,`key` ek tarika hota hai data encrypt karne ka jaise hamne upar bataya tha\nKi software hamare data ko apne machinary language  me convert karne ke liye ek tarika istmaal karta hai jaise (S ko T , a ko b , t ko u ………)samjh kar `save` karta hai isi tarike ko `key` kahte hai.\n",
	"encryption_key11": "### DECRYPTION\n\n\n\n",
	"encryption_key12": "Decryption kya hota , kisi bhi machinary language ko simple language me convert karna hi decrypt kahlata hai ,kis bhi machinary language ko decrypt karne ke liye `key` ki jarurat hoti hai \nMatlab vo tarika jiske use karke data ko encrypt kiya gya tha .\n",
	"encryption_key13": "### Ab aapko 30 mins ke liye aapas mei `english` mei inn topics ke baarein mei baat karni hai.\n\n",
	"encryption_key14": "Baat karte karte, aap observe karein, ki aap kitne tech words use kar paa rahe hai.\n",
	"encryption_key15": "Aur agar aapka partner koi aisa tech word bolta hai, jo aapko nahi pata, ya aap generally use nahi kartein. Inn words ko bhi samajhne ki phir koshish karein.\n",
	"encryption_key16": "Iss discussion ko karte hue, aap inn points ke baarein mei bhi soch sakte hai:\n",
	"encryption_key17": "1.Encryption kya hota hai ?<br>\n2.Encrypt kya hai ?<br>\n3.`Key` kya hota hai ?<br>\n4.Decryption karne kiski jarurat hoti hai ?<br>\n5.Kya Encryption achcha tarika hai data ko safe karne ke liye agar hai to kyu.?<br>\n6.Yadi aapko apne friend ko encryption real life example deke samjhana ho to aap kya\nExample denge?<br>\n",
	"encryption_key18": "**Tips**:\n1 - Aap subtitles/captions on kar sakte hai, `YouTube` Video dekhte hue\n2 - Aap speed kam ya jyada kar sakte hai, video ke liye, jisse ki aap acche se dekh payein\n"
}