{
	"blog_site_key1": "Intro",
	"blog_site_key2": "Iss project mei hum <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">Medium</span> jaisi ek blog website ka basic version banana sikhenge.",
	"blog_site_key3": "NOTE",
	"blog_site_key4": "Iss project ki suruvat karne se pehele aap ko blog website ko visit karke samjho ki vo kaise kaam karti hain.\nye kuch examples hain….\n<a href=\"https://medium.com/\">MEDIUM</a>",
	"blog_site_key5": "Aur kuch app bhi dhondoo hum kitni help kare..",
	"blog_site_key6": "Iss project ko shuru karne se phele ye cheeze dhyan deni jaruri hain.",
	"blog_site_key7": "Ye project hum JavaScript ka use karke banayenge issleye humne enough JavaScript aani jaruri hain.",
	"blog_site_key8": "Iss project main hum database ka aache tarike se use karna bhi sikhenge.",
	"blog_site_key9": "Aur front-end ke leye Html, Css, Bootstrap jaisi languages ka isstemal karnge.",
	"blog_site_key10": "Aur Database ke leye hum MySql use karnege.<br><br>",
	"blog_site_key11": "Step 1",
	"blog_site_key12": "Create da<span style=\"\">tab</span>ase",
	"blog_site_key13": "Phele apne project ke da<span style=\"\">tab</span>ase structure ke bare main group main disscuss karein.<br>aur apne da<span style=\"\">tab</span>ase ko banane ke leye ek script lekhe.<br>Iss da<span style=\"\">tab</span>ase ka hum apne projet main use karnge.",
	"blog_site_key14": "Create endpoints",
	"blog_site_key15": "Kuch jaruri endpoints aapko apne group members ke sath disscuss karke banane hain.<br>Example :",
	"blog_site_key16": "signup/",
	"blog_site_key17": "login/",
	"blog_site_key18": "addBlog/<br><br>",
	"blog_site_key19": "Aur kuch aap bhi dimag lagaoo ki aur kitne endpoints banane honge.",
	"blog_site_key20": "Aap apne sare endpoints ko database ke sath link karoge\naur login logout main aapko kuch authentication lagana hain <a href=\"https://jwt.io/\">JWT</a> ka use karke.\njaise ke user tabhi lgin kar sakta hain jab uske pass valid access token hoga.\nAur database ke query lekhne ke leye <a href=\"https://knexjs.org/\">Knex</a> ka use kare",
	"blog_site_key21": "Step 2",
	"blog_site_key22": "Iss step main hum front end design karnege.<br>aap apne ichaa anusar isko design kar sakte ho.<br>par aapko sirf Html, CSS aur Bootstrap use karne ke anumati hain.",
	"blog_site_key23": "Hai na useful? :)",
	"blog_site_key24": "Happy Coding!"
}