[
	{
		"component": "header",
		"variant": 1,
		"value": "Adjusting Rows and Columns"
	},
	{
		"component": "text",
		"value": "In Excel, adjusting the sizes of rows and columns is as easy as clicking and dragging the edges of a row or column header. But if you need to set a row or column’s size based on its cells’ contents or if you want to set sizes in a large number of spreadsheet <span style=\"\">files</span>, it will be much quicker to write a <span style=\"\">Python</span> program to do it."
	},
	{
		"component": "text",
		"value": "Rows and columns can also be hidden entirely from view. Or they can be “frozen” in place so that they are always visible on the screen and appear on every page when the spreadsheet is printed (which is handy for headers)."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Setting Row Height and Column Width"
	},
	{
		"component": "text",
		"value": "Worksheet objects have row<i>dimensions and column</i>dimensions attributes that control row heights and column widths. Enter this into the interactive <span style=\"\">shell</span>:"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": ">>> import openpyxl<br>>>> wb = openpyxl.Workbook()<br>>>> sheet = wb.active<br>>>> sheet['A1'] = 'Tall row'<br>>>> sheet['B2'] = 'Wide column'<br>>>> sheet.row_dimensions[1].height = 70<br>>>> sheet.column_dimensions['B'].width = 20<br>>>> wb.save('dimensions.xlsx')"
	},
	{
		"component": "text",
		"value": "A sheet’s row<i>dimensions and column</i>dimensions are dictionary-like values; row<i>dimensions contains RowDimension objects and column</i>dimensions contains ColumnDimension objects. In row<i>dimensions, you can access one of the objects using the number of the row (in this case, 1 or 2). In column</i>dimensions, you can access one of the objects using the letter of the column (in this case, A or B)."
	},
	{
		"component": "text",
		"value": "The dimensions.xlsx spreadsheet looks like Figure 12-6."
	},
	{
		"component": "text",
		"value": "Figure 12-6. Row 1 and column B set to larger heights and widths"
	},
	{
		"component": "text",
		"value": "Once you have the RowDimension object, you can set its height. Once you have the ColumnDimension object, you can set its width. The row height can be set to an <span style=\"\">integer</span> or <span style=\"\">float</span> value between 0 and 409. This value represents the height measured in points, where one point equals 1/72 of an inch. The default row height is 12.75. The column width can be set to an <span style=\"\">integer</span> or <span style=\"\">float</span> value between 0 and 255. This value represents the number of characters at the default font size (11 point) that can be displayed in the cell. The default column width is 8.43 characters. Columns with widths of 0 or rows with heights of 0 are hidden from the user."
	}
]