[
	{
		"component": "header",
		"variant": 1,
		"value": "Charts"
	},
	{
		"component": "text",
		"value": "OpenPyXL supports creating bar, line, scatter, and pie charts using the data in a sheet’s cells. To make a chart, you need to do the following:"
	},
	{
		"component": "text",
		"value": "Create a Reference object from a rectangular selection of cells."
	},
	{
		"component": "text",
		"value": "Create a Series object by passing in the Reference object."
	},
	{
		"component": "text",
		"value": "Create a Chart object."
	},
	{
		"component": "text",
		"value": "Append the Series object to the Chart object."
	},
	{
		"component": "text",
		"value": "Add the Chart object to the Worksheet object, optionally specifying which cell the top left corner of the chart should be positioned.."
	},
	{
		"component": "text",
		"value": "The Reference object requires some explaining. Reference objects are created by calling the openpyxl.chart.Reference() function and passing three arguments:"
	},
	{
		"component": "text",
		"value": "The Worksheet object containing your chart data."
	},
	{
		"component": "text",
		"value": "A tuple of two <span style=\"\">integers</span>, representing the top-left cell of the rectangular selection of cells containing your chart data: The first <span style=\"\">integer</span> in the tuple is the row, and the second is the column. Note that 1 is the first row, not 0."
	},
	{
		"component": "text",
		"value": "A tuple of two <span style=\"\">integers</span>, representing the bottom-right cell of the rectangular selection of cells containing your chart data: The first <span style=\"\">integer</span> in the tuple is the row, and the second is the column."
	},
	{
		"component": "text",
		"value": "Figure 12-9 shows some sample coordinate arguments."
	},
	{
		"component": "text",
		"value": "Figure 12-9. From left to right: (1, 1), (10, 1); (3, 2), (6, 4); (5, 3), (5, 3)"
	},
	{
		"component": "text",
		"value": "Enter this interactive <span style=\"\">shell</span> example to create a bar chart and add it to the spreadsheet:"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": ">>> import openpyxl<br>>>> wb = openpyxl.Workbook()<br>>>> sheet = wb.active<br>>>> for i in range(1, 11):&emsp;&emsp; # create some data in column A<br>&emsp;&emsp;sheet['A' + str(i)] = i<br><br>>>> refObj = openpyxl.chart.Reference(sheet, min_col=1, min_row=1, max_col=1, max_row=10)<br><br>>>> seriesObj = openpyxl.chart.Series(refObj, title='First series')<br><br>>>> chartObj = openpyxl.chart.BarChart()<br>>>> chartObj.title = 'My Chart'<br>>>> chartObj.append(seriesObj)<br>>>> sheet.add_chart(chartObj, 'C5')<br>>>> wb.save('sampleChart.xlsx')<br>This produces a spreadsheet that looks like Figure 12-10."
	},
	{
		"component": "text",
		"value": "Figure 12-10. A spreadsheet with a chart added"
	},
	{
		"component": "text",
		"value": "We’ve created a bar chart by calling openpyxl.chart.BarChart(). You can also create line charts, scatter charts, and pie charts by calling openpyxl.chart.LineChart(), openpyxl.chart.ScatterChart(), and openpyxl.chart.PieChart()."
	},
	{
		"component": "text",
		"value": "Unfortunately, in the current version of OpenPyXL (2.3.3), the load_workbook() function does not load charts in Excel <span style=\"\">files</span>. Even if the Excel <span style=\"\">file</span> has charts, the loaded Workbook object will not include them. If you load a Workbook object and immediately <span style=\"\">save</span> it to the same .xlsx <span style=\"\">file</span>name, you will effectively remove the charts from it."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Summary"
	},
	{
		"component": "text",
		"value": "Often the hard part of processing information isn’t the processing itself but simply getting the data in the right format for your program. But once you have your spreadsheet loaded into <span style=\"\">Python</span>, you can extract and manipulate its data much faster than you could by hand."
	},
	{
		"component": "text",
		"value": "You can also generate spreadsheets as <span style=\"\">output</span> from your programs. So if colleagues need your text <span style=\"\">file</span> or PDF of thousands of sales contacts transferred to a spreadsheet <span style=\"\">file</span>, you won’t have to tediously copy and paste it all into Excel."
	},
	{
		"component": "text",
		"value": "Equipped with the openpyxl module and some programming knowledge, you’ll find processing even the biggest spreadsheets a piece of cake."
	}
]