[
	{
		"component": "header",
		"variant": 3,
		"value": "Preparation"
	},
	{
		"component": "text",
		"value": "Game start karne ke liye apko <span style=\"\">tab</span>oo cards ka deck banana padega . Iske steps neeche detail out kiye gae hain."
	},
	{
		"component": "text",
		"value": "<b>Step One</b> : Aapke sath kuch sheets share ki jaengi jinme kuch boxes me kuch words likhe honge. ",
		"decoration": {
			"type": "number",
			"value": null
		}
	},
	{
		"component": "text",
		"value": "<b>Step Two</b> : Aapko in sheets ko print karwana hai aur fir unhe single single cards me divide karna hai.",
		"decoration": {
			"type": "number",
			"value": null
		}
	},
	{
		"component": "header",
		"variant": 3,
		"value": "Game Setup and Instructions"
	},
	{
		"component": "text",
		"value": "Saare players do teams me divide ho jaenge aur dono teams ke naam decide kar lenge. For example, ek team ka naam hoga A and dusri team ka naam hoga B.",
		"decoration": {
			"type": "number",
			"value": 1
		}
	},
	{
		"component": "text",
		"value": "Saare taboo ke cards ek pack me arrange kar diye jaenge.  Pehle Team A se ek person aaega aur is deck me se ek card pick karega. Is baat ka dhyan rahe ki Team A se koi aur person us card ko na dekh paae. ",
		"decoration": {
			"type": "number",
			"value": 2
		}
	},
	{
		"component": "text",
		"value": "Har card par jo first word hai vo aapka clue word hai aur jo baaki ke words hain vo “Taboo” words hain. Team A ke player ko apni team ko Clue word samjhana hai par bina Taboo words ko use kiye. Aap ko kuch aur bolkar vo word apni team ko explain karna hai. ",
		"decoration": {
			"type": "number",
			"value": 3
		}
	},
	{
		"component": "text",
		"value": "Agar aapki team ne apka word guess kar liya, toh aapki team ko ek point milega. Agar aapne card par likha koi taboo word bol diya galti se, toh aapka ek point minus ho jaega. Fiir aap vo card rakh kar dusra card pick kar loge. Aap koi taboo word nahi use kar rahe ye check karne ke liye Team B ka koi player bhi aapke card ko dekhta rahega.",
		"decoration": {
			"type": "number",
			"value": 4
		}
	},
	{
		"component": "text",
		"value": "Words explain karte waqt aap actions nahi use kar sakte. Sirf bolkar hi explain kar sakte ho.",
		"decoration": {
			"type": "number",
			"value": 5
		}
	},
	{
		"component": "text",
		"value": "Game me dono teams ki alternate chances aaengi. Har chance me player ke paas 2 minute ka time rahega. ",
		"decoration": {
			"type": "number",
			"value": 6
		}
	},
	{
		"component": "text",
		"value": "2 minute mein aapne jitne Clue words sahi se guess kiye utne points milenge. Jitne baar Taboo words use liye utne points subtract honge.Jab ek team khel rahi hogi, dusri team ka ek member time par dhyan de raha hoga.",
		"decoration": {
			"type": "number",
			"value": 7
		}
	},
	{
		"component": "text",
		"value": "Aap har round ke baad points note down karoge. Game tab tak chalegi jab tak dono teams ka har player participate nahi kar leta. Agar ek team me koi extra player hai, toh dusri team ke kisi ek player ko do chances milengi.",
		"decoration": {
			"type": "number",
			"value": 8
		}
	},
	{
		"component": "text",
		"value": "You can also watch the instructions <a href=\"https://youtu.be/4QeA4nrcQV0\">here</a>"
	}
]