{
	"don’t-debug-with-print()_key1": "Don’t Debug with print()",
	"don’t-debug-with-print()_key2": "Typing import logging and logging.basicConfig(level=logging.DEBUG, format= '%(asctime)s - %(levelname)s - %(message)s') is somewhat unwieldy. You may want to use print() calls instead, but don’t give in to this temptation! Once you’re done debugging, you’ll end up spending a lot of time removing print() calls from your <span style=\"\">code</span> for each log message. You might even accidentally remove some print() calls that were being used for nonlog messages. The nice thing about log messages is that you’re free to fill your program with as many as you like, and you can always disable them later by adding a single logging.disable(logging.CRITICAL) call. Unlike print(), the logging module makes it easy to switch between showing and hiding log messages.",
	"don’t-debug-with-print()_key3": "Log messages are intended for the programmer, not the user. The user won’t care about the contents of some dictionary value you need to see to help with debugging; use a log message for something like that. For messages that the user will want to see, like <span style=\"\">File</span> not found or Invalid <span style=\"\">input</span>, please enter a number, you should use a print() call. You don’t want to deprive the user of useful information after you’ve disabled log messages.",
	"don’t-debug-with-print()_key4": "Logging Levels",
	"don’t-debug-with-print()_key5": "Logging levels provide a way to categorize your log messages by importance. There are five logging levels, described in <span style=\"\">Tab</span>le 10-1 from least to most important. Messages can be logged at each level using a different logging function.",
	"don’t-debug-with-print()_key6": "<span style=\"\">Tab</span>le 10-1. Logging Levels in <span style=\"\">Python</span>",
	"don’t-debug-with-print()_key7": "Level",
	"don’t-debug-with-print()_key8": "Logging Function",
	"don’t-debug-with-print()_key9": "Description",
	"don’t-debug-with-print()_key10": "DEBUG",
	"don’t-debug-with-print()_key11": "logging.debug()",
	"don’t-debug-with-print()_key12": "The lowest level. Used for small details. Usually you care about these messages only when diagnosing problems.",
	"don’t-debug-with-print()_key13": "INFO",
	"don’t-debug-with-print()_key14": "logging.info()",
	"don’t-debug-with-print()_key15": "Used to record information on general events in your program or confirm that things are working at their point in the program.",
	"don’t-debug-with-print()_key16": "WARNING",
	"don’t-debug-with-print()_key17": "logging.warning()",
	"don’t-debug-with-print()_key18": "Used to indicate a potential problem that doesn’t prevent the program from working but might do so in the future.",
	"don’t-debug-with-print()_key19": "<span style=\"\">ERROR</span>",
	"don’t-debug-with-print()_key20": "logging.<span style=\"\">error</span>()",
	"don’t-debug-with-print()_key21": "Used to record an <span style=\"\">error</span> that caused the program to fail to do something.",
	"don’t-debug-with-print()_key22": "CRITICAL",
	"don’t-debug-with-print()_key23": "logging.critical()",
	"don’t-debug-with-print()_key24": "The highest level. Used to indicate a fatal <span style=\"\">error</span> that has caused or is about to cause the program to stop running entirely.",
	"don’t-debug-with-print()_key25": "Your logging message is passed as a <span style=\"\">string</span> to these functions. The logging levels are suggestions. Ultimately, it is up to you to decide which category your log message falls into. Enter the following into the interactive <span style=\"\">shell</span>:",
	"don’t-debug-with-print()_key26": "2015-05-18 19:04:26,901 - DEBUG - Some debugging details.",
	"don’t-debug-with-print()_key27": "2015-05-18 19:04:35,569 - INFO - The logging module is working.",
	"don’t-debug-with-print()_key28": "2015-05-18 19:04:56,843 - WARNING - An <span style=\"\">error</span> message is about to be logged.",
	"don’t-debug-with-print()_key29": "2015-05-18 19:05:07,737 - <span style=\"\">ERROR</span> - An <span style=\"\">error</span> has occurred.",
	"don’t-debug-with-print()_key30": "2015-05-18 19:05:45,794 - CRITICAL - The program is unable to recover!<br>The benefit of logging levels is that you can change what priority of logging message you want to see. Passing logging.DEBUG to the basicConfig() function’s level <span style=\"\">key</span>word argument will show messages from all the logging levels (DEBUG being the lowest level). But after developing your program some more, you may be interested only in <span style=\"\">errors</span>. In that case, you can set basicConfig()’s level argument to logging.<span style=\"\">ERROR</span>. This will show only <span style=\"\">ERROR</span> and CRITICAL messages and skip the DEBUG, INFO, and WARNING messages."
}