[
	{
		"component": "text",
		"value": "NavGurukul mei aapka swagat hai. NavGurukul ek learners ki community hai jo aapko sahajta, samvedansheelta aur shreshthta se purna jeevan jeene ke liye tayyar karta hai. Aap mehnat karke ek achhi job zarur le paenge, aur sath hi jeevan jeene ki kuch important skills bhi aap yahan seekhenge. "
	},
	{
		"component": "text",
		"value": "NavGurukul mei humare liye sabse important cheez hi ki hum aapko yeh seekha paye ki <b>seekhte kaise hain</b>."
	},
	{
		"component": "text",
		"value": "Jab aap course shuru karenge toh aapko cheezein thodi muskhil lagengi, par aap dheere dheere jaise thoda time bitayenge toh aapko cheezein samajh aana shuru hongi and aasaan lagne lagegi. Aise mei zaroori hai ki aap lagataar mehnat karte raho. Koi cheez aasaan lage, toh ek baar. Mushkil lage toh do baar karo. Aur mushkil lage, toh baar baar karo."
	},
	{
		"component": "text",
		"value": "NavGurukul ka yeh course saare courses se kaafi alag hai. Aapko iss course ko karne ke liye khud par bharosa karna padega, aur yeh samajhna padega ki jo bhi aapke questions hai, google sab answers kar sakta hai agar aap sahi se uss question ko google se puchenge."
	},
	{
		"component": "text",
		"value": "Aapko agar koi bhi question aata hai toh aap yeh sequence follow karoge - "
	},
	{
		"component": "text",
		"value": "Google se poocho. Agar ek baar mei answer nahi mile, toh apne question ko kisi aur tarah se poocho.",
		"decoration": {
			"type": "number",
			"value": null
		}
	},
	{
		"component": "text",
		"value": "NavGurukul mei kisi aur student se poocho",
		"decoration": {
			"type": "number",
			"value": null
		}
	},
	{
		"component": "text",
		"value": "Apne facilitator se poocho",
		"decoration": {
			"type": "number",
			"value": null
		}
	},
	{
		"component": "text",
		"value": "Facilitator ka kaam aapki learning mei help karna hai, and facilitator khud decide karega ki facilitator kaha aapki sabse jyada help kar sakta hai. Aap yeh na samjhe ki facilitator aapke questions ka answer karega. Apne questions ka answer dheere dheere aap kaafi asaani se google par dhoondh payega. Aur yehi sacchi learning hai."
	},
	{
		"component": "header",
		"variant": 2,
		"value": "Self-managed Campus"
	},
	{
		"component": "text",
		"value": "NavGurukul ke campus ko manage karne ki zimmedari aapke jaise hi kuch students lete hain. Apne campus ko chalane ke liye kisi aur ke adheen na hote hue, apne rehne aur padhne ke liye saare zaruri arrangements community members mil baatkar karte hain. Sirf itna hi nahi, campus me padhai ko behtar se behtar kaise banana hai, kaise bahar se logon ko invite karna hai taaki vo campus aakar students ke sath apna knowledge share kar sakein, kaise students ke liye new learning opportunities dhundni hain, ye sab student community lead karti hai. Aapki help ke liye NavGurukul ki team aur kafi saare volunteers humesha ready rehte hain."
	},
	{
		"component": "header",
		"variant": 2,
		"value": "Self and Peer led Learning"
	},
	{
		"component": "text",
		"value": "NavGurukul mein aap kafi saare skills seekhnege lekin yahan koi teachers nahin hai. Aapki learning ki sabse zyada responsibility aapki khud hai. Aap internet par available kafi saare resources, NavGurukul dwara banaye gaye curriculum aur ek dusre ki help lekar seekhenge. Sath hi apko kuch mentors assign kiye jaenge jo aapki help karenge ye samajhne mein ki aapko kya padhna hai aur kahan se padhna hai. Aap kitna jaldi ya kitna dheere seekhte hain, ye aapki mehnat ke upar depend karta hain."
	},
	{
		"component": "youtube",
		"value": "vgkahOzFH2Q"
	},
	{
		"component": "header",
		"variant": 2,
		"value": "Dhyaan Rakhein!"
	},
	{
		"component": "text",
		"value": "Koshish karke English mei jitna bol sako, utna English mei bolo.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Aapki learning aapke haath mei hai. Aap kisi cheez ko 2 ghante mei seekh sakte ho, 2 din mei, ya do hafte mei. Aakhir mei aap kitna seekhoge yeh aapki lagan aur mehnat par nirbhar karega.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Yeh shayad aapki zindagi ka sabse important time hai, jab aap itna sab seekh sakte ho. Iss samay ka laabh acche se seekhne mei lagao.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "text",
		"value": "Hamesha apne uppar bharosa rakho, aap jo test clear karke aaye hai woh clear karna hi yeh darshaata hai ki aap coding mehnat karke aaraam se seekh jayenge.",
		"decoration": {
			"type": "bullet"
		}
	},
	{
		"component": "header",
		"variant": 2,
		"value": "Aapka Schedule"
	},
	{
		"component": "text",
		"value": "Aapki classes ka schedule yaani kaunsi classes kab hoti hai, yeh aapka poora group decide karta hai. Aap apne aas paas kisi bhi student se schedule le kar yaad kar lo. Schedule ko dhyaan se follow karna bahut jaroori hai. Agar aap kisi bhi class ke liye late hote hai, toh aap woh class nahi lagayenge.",
		"decoration": {
			"type": "bullet"
		}
	}
]