{
	"Project3_key1": "Understand about prompt below :",
	"Project3_key2": "You already know about readline-sync that is useful for taking an <span style=\"\">input</span>, but in browsers we have one default function named prompt which will give an popup whenever it is called to take <span style=\"\">input</span>.",
	"Project3_key3": "You can read more about the prompt here. ",
	"Project3_key4": "<a href=\"https://www.w3schools.com/jsref/met_win_prompt.asp\">how to use promt</a>",
	"Project3_key5": "Write a programme in Javascript like a web crawler, you have to take <span style=\"\">input</span> from the user, who is interested in finding the links based on that particular sub<span style=\"\">string</span>. you have to fetch all the links which contain the user given sub<span style=\"\">string</span> as a text in all links.",
	"Project3_key6": "- Take the Substring by using prompt<br>- Get the document first<br>- Collect all links from document<br>- From all links find all the links whose text is equal to Substring that user entered in prompt",
	"Project3_key7": "Website: ",
	"Project3_key8": "www.navgurukul.org",
	"Project3_key9": "Sub<span style=\"\">string</span>: MERAKI",
	"Project3_key10": "links by using substring",
	"Project3_key11": "How to add Script <span style=\"\">file</span> in html",
	"Project3_key12": "<a href=\"https://www.w3schools.com/tags/att_script_src.asp\">Understand the script tag</a>",
	"Project3_key13": "A Small Exercise",
	"Project3_key14": "See the <a href=\"https://drive.google.com/file/d/1pc4Q-8BxoBZg4blNdMiRoAGNY7Qr6K27/view?usp=sharing\">video</a> to get to know about the project.",
	"Project3_key15": "<a href=\"https://github.com/vknayak/JS-projects/tree/main/A%20small%20exercise\">https://github.com/vknayak/JS-projects/tree/main/A%20small%20exercise</a>",
	"Project3_key16": "This is the html page of a small web page. What you need to do is write a script to get the h1 tag content or text that is there.",
	"Project3_key17": "And the script <span style=\"\">file</span> is attached with html in script tag with src attribute.",
	"Project3_key18": "Script.js",
	"Project3_key19": "Get the value of h1 tag that is there in given webpage by using dom <br>method: getElementById store it in a <span style=\"\">variable</span> and console it",
	"Project3_key20": "// write the <span style=\"\">code</span> from below line….",
	"Project3_key21": "Finding HTML Elements",
	"Project3_key22": "You can manipulate html Elements by using Javascript, you have so many type to do that but the basic one we will discuss now.",
	"Project3_key23": "Think that you need to call someone how you call him, <br>    - By his name if you know like hey kumar.<br>    - By what colour of dress he is wearing like hey red colour shirt",
	"Project3_key24": "Or in some other ways right.",
	"Project3_key25": "Like the same we will call our html elements by their id and class names and css selectors etc.,",
	"Project3_key26": "Lets See a small example on how to get elements by Id.",
	"Project3_key27": "Js you can add by writing your <span style=\"\">code</span> in a separate <span style=\"\">file</span> right now I am writing the JS <span style=\"\">code</span> inside html only.",
	"Project3_key28": "Here, in the above HTML page you have p element which has the content Finding HTML Elements by Id and id of that element id intro.",
	"Project3_key29": "If you want to get the p tag by its id. You will use document, why document because we all know document is the owner of all elements everything will come inside that. So, in the document we need to use, getElementById like ",
	"Project3_key30": "document.getElementById(\"intro\");",
	"Project3_key31": "And in the parenthesis we will write the id of the particular element that we are going to get.",
	"Project3_key32": "And you can store it in a <span style=\"\">variable</span> if you are feeling you can use it in future.",
	"Project3_key33": "Not only getting elements you can write the data into the HTML by using innerHTML.",
	"Project3_key34": "If you see we have 1 empty p tag with id demo, if you want to write anything get that first and use innerHTML and update value by assignment <span style=\"\">operator</span>.",
	"Project3_key35": "You can get more <a href=\"https://www.w3schools.com/js/js_htmldom_elements.asp\">here</a>\nplease go through  this link."
}