[
  {
    "component": "banner",
    "value": "javaScript",
    "title" : "will add later",
    "url": "https://res.cloudinary.com/practicaldev/image/fetch/s--sqXFkEvv--/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Unofficial_JavaScript_logo_2.svg/1920px-Unofficial_JavaScript_logo_2.svg.png"
  },
  {
    "component": "text",
    "value": "Before we give you a formal definition of JavaScript, let us show you where JavaScript is used. Chances are, you have already used JavaScript before.\n"
  },
  {
    "component": "text",
    "value": "Every time you Play audio and video on youtube, you are likely using JavaScript.\n"
  },
  {
    "component": "text",
    "value": "Every time you click a button on a browser, chances are there that you are using javascript.\n"
  },
  {
    "component": "text",
    "value": "  You can go through this video first to understand the features of Javascript.\n"
  },
  {
    "component": "youtube",
    "value": "DONMpU7Xc8w"
  },
  {
    "component": "text",
    "value": "Javascript is a high-level scripting and interpreted programming language. Now, there are three important phrases to understand here. High level, Scripting, and Interpreted.\n"
  },
  {
    "component": "text",
    "value": "Please follow this link"
  },
  {
    "component": "link",
    "value": "VSCode",
    "href": "https://linuxize.com/post/how-to-install-visual-studio-code-on-ubuntu-20-04/"
  },
  {
    "component": "text",
    "value": "To run javascript in vscode you need to install a node to do that. Follow this\n"
  },
  {
    "component":"text",
    "value": "High Level Language :- High-Level Language is a language which humans can understand and write easily. For example, English can be read by us easily. And JavaScript code also can be read by us humans easily.",
    "decoration":{
       "type":"bullet"
    }
  },
  {
    "component":"text",
    "value": "Scripting Language :- Scripting language is a language which converts our human-readable code into machine code. Machine code, as you may know, exists as 1s and 0s  and we will call it a low level language also.",
    "decoration":{
       "type":"bullet"
    }
  },
  {
    "component":"text",
    "value": "Interpreted Programming Language :- An Interpreter read over the JavaScript code, one line at a time, and runs it. Javascript is run by Interpreter. Some other languages, like Java, for instance, are run by something called a Compiler. A compiler does not run the code line by line. Instead, it reads the entire code and then runs it.",
    "decoration":{
       "type":"bullet"
    }
  }
]