{
	"the-startswith()-and-endswith()-string-methods_key1": "The startswith() and endswith() <span style=\"\">String</span> Methods",
	"the-startswith()-and-endswith()-string-methods_key2": "The startswith() and endswith() methods return <span style=\"\">True</span> if the <span style=\"\">string</span> value they are called on begins or ends (respectively) with the <span style=\"\">string</span> passed to the method; otherwise, they return <span style=\"\">False</span>. Enter the following into the interactive <span style=\"\">shell</span>:",
	"the-startswith()-and-endswith()-string-methods_key3": "These methods are useful alternatives to the == equals <span style=\"\">operator</span> if you need to check only whether the first or last part of the <span style=\"\">string</span>, rather than the whole thing, is equal to another <span style=\"\">string</span>.",
	"the-startswith()-and-endswith()-string-methods_key4": "The join() and split() <span style=\"\">String</span> Methods<br>The join() method is useful when you have a list of <span style=\"\">strings</span> that need to be joined together into a single <span style=\"\">string</span> value. The join() method is called on a <span style=\"\">string</span>, gets passed a list of <span style=\"\">strings</span>, and returns a <span style=\"\">string</span>. The returned <span style=\"\">string</span> is the concatenation of each <span style=\"\">string</span> in the passed-in list. For example, enter the following into the interactive <span style=\"\">shell</span>:",
	"the-startswith()-and-endswith()-string-methods_key5": "Notice that the <span style=\"\">string</span> join() calls on is inserted between each <span style=\"\">string</span> of the list argument. For example, when join(['cats', 'rats', 'bats']) is called on the ', ' <span style=\"\">string</span>, the returned <span style=\"\">string</span> is ‘cats, rats, bats’.",
	"the-startswith()-and-endswith()-string-methods_key6": "Remember that join() is called on a <span style=\"\">string</span> value and is passed a list value. (It’s easy to accidentally call it the other way around.) The split() method does the opposite: It’s called on a <span style=\"\">string</span> value and returns a list of <span style=\"\">strings</span>. Enter the following into the interactive <span style=\"\">shell</span>:",
	"the-startswith()-and-endswith()-string-methods_key7": "By default, the <span style=\"\">string</span> 'My name is Simon' is split wherever whitespace characters such as the space, <span style=\"\">tab</span>, or newline characters are found. These whitespace characters are not included in the <span style=\"\">strings</span> in the returned list. You can pass a delimiter <span style=\"\">string</span> to the split() method to specify a different <span style=\"\">string</span> to split upon. For example, enter the following into the interactive <span style=\"\">shell</span>:",
	"the-startswith()-and-endswith()-string-methods_key8": "A common use of split() is to split a multiline <span style=\"\">string</span> along the newline characters. Enter the following into the interactive <span style=\"\">shell</span>:",
	"the-startswith()-and-endswith()-string-methods_key9": "Passing split() the argument '\\n' lets us split the multiline <span style=\"\">string</span> stored in spam along the newlines and return a list in which each item corresponds to one line of the <span style=\"\">string</span>.",
	"the-startswith()-and-endswith()-string-methods_key10": "Justifying Text with rjust(), ljust(), and center()<br>The rjust() and ljust() <span style=\"\">string</span> methods return a padded version of the <span style=\"\">string</span> they are called on, with spaces inserted to justify the text. The first argument to both methods is an <span style=\"\">integer</span> length for the justified <span style=\"\">string</span>. Enter the following into the interactive <span style=\"\">shell</span>:",
	"the-startswith()-and-endswith()-string-methods_key11": "'Hello'.rjust(10) says that we want to right-justify 'Hello' in a <span style=\"\">string</span> of total length 10. 'Hello' is five characters, so five spaces will be added to its left, giving us a <span style=\"\">string</span> of 10 characters with 'Hello' justified right.",
	"the-startswith()-and-endswith()-string-methods_key12": "An optional second argument to rjust() and ljust() will specify a fill character other than a space character. Enter the following into the interactive <span style=\"\">shell</span>:",
	"the-startswith()-and-endswith()-string-methods_key13": "The center() <span style=\"\">string</span> method works like ljust() and rjust() but centers the text rather than justifying it to the left or right. Enter the following into the interactive <span style=\"\">shell</span>:",
	"the-startswith()-and-endswith()-string-methods_key14": "These methods are especially useful when you need to print <span style=\"\">tab</span>ular data that has the correct spacing. Open a new <span style=\"\">file</span> <span style=\"\">editor</span> window and enter the following <span style=\"\">code</span>, saving it as picnic<span style=\"\">Tab</span>le.py:",
	"the-startswith()-and-endswith()-string-methods_key15": "In this program, we define a printPicnic() method that will take in a dictionary of information and use center(), ljust(), and rjust() to display that information in a neatly aligned <span style=\"\">tab</span>le-like format.",
	"the-startswith()-and-endswith()-string-methods_key16": "The dictionary that we’ll pass to printPicnic() is picnicItems. In picnicItems, we have 4 sandwiches, 12 apples, 4 cups, and 8000 cookies. We want to organize this information into two columns, with the name of the item on the left and the quantity on the right.",
	"the-startswith()-and-endswith()-string-methods_key17": "To do this, we decide how wide we want the left and right columns to be. Along with our dictionary, we’ll pass these values to printPicnic().",
	"the-startswith()-and-endswith()-string-methods_key18": "printPicnic() takes in a dictionary, a leftWidth for the left column of a <span style=\"\">tab</span>le, and a rightWidth for the right column. It prints a title, PICNIC ITEMS, centered above the <span style=\"\">tab</span>le. Then, it <span style=\"\">loops</span> through the dictionary, printing each <span style=\"\">key</span>-value pair on a line with the <span style=\"\">key</span> justified left and padded by periods, and the value justified right and padded by spaces.",
	"the-startswith()-and-endswith()-string-methods_key19": "After defining printPicnic(), we define the dictionary picnicItems and call printPicnic() twice, passing it different widths for the left and right <span style=\"\">tab</span>le columns.",
	"the-startswith()-and-endswith()-string-methods_key20": "When you run this program, the picnic items are displayed twice. The first time the left column is 12 characters wide, and the right column is 5 characters wide. The second time they are 20 and 6 characters wide, respectively.",
	"the-startswith()-and-endswith()-string-methods_key21": "---PICNIC ITEMS--<br>sandwiches..    4<br>apples……   12<br>cups……..    4<br>cookies….. 8000<br>-------PICNIC ITEMS-------<br>sandwiches……….     4<br>apples…………..    12<br>cups…………….     4<br>cookies………….  8000<br>Using rjust(), ljust(), and center() lets you ensure that <span style=\"\">strings</span> are neatly aligned, even if you aren’t sure how many characters long your <span style=\"\">strings</span> are.",
	"the-startswith()-and-endswith()-string-methods_key22": "Removing Whitespace with strip(), rstrip(), and lstrip()<br>Sometimes you may want to strip off whitespace characters (space, <span style=\"\">tab</span>, and newline) from the left side, right side, or both sides of a <span style=\"\">string</span>. The strip() <span style=\"\">string</span> method will return a new <span style=\"\">string</span> without any whitespace characters at the beginning or end. The lstrip() and rstrip() methods will remove whitespace characters from the left and right ends, respectively. Enter the following into the interactive <span style=\"\">shell</span>:",
	"the-startswith()-and-endswith()-string-methods_key23": "Optionally, a <span style=\"\">string</span> argument will specify which characters on the ends should be stripped. Enter the following into the interactive <span style=\"\">shell</span>:",
	"the-startswith()-and-endswith()-string-methods_key24": "Passing strip() the argument 'ampS' will tell it to strip occurences of a, m, p, and capital S from the ends of the <span style=\"\">string</span> stored in spam. The order of the characters in the <span style=\"\">string</span> passed to strip() does not matter: strip('ampS') will do the same thing as strip('mapS') or strip('Spam')."
}