{
	"project:-adding-bullets-to-wiki-markup_key1": "Project: Adding Bullets to Wiki Markup",
	"project:-adding-bullets-to-wiki-markup_key2": "When editing a Wikipedia article, you can create a bulleted list by putting each list item on its own line and placing a star in front. But say you have a really large list that you want to add bullet points to. You could just type those stars at the beginning of each line, one by one. Or you could automate this task with a short <span style=\"\">Python</span> script.",
	"project:-adding-bullets-to-wiki-markup_key3": "The bulletPointAdder.py script will get the text from the clipboard, add a star and space to the beginning of each line, and then paste this new text to the clipboard. For example, if I copied the following text (for the Wikipedia article “List of Lists of Lists”) to the clipboard:",
	"project:-adding-bullets-to-wiki-markup_key4": "Lists of animals<br>Lists of aquarium life<br>Lists of biologists by author abbreviation<br>Lists of cultivars<br>and then ran the bulletPointAdder.py program, the clipboard would then contain the following:",
	"project:-adding-bullets-to-wiki-markup_key5": "Lists of animals",
	"project:-adding-bullets-to-wiki-markup_key6": "Lists of aquarium life",
	"project:-adding-bullets-to-wiki-markup_key7": "Lists of biologists by author abbreviation",
	"project:-adding-bullets-to-wiki-markup_key8": "Lists of cultivarsThis star-prefixed text is ready to be pasted into a Wikipedia article as a bulleted list.",
	"project:-adding-bullets-to-wiki-markup_key9": "Step 1: Copy and Paste from the Clipboard",
	"project:-adding-bullets-to-wiki-markup_key10": "You want the bulletPointAdder.py program to do the following:",
	"project:-adding-bullets-to-wiki-markup_key11": "Paste text from the clipboard",
	"project:-adding-bullets-to-wiki-markup_key12": "Do something to it",
	"project:-adding-bullets-to-wiki-markup_key13": "Copy the new text to the clipboard",
	"project:-adding-bullets-to-wiki-markup_key14": "That second step is a little tricky, but steps 1 and 3 are pretty straightforward: They just involve the pyperclip.copy() and pyperclip.paste() functions. For now, let’s just write the part of the program that covers steps 1 and 3. Enter the following, saving the program as bulletPointAdder.py:",
	"project:-adding-bullets-to-wiki-markup_key15": "<h1 id=\"spanstylepython3span\">! <span style=\"\">python3</span></h1>",
	"project:-adding-bullets-to-wiki-markup_key16": "bulletPointAdder.py - Adds Wikipedia bullet points to the start",
	"project:-adding-bullets-to-wiki-markup_key17": "of each line of text on the clipboard.",
	"project:-adding-bullets-to-wiki-markup_key18": "import pyperclip<br>text = pyperclip.paste()",
	"project:-adding-bullets-to-wiki-markup_key19": "TODO: Separate lines and add stars.",
	"project:-adding-bullets-to-wiki-markup_key20": "pyperclip.copy(text)<br>The TODO comment is a reminder that you should complete this part of the program eventually. The next step is to actually implement that piece of the program.",
	"project:-adding-bullets-to-wiki-markup_key21": "Step 2: Separate the Lines of Text and Add the Star",
	"project:-adding-bullets-to-wiki-markup_key22": "The call to pyperclip.paste() returns all the text on the clipboard as one big <span style=\"\">string</span>. If we used the “List of Lists of Lists” example, the <span style=\"\">string</span> stored in text would look like this:",
	"project:-adding-bullets-to-wiki-markup_key23": "'Lists of animals\\nLists of aquarium life\\nLists of biologists by author<br>abbreviation\\nLists of cultivars'<br>The \\n newline characters in this <span style=\"\">string</span> cause it to be displayed with multiple lines when it is printed or pasted from the clipboard. There are many “lines” in this one <span style=\"\">string</span> value. You want to add a star to the start of each of these lines.",
	"project:-adding-bullets-to-wiki-markup_key24": "You could write <span style=\"\">code</span> that searches for each \\n newline character in the <span style=\"\">string</span> and then adds the star just after that. But it would be easier to use the split() method to return a list of <span style=\"\">strings</span>, one for each line in the original <span style=\"\">string</span>, and then add the star to the front of each <span style=\"\">string</span> in the list.",
	"project:-adding-bullets-to-wiki-markup_key25": "Make your program look like the following:",
	"project:-adding-bullets-to-wiki-markup_key26": "<h1 id=\"spanstylepython3span\">! <span style=\"\">python3</span></h1>",
	"project:-adding-bullets-to-wiki-markup_key27": "bulletPointAdder.py - Adds Wikipedia bullet points to the start",
	"project:-adding-bullets-to-wiki-markup_key28": "of each line of text on the clipboard.",
	"project:-adding-bullets-to-wiki-markup_key29": "import pyperclip<br>text = pyperclip.paste()",
	"project:-adding-bullets-to-wiki-markup_key30": "Separate lines and add stars.",
	"project:-adding-bullets-to-wiki-markup_key31": "lines = text.split('\\n')<br>for i in range(len(lines)):    # <span style=\"\">loop</span> through all indexes in the \"lines\" list<br>    lines[i] = '* ' + lines[i] # add star to each <span style=\"\">string</span> in \"lines\" list",
	"project:-adding-bullets-to-wiki-markup_key32": "pyperclip.copy(text)<br>We split the text along its newlines to get a list in which each item is one line of the text. We store the list in lines and then <span style=\"\">loop</span> through the items in lines. For each line, we add a star and a space to the start of the line. Now each <span style=\"\">string</span> in lines begins with a star.",
	"project:-adding-bullets-to-wiki-markup_key33": "Step 3: Join the Modified Lines",
	"project:-adding-bullets-to-wiki-markup_key34": "The lines list now contains modified lines that start with stars. But pyperclip.copy() is expecting a single <span style=\"\">string</span> value, not a list of <span style=\"\">string</span> values. To make this single <span style=\"\">string</span> value, pass lines into the join() method to get a single <span style=\"\">string</span> joined from the list’s <span style=\"\">strings</span>. Make your program look like the following:",
	"project:-adding-bullets-to-wiki-markup_key35": "<h1 id=\"spanstylepython3span\">! <span style=\"\">python3</span></h1>",
	"project:-adding-bullets-to-wiki-markup_key36": "bulletPointAdder.py - Adds Wikipedia bullet points to the start",
	"project:-adding-bullets-to-wiki-markup_key37": "of each line of text on the clipboard.",
	"project:-adding-bullets-to-wiki-markup_key38": "import pyperclip<br>text = pyperclip.paste()",
	"project:-adding-bullets-to-wiki-markup_key39": "Separate lines and add stars.",
	"project:-adding-bullets-to-wiki-markup_key40": "lines = text.split('\\n')<br>for i in range(len(lines)):    # <span style=\"\">loop</span> through all indexes for \"lines\" list<br>    lines[i] = '* ' + lines[i] # add star to each <span style=\"\">string</span> in \"lines\" list<br>text = '\\n'.join(lines)<br>pyperclip.copy(text)<br>When this program is run, it replaces the text on the clipboard with text that has stars at the start of each line. Now the program is complete, and you can try running it with text copied to the clipboard.",
	"project:-adding-bullets-to-wiki-markup_key41": "Even if you don’t need to automate this specific task, you might want to automate some other kind of text manipulation, such as removing trailing spaces from the end of lines or converting text to uppercase or lowercase. Whatever your needs, you can use the clipboard for <span style=\"\">input</span> and <span style=\"\">output</span>.",
	"project:-adding-bullets-to-wiki-markup_key42": "Summary",
	"project:-adding-bullets-to-wiki-markup_key43": "Text is a common form of data, and <span style=\"\">Python</span> comes with many helpful <span style=\"\">string</span> methods to process the text stored in <span style=\"\">string</span> values. You will make use of indexing, slicing, and <span style=\"\">string</span> methods in almost every <span style=\"\">Python</span> program you write.",
	"project:-adding-bullets-to-wiki-markup_key44": "The programs you are writing now don’t seem too sophisticated—they don’t have graphical user interfaces with images and colorful text. So far, you’re displaying text with print() and letting the user enter text with <span style=\"\">input</span>(). However, the user can quickly enter large amounts of text through the clipboard. This ability provides a useful avenue for writing programs that manipulate massive amounts of text. These text-based programs might not have flashy windows or graphics, but they can get a lot of useful work done quickly.",
	"project:-adding-bullets-to-wiki-markup_key45": "Another way to manipulate large amounts of text is reading and writing <span style=\"\">files</span> directly off the hard drive. You’ll learn how to do this with <span style=\"\">Python</span> in the next chapter.",
	"project:-adding-bullets-to-wiki-markup_key46": "That just about covers all the basic concepts of <span style=\"\">Python</span> programming! You’ll continue to learn new concepts throughout the rest of this book, but you now know enough to start writing some useful programs that can automate tasks. You might not think you have enough <span style=\"\">Python</span> knowledge to do things such as download web pages, update spreadsheets, or send text messages, but that’s where <span style=\"\">Python</span> modules come in! These modules, written by other programmers, provide functions that make it easy for you to do all these things. So let’s learn how to write real programs to do useful automated tasks."
}