{
	"charter-and-responsibilities_key1": "Charter and Responsibilities\n",
	"charter-and-responsibilities_key2": "Har Mentor ko inn cheezon ka specially dhyaan rakhna hai:\n",
	"charter-and-responsibilities_key3": "Weekly Progress Update\n",
	"charter-and-responsibilities_key4": "Own students\n  Every alternate week the mentor has to evaluate the student and update two things:\n  - Flag - Green / Yellow / Red\n  - Current level of the student\n\n",
	"charter-and-responsibilities_key5": "Students of another mentor\n  Every alternate week the mentor has to evaluate the students of some other group and update on three things:\n  - Flag - Green / Yellow / Red\n  - Current level of the student\n  - Are they happy with the progress of the student suggested by another mentor?\n\n\n",
	"charter-and-responsibilities_key6": "One Video a Week\n",
	"charter-and-responsibilities_key7": "All the students have to create one video - and update the link of their video. Mentors will check the quality of the video and share the feedback with the student. All the mentors have to create one video each as well.\n",
	"charter-and-responsibilities_key8": "One Class a Week\n",
	"charter-and-responsibilities_key9": "All the students have to take one class per week on any topic of their comfort. This will help them to articulate themselves better. They have to announce the class in the respective `_paathshala` group on Cliq. This is optional for the mentors.\n",
	"charter-and-responsibilities_key10": "GBU\n",
	"charter-and-responsibilities_key11": "The students have to do reflections using GBU at least thrice in a month.\n",
	"charter-and-responsibilities_key12": "Tech Samvaad\n",
	"charter-and-responsibilities_key13": "Students have to do Tech Samvaad at least four times a week.\n",
	"charter-and-responsibilities_key14": "Toggl\n",
	"charter-and-responsibilities_key15": "Students should use Toggl for monitoring their time. Mentors to use this while interviewing students for the weekly progress.\n",
	"charter-and-responsibilities_key16": "Daily Standups\n",
	"charter-and-responsibilities_key17": "Mentors are advised to do daily Standups with their Mentees for effective goal setting and follow ups.\n"
}