{
	"how-to-use_key1": "Watching movies in English is an awesome way of improving your English – especially your English speaking and listening skills.",
	"how-to-use_key2": "You can watch English movies in different ways and improve your English. Following are some of the tips to learn English through tips.",
	"how-to-use_key3": "<b>Use subtitles</b>: Using subtitles while watching movies, will help you in understanding the movie movie better. When you feel a little lost in the movie, you can pause, read the subtitles, understand it and then move forward. You don't have to read the subtitle word by word,instead just use them to get the gist (the idea) of something if the speech becomes too fast that you can’t understand what the characters are saying.",
	"how-to-use_key4": "<b>Listen and Repeat</b>: The beauty of watching a recorded movie online or on a DVD is that you’re able to pause and go back if you don’t understand – something you can’t do with your English teachers in the classroom. Go back to a part you didn’t understand and say it out loud. Repeat it a few times and read what the subtitles say. ",
	"how-to-use_key5": "<b>Keep a movie journal</b>: While you watch your movies, pause the video when you hear something that you might find useful in the future or new words or phrases that you like and write it down in a journal.",
	"how-to-use_key6": "<b>Read before you watch</b>: Before you watch the movie, read a little bit about the movie. This will help you in knowing what to expect from the movie and identify the themes in the movie.",
	"how-to-use_key7": "Different ways to watch a movie",
	"how-to-use_key8": "Watch the movie along with subtitles in your own language. This can help beginners to enjoy watching English movies and understand them too.",
	"how-to-use_key9": "Watch the movie along with subtitles in English. After you finish watching, have a dicussion with your friends about it. ",
	"how-to-use_key10": "Watch some part of the movie with the sound muted and subtitles on. Try to understand what is going on.",
	"how-to-use_key11": "Watch some part of the movie with the sound and subtitles off. Try to figure out what is going on by using the speaker's gestures and imagining from the context you just gained."
}