[
	{
		"component": "header",
		"variant": 1,
		"value": "JSON and APIs"
	},
	{
		"component": "text",
		"value": "JavaScript Object Notation is a popular way to format data as a single human-readable <span style=\"\">string</span>. JSON is the native way that JavaScript programs write their data structures and usually resembles what <span style=\"\">Python</span>’s pprint() function would produce. You don’t need to know JavaScript in order to work with JSON-formatted data."
	},
	{
		"component": "text",
		"value": "Here’s an example of data formatted as JSON:"
	},
	{
		"component": "text",
		"value": "{\"name\": \"Zophie\", \"isCat\": <span style=\"\">true</span>,<br> \"miceCaught\": 0, \"napsTaken\": 37.5,<br> \"felineIQ\": null}<br>JSON is useful to know, because many websites offer JSON content as a way for programs to interact with the website. This is known as providing an <span style=\"\">application</span> programming interface (API). Accessing an API is the same as accessing any other web page via a URL. The difference is that the data returned by an API is formatted (with JSON, for example) for machines; APIs aren’t easy for people to read."
	},
	{
		"component": "text",
		"value": "Many websites make their data available in JSON format. Facebook, Twitter, Yahoo, Google, Tumblr, Wikipedia, Flickr, Data.gov, Reddit, IMDb, Rotten Tomatoes, LinkedIn, and many other popular sites offer APIs for programs to use. Some of these sites require registration, which is almost always free. You’ll have to find documentation for what URLs your program needs to request in order to get the data you want, as well as the general format of the JSON data structures that are returned. This documentation should be provided by whatever site is offering the API; if they have a “Developers” page, look for the documentation there."
	},
	{
		"component": "text",
		"value": "Using APIs, you could write programs that do the following:"
	},
	{
		"component": "text",
		"value": "Scrape raw data from websites. (Accessing APIs is often more convenient than downloading web pages and parsing HTML with Beautiful Soup.)"
	},
	{
		"component": "text",
		"value": "Automatically download new posts from one of your social network accounts and post them to another account. For example, you could take your Tumblr posts and post them to Facebook."
	},
	{
		"component": "text",
		"value": "Create a “movie encyclopedia” for your personal movie collection by pulling data from IMDb, Rotten Tomatoes, and Wikipedia and putting it into a single text <span style=\"\">file</span> on your computer."
	},
	{
		"component": "text",
		"value": "You can see some examples of JSON APIs in the resources at <span><a href=\"http://nostarch.com/automatestuff/\">http://nostarch.com/automatestuff/</a></span>."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "The JSON Module"
	},
	{
		"component": "text",
		"value": "<span style=\"\">Python</span>’s json module handles all the details of translating between a <span style=\"\">string</span> with JSON data and <span style=\"\">Python</span> values for the json.loads() and json.dumps() functions. JSON can’t store every kind of <span style=\"\">Python</span> value. It can contain values of only the following data types: <span style=\"\">strings</span>, <span style=\"\">integers</span>, <span style=\"\">floats</span>, Booleans, lists, dictionaries, and NoneType. JSON cannot represent <span style=\"\">Python</span>-specific objects, such as <span style=\"\">File</span> objects, CSV Reader or Writer objects, Regex objects, or Selenium WebElement objects."
	}
]