{
	"socialmedia_key1": "<h1 id=\"socialmediakyahai\">social media kya hai</h1>",
	"socialmedia_key2": "Website or <span style=\"\">application</span> jo user ko Apni cheez share Karne me help Karta Hai Uss platform ko hum social media Kehte Hai, Jaise FaceBook, Instagram, Whatsapp etc.",
	"socialmedia_key3": "Do logo ko milkar sabse pehle ye videos dekhni hai",
	"socialmedia_key4": "use of social media in daily life",
	"socialmedia_key5": "yah bahut tej gati se hone vaala sanchaar ka maadhyam hai",
	"socialmedia_key6": "yah jaanakaaree ko ek hee jagah ikattha karata hai ",
	"socialmedia_key7": "saralata se samaachaar pradaan karata hai",
	"socialmedia_key8": "sabhee vargon ke lie hai, jaise ki shikshit varg ho ya ashikshit varg",
	"socialmedia_key9": "yahaan kisee prakaar se koee bhee vyakti kisee bhee kantent ka maalik nahin hota hai.",
	"socialmedia_key10": "photo, veediyo, soochana, dokyoomentas aadi ko aasaanee se sheyar kiya ja sak<br><br><br>",
	"socialmedia_key11": "<h3 id=\"abaapko30minskeliyeaapasmeienglishmeiinntopicskebaareinmeibaatkarnihaibrbaatkartekarteaapobservekareinkiaapkitnetechwordsusekarpaarahehaibrauragaraapkapartnerkoiaisatechwordboltahaijoaapkonahipatayaaapgenerallyusenahikarteininnwordskobhisamajhnekiphirkoshishkareinbrissdiscussionkokartehueaapinnpointskebaareinmeibhisochsaktehai\">Ab aapko 30 mins ke liye aapas mei english mei inn topics ke baarein mei baat karni hai.<br>###Baat karte karte, aap observe karein, ki aap kitne tech words use kar paa rahe hai.<br>###Aur agar aapka partner koi aisa tech word bolta hai, jo aapko nahi pata, ya aap generally use nahi kartein. Inn words ko bhi samajhne ki phir koshish karein.<br>###Iss discussion ko karte hue, aap inn points ke baarein mei bhi soch sakte hai:</h3>",
	"socialmedia_key12": "1)Navgurukul me communication kaise hota hai?<br>2)Social media aap ke hishab se kya hai?<br>3)aap ki life me social media ki kya importance hai?<br>4)What is the purpose of using social media?<br>5)What are examples of social media?<br>6)What are the types of social media?<br>7)What are the benefits of social media?"
}