{
	"saas_key1": "Aap yeh videos dekhein:",
	"saas_key2": "Introduction of SAAS",
	"saas_key3": "Eska pura nam <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">Software as a Service</span> hai yah ek distribution model hai jo ki internet mai software application(jaise browser) ko ek service ke rup mai customer ko provide karta hai",
	"saas_key4": "SAAS ki sabse achhi bat yah hai ki hame kisi software application ko install, maintain, tatha run karne ki jarurat nahi hoti hai kyuki eske sare software application web browser se sidhe hi run ho jata hai",
	"saas_key5": "SAAS mai customer ka data puri tarh secure hota hai tatha agar system ko koe kharabi bhi aajaye tobhi data secure rahta hai.",
	"saas_key6": "SAAS application jo hai vah SAAS provider ke server mai run hoti hai tatha SAAS application ko kabhi kabhi hosted application bhi karta hai",
	"saas_key7": "SAAS application ke example google apps, office36 etc.<br><br>",
	"saas_key8": "What is SAAS",
	"saas_key9": "SAAS in E-commerce",
	"saas_key10": "Ab aapko 30 mins ke liye aapas mei <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">english</span> mei inn topics ke baarein mei baat karni hai.",
	"saas_key11": "Baat karte karte, aap observe karein, ki aap kitne tech words use kar paa rahe hai.",
	"saas_key12": "Aur agar aapka partner koi aisa tech word bolta hai, jo aapko nahi pata, ya aap generally use nahi kartein. Inn words ko bhi samajhne ki phir koshish karein.",
	"saas_key13": "Iss discussion ko karte hue, aap inn points ke baarein mei bhi soch sakte hai:",
	"saas_key14": "SAAS kya hai?",
	"saas_key15": "SAAS ke application kay hai?",
	"saas_key16": "SAAS ke advantage discuss kare.",
	"saas_key17": "kya ham SAAS software ko Customize kar sakate hain?",
	"saas_key18": "Aapna data kon access karta hai SAAS mai?",
	"saas_key19": "SAAS mai aapna data safe hai kya?"
}