{
	"networking_key1": "Do log ko mil kar sabse pehle yeh videos dekhni hai",
	"networking_key2": "Ab aapko 30 mins ke liye aapas mei <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">english</span> mei baat karni hai.",
	"networking_key3": "Baat karte karte, aap observe karein, ki aap kitne tech words use kar paa rahe hai.",
	"networking_key4": "Aur agar aapka partner koi aisa tech word bolta hai, jo aapko nahi pata, ya aap generally use nahi kartein. Inn words ko bhi samajhne ki phir koshish karein.",
	"networking_key5": "Iss discussion ko karte hue, aap inn points ke baarein mei bhi soch sakte hai:",
	"networking_key6": "<span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">Networking</span> kya hota hai?, isse aapko kya samajh mai aaya?",
	"networking_key7": "Aapke <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">internet</span> shabdh sunte hi kya dimag mai aata hai?",
	"networking_key8": "Aap aapne phone se laptop ke beech mai kya ek network bna sakte ho kaise?",
	"networking_key9": "Same network pe hona or different network pe hona ka kya matlab hai?<br><br>",
	"networking_key10": "IP address kya hota hai?, IP address ki kya zarurat hoti hai?",
	"networking_key11": "IP address real life mai kis cheez ka replacement hai?",
	"networking_key12": "Ek computer jo ki aapke local computer pe nahi hai, aap usse kaise baat karenge?",
	"networking_key13": "Upar waale process, mai kya DNS ka use aayega?",
	"networking_key14": "Make a list ki aur kya kya naye tech shabdh hai, jinka aapne naam suna.<br><br>",
	"networking_key15": "For more information click on the link-",
	"networking_key16": ".<a href=\"https://www.computerhope.com/jargon/n/network.htm\">Networking</a><br><br>",
	"networking_key17": "<b>Tips</b>:<br>1 - Aap subtitles/captions on kar sakte hai, <span style=\"\">YouTube</span> Video dekhte hue<br>2 - Aap speed kam ya jyada kar sakte hai, video ke liye, jisse ki aap acche se dekh payein"
}