{
	"scripting_key1": "Scripting Language:-",
	"scripting_key2": "What is Scripting Language?",
	"scripting_key3": "yah ek aisi programming bhasha hai. Jiska prayog karke kisi dusre software application(e.g:- Firefox) par control kiya ja skta hai, aur script ke sahare us application se adhik kam liya ja skata hai.",
	"scripting_key4": "example ke liye Firefox ek browser hai jo \"c/c++\" language me likha hua hai iske upar \"javascript\" me kuchh line ka program likhakar bade-bade kam kraye jate hai.",
	"scripting_key5": "'Javascript,Python,Ruby,Perl,Php' yah kuchh main scripting languages hai.",
	"scripting_key6": "Advantage/Disadvantage of Scripting Language :-",
	"scripting_key7": "Advantage",
	"scripting_key8": "No complex build necessary.",
	"scripting_key9": "Dynamic.changing code at runtime is completely normal.",
	"scripting_key10": "Disadvantage",
	"scripting_key11": "It is requires the Scripting software to be installed  on the server.",
	"scripting_key12": "Many scripis and CMS tools required database in order to store dynamic data.              ",
	"scripting_key13": "Main feature of Scripting Language.",
	"scripting_key14": "Yeh often compile nahi kiya  jati hai, balki interpret kiya  jati hai.",
	"scripting_key15": "Yeh language often shikhne me aasan hoti hai, aur utni hi aasani se ",
	"scripting_key16": "pryog ki ja sakti hai.",
	"scripting_key17": "Inme typing ke niyam sakth nahi hote hai.",
	"scripting_key18": "Editing and running code is fast.",
	"scripting_key19": "Allow complex tasks to be performed in relatively few steps.",
	"scripting_key20": "<h1 id=\"umidkrtehaiyevideosaapkoscriptinglanguagesmjhnememadadkregi\">Umid krte hai ye videos aapko scripting language smjhne me madad kregi.</h1>",
	"scripting_key21": "In ouestion ko krte hue aap internet ka use kr sakte hai aur Friends help le skte hai:-",
	"scripting_key22": "Questions :-",
	"scripting_key23": "Script language ko aur jaane k liye peer learning kre?",
	"scripting_key24": "What is scripting language?",
	"scripting_key25": "Why we use Scripting language?"
}