{
	"Frontend_key1": "Do log ko mil kar sabse pehle yeh videos dekhni hai",
	"Frontend_key2": "What is Front-end Development?",
	"Frontend_key3": "Front-end development comprises of coding the visual aspects of a software, <span style=\"\">application</span> or website.  Front-end development refers to the ‘client-side’ of development. The most common languages used in this process are HTML, CSS, and  JavaScript. ",
	"Frontend_key4": "Iska mtlb hai ki Front-end developmemt me hum software ya program ke drshy pahaluon (visual aspects) ko banate hai. Jo sabse zyada common languages isme use hoti hai vo hai HTML, CSS aur JavaScript. Is me hum ‘client-side’ par kaam karte hai.",
	"Frontend_key5": "Ab aapko 30 mins ke liye aapas mei <span style=\"color: #eb9371; background-color: rgba(39, 41, 43, 0.83); box-shadow: 2px 2px 2px rgba(22, 9, 1, 0.6); border-radius: 2px; padding: 2px\">english</span> mei inn topics ke baarein mei baat karni hai.",
	"Frontend_key6": "Baat karte karte, aap observe karein, ki aap kitne tech words use kar paa rahe hai.",
	"Frontend_key7": "Aur agar aapka partner koi aisa tech word bolta hai, jo aapko nahi pata, ya aap generally use nahi kartein. Inn words ko bhi samajhne ki phir koshish karein.",
	"Frontend_key8": "Iss discussion ko karte hue, aap inn points ke baarein mei bhi soch sakte hai:",
	"Frontend_key9": "Front-end Kya hota hai?",
	"Frontend_key10": "Front me konsi programming languages use hoti hai?",
	"Frontend_key11": "Software me Front-end ki kya zarurat hai?",
	"Frontend_key12": "Agar aapko Front-end development ke bare me detail me padna hai to aap neeche diye gaye links pe ja sakte hai :",
	"Frontend_key13": "<span><a href=\"https://en.wikipedia.org/wiki/Front-end_web_development\">Yaha click kare</a></span><br><br><br><span><a href=\"https://www.coursereport.com/blog/front-end-development-vs-back-end-development-where-to-start\">Yaha Click kare</a></span>",
	"Frontend_key14": "<b>Tips</b>:<br>1 - Aap subtitles/captions on kar sakte hai, <span style=\"\">YouTube</span> Video dekhte hue<br>2 - Aap speed kam ya jyada kar sakte hai, video ke liye, jisse ki aap acche se dekh payein"
}