{
	"var_scope_key1": "//<span style=\"\">output</span>",
	"var_scope_key2": "kumar<br>pavan<br>kumar<br>Reference<span style=\"\">Error</span>: frdsName is not defined",
	"var_scope_key3": "In the above example var myName is declared in outside of function and var frdsName is declared inside the function. ",
	"var_scope_key4": "The <span style=\"\">variable</span> which is declared outside of the function has the global scope, we can access it anywhere in the <span style=\"\">code</span>. ",
	"var_scope_key5": "The <span style=\"\">variable</span> which is declared inside of the function has the local/function scope, we can access it in the function only. ",
	"var_scope_key6": "As you can see, we have used the <span style=\"\">variable</span> myName inside sayHi function and also outisided using console.log(myName).",
	"var_scope_key7": "The <span style=\"\">variable</span> frdsName has local scope since it is defined inside the sayHi function. So we can use it only inside the sayHi function. The moment we try to use it outside the sayHi function our programm throws an <span style=\"\">error</span> that frdsName is not defined. Let's look at each line of the programme more carefully.",
	"var_scope_key8": "Explantion",
	"var_scope_key9": "When the sayHi function is called  it prints  the console.log(myName) which is kumar. Since the <span style=\"\">variable</span> myName has global scope we can use it inside the function. After that frdsName is declared inside the function and it prints because we wrote to console frdsName.",
	"var_scope_key10": "Explantion",
	"var_scope_key11": "Then look at the line console .log(myName); it prints kumar because myName has the global scope.<br>myName is declared globally so we can use it inside the function or outside of the function too.",
	"var_scope_key12": "Explantion:",
	"var_scope_key13": "Now Let's look at the line which is giving an <span style=\"\">error</span> console.log(frdsName). Since frdsName is declared inside the function it has local scope it is limited to that function. But here we are trying to use that <span style=\"\">variable</span> outside the function. Thus the programme gives us the <span style=\"\">error</span>.",
	"var_scope_key14": "we are asking to print a local scope <span style=\"\">variable</span> , <br>After that it came to the line console.log(frds name); and it is trying to print frdsName but because of frdsName is declared inside the function it has local scope, it is not able to get that and throws an <span style=\"\">error</span> frdsname is not defined.",
	"var_scope_key15": "When declared inside a function with var, the <span style=\"\">variable</span> is scoped to that function.",
	"var_scope_key16": "Example:",
	"var_scope_key17": "//<span style=\"\">output</span>",
	"var_scope_key18": "kumar<br>Nayak",
	"var_scope_key19": "Explantion:",
	"var_scope_key20": "In the above example, we declared a <span style=\"\">variable</span> myName and assigned kumar into it, and after that because of console.log(myName); it printed kumar. And after printing we updated that value to Nayak, so now myName contains the value Nayak.",
	"var_scope_key21": "We can update the var <span style=\"\">variables</span>. Here myName is updated with a new value as Nayak.",
	"var_scope_key22": "Example:",
	"var_scope_key23": "// <span style=\"\">output</span>",
	"var_scope_key24": "Kumar<br>Kumar Nayak",
	"var_scope_key25": "Explantion:",
	"var_scope_key26": "In the above example, we declared a <span style=\"\">variable</span> myName and assigned kumar into it, and after that because of console.log(myName); it printed Kumar. And after printing we redeclared that <span style=\"\">variable</span> and assigned Kumar Nayak to it, so now myName contains the value Kumar Nayak right now.",
	"var_scope_key27": "We can redeclare the <span style=\"\">variables</span> with var. It won’t give any <span style=\"\">error</span>."
}