[
	{
		"component": "header",
		"variant": 1,
		"value": "Connecting to an SMTP Server"
	},
	{
		"component": "text",
		"value": "If you’ve ever set up Thunderbird, Outlook, or another program to connect to your email account, you may be familiar with configuring the SMTP server and port. These settings will be different for each email provider, but a web search for <your provider> smtp settings should turn up the server and port to use."
	},
	{
		"component": "text",
		"value": "The domain name for the SMTP server will usually be the name of your email provider’s domain name, with smtp. in front of it. For example, Gmail’s SMTP server is at smtp.gmail.com. <span style=\"\">Tab</span>le 16-1 lists some common email providers and their SMTP servers. (The port is an <span style=\"\">integer</span> value and will almost always be 587, which is used by the command encryption standard, TLS.)"
	},
	{
		"component": "text",
		"value": "<span style=\"\">Tab</span>le 16-1. Email Providers and Their SMTP Servers"
	},
	{
		"component": "text",
		"value": "Provider                             SMTP server domain name"
	},
	{
		"component": "text",
		"value": "Gmail                                 smtp.gmail.com"
	},
	{
		"component": "text",
		"value": "Outlook.com/Hotmail.com             smtp-mail.outlook.com"
	},
	{
		"component": "text",
		"value": "Yahoo Mail                             smtp.mail.yahoo.com"
	},
	{
		"component": "text",
		"value": "AT&amp;T                                 smpt.mail.att.net (port 465)"
	},
	{
		"component": "text",
		"value": "Comcast                             smtp.comcast.net"
	},
	{
		"component": "text",
		"value": "Verizon                                smtp.verizon.net (port 465)"
	},
	{
		"component": "text",
		"value": "Once you have the domain name and port information for your email provider, create an SMTP object by calling smptlib.SMTP(), passing the domain name as a <span style=\"\">string</span> argument, and passing the port as an <span style=\"\">integer</span> argument. The SMTP object represents a connection to an SMTP mail server and has methods for sending emails. For example, the following call creates an SMTP object for connecting to Gmail:"
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": ">>> smtpObj = smtplib.SMTP('smtp.gmail.com', 587)<br>>>> type(smtpObj)"
	},
	{
		"component": "text",
		"value": "<class 'smtplib.SMTP'><br>Entering type(smtpObj) shows you that there’s an SMTP object stored in smtpObj. You’ll need this SMTP object in order to call the methods that log you in and send emails. If the smptlib.SMTP() call is not successful, your SMTP server might not support TLS on port 587. In this case, you will need to create an SMTP object using smtplib.SMTP_SSL() and port 465 instead."
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": ">>> smtpObj = smtplib.SMTP_SSL('smtp.gmail.com', 465)"
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Note"
	},
	{
		"component": "text",
		"value": "If you are not connected to the Internet, <span style=\"\">Python</span> will raise a socket.gai<span style=\"\">error</span>: [Errno 11004] getaddrinfo failed or similar exception."
	},
	{
		"component": "text",
		"value": "For your programs, the differences between TLS and SSL aren’t important. You only need to know which encryption standard your SMTP server uses so you know how to connect to it. In all of the interactive <span style=\"\">shell</span> examples that follow, the smtpObj <span style=\"\">variable</span> will contain an SMTP object returned by the smtplib.SMTP() or smtplib.SMTP_SSL() function."
	}
]