[
	{
		"component": "header",
		"variant": 1,
		"value": "Logging in to the SMTP Server"
	},
	{
		"component": "text",
		"value": "Once your encrypted connection to the SMTP server is set up, you can log in with your username (usually your email address) and email password by calling the login() method."
	},
	{
		"component": "code",
		"type": "python",
		"title": "",
		"value": ">>> smtpObj.login(' my_email_address@gmail.com ', ' MY_SECRET_PASSWORD ')"
	},
	{
		"component": "text",
		"value": "(235, b'2.7.0 Accepted')<br>Gmail’s <span style=\"\">Application</span>-Specific Passwords"
	},
	{
		"component": "text",
		"value": "Gmail has an additional security feature for Google accounts called <span style=\"\">application</span>-specific passwords. If you receive an <span style=\"\">Application</span>-specific password required <span style=\"\">error</span> message when your program tries to log in, you will have to set up one of these passwords for your <span style=\"\">Python</span> script. Check out the resources at <span><a href=\"http://nostarch.com/automatestuff/\">http://nostarch.com/automatestuff/</a></span> for detailed directions on how to set up an <span style=\"\">application</span>-specific password for your Google account."
	},
	{
		"component": "text",
		"value": "Pass a <span style=\"\">string</span> of your email address as the first argument and a <span style=\"\">string</span> of your password as the second argument. The 235 in the return value means authentication was successful. <span style=\"\">Python</span> will raise an smtplib.SMTPAuthentication<span style=\"\">Error</span> exception for incorrect passwords."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Warning"
	},
	{
		"component": "text",
		"value": "Be careful about putting passwords in your source <span style=\"\">code</span>. If anyone ever copies your program, they’ll have access to your email account! It’s a good idea to call <span style=\"\">input</span>() and have the user type in the password. It may be inconvenient to have to enter a password each time you run your program, but this approach will prevent you from leaving your password in an unencrypted <span style=\"\">file</span> on your computer where a hacker or laptop thief could easily get it."
	}
]