{
	"functions-return_values_key1": "How to return a value from a function?\n",
	"functions-return_values_key2": "Kuch functions jo humne use kare hain, vapas kuch value dete hain. Matlab kuch data vapas dete hain. Abhi tak humne aise functions likhe hain jo kuch bhi vapas nahi dete. \n",
	"functions-return_values_key3": "Ek simple addition ka function likhte hain jo data vapas deta hai.\n",
	"functions-return_values_key4": "**`Output`**\n",
	"functions-return_values_key5": "60\n583\n1246\n10.0\n",
	"functions-return_values_key6": "Yahan humne function ussi tareeke se define kara hai jaise hum abhi tak functions ko define karte aaye hain. Lekin sirf function mein last line aap kuch naya dekhoge.\n",
	"functions-return_values_key7": "Last line mein humne `return` `statement` ka use kar ke function ko yeh bataya hai ki voh `number_sum` ki value ko vapas karega\n",
	"functions-return_values_key8": "Kyunki yeh function `number_sum` ki value vapas kar raha hai, hum iss value ko ek `variable` mein aasani se daal sakte hain.\n",
	"functions-return_values_key9": "Jaise humne neeche waali lines mein `sum1` `variable` mein `20` aur `40` ke sum ki value, 60 daal di hai\n",
	"functions-return_values_key10": "Humne **function definition** ki last line mein `return` ka use kar ke ek value vapas karvai hai function se. Hum isko return `statement` bolte hain. `Return` ka matlab hi vapas dena hota hai\n",
	"functions-return_values_key11": "Jo functions kuch values return karte hain, hum unn functions ke saath kaafi interesting kaam kar sakte hain jaise `number_a = add_numbers(20,40) / add_numbers(5,1)` waali line ko dekho. Yahan humne ek `statement` mein do add_numbers ko call kiya hai aur fir unn dono ka jo result mila (pehle ka 60 aur dusre ka 6) usko divide kar diya hai Yeh functions jo kuch return karte hain, hum unka use aise kisi `statement` mein kar sakte hain. Jaise humne division wali line mein kara hai.\n\n\n",
	"functions-return_values_key12": "Hum same function ko return value ke bina likhte hain.\n",
	"functions-return_values_key13": "**`Output` :-**\n",
	"functions-return_values_key14": "9\nNone\n<class 'NoneType'>\n",
	"functions-return_values_key15": "Humne yahan same upar wale function ka `code` likha hai, lekin return `statement` ka use nahi kiya. Iss vajah se hume yeh function kuch return nahi karega Kyunki yeh function kuch return nahi karta hai, hum apne numbers ke sum ko dusre `variable` mein nahi daal sakte jaise humne pichle example mein kiya tha.\n",
	"functions-return_values_key16": "Yahan agar aap `sum4` ki value dekhoge toh woh `None` dikhayega. `None` ka matlab hota hai kuch nahi. Basically jo numbers value nahi return karte woh \"kuch nahi\" return karte hain `None` `python` mein ek alag tareeke ki type hai `integer`, `float` etc. ki tarah. `print (type(sum4))` waali line mein dekhoge ki woh sum4 ki type ko NoneType dikhayega. Iska matlab hota hai ki isme kuch nahi hai.\n",
	"functions-return_values_key17": "Ek baar yeh neeche wale `code` ko padho aur socho ki kya hoga,. Ab usko chalao aur dekho ki aapne sahi socha tha\n",
	"functions-return_values_key18": "**`Output` :-** \n",
	"functions-return_values_key19": "Type`Error`: unsupported operand type(s) for /: 'NoneType' and 'NoneType'\n",
	"functions-return_values_key20": "Yahan humne basically aise function ki values ko divide karne ki koshish kari hai jo koi value return nahi karta. Humne abhi padha tha ki jo function return nahi karte , woh None (matlab kuch nahi) return karte hain. Jab hum yahan None ko None se divide karte hain toh `python` baukhla jata hai aur samajh nahi pata ki kya karna hai. Iss vajah se `error` return kar deta hai. `Python` hume `error` mein bhi yahi bolta hai:\n",
	"functions-return_values_key21": "**`unsupported operand type(s) for /: 'NoneType' and 'NoneType'`**\n",
	"functions-return_values_key22": "Iska matlab yeh hai ki `Python` NoneType ki value ko NoneType ki value se hi divide nahi kar  aur iss chakar mein `error` aa gayi hai.\n",
	"functions-return_values_key23": "Understandng function execution with a return `statement`\n",
	"functions-return_values_key24": "Iss example ko chalane se pehle, iska `code` padh ke socho ki yeh function kya return karega aur kya print karega jab hum isko 2 `integer` argument denge.\n",
	"functions-return_values_key25": "**`Output` :-**\n",
	"functions-return_values_key26": "Hello from NavGurukul ;)\n",
	"functions-return_values_key27": "Yahan yeh function \"Hello from NavGurukul ;)\" print karega aur 120 ki value return karega. Yeh 120 ki value \"return number_sum\" waali line ka use kar ke return karega.\n",
	"functions-return_values_key28": "`sum6` ki value 120 ho jayegi\n",
	"functions-return_values_key29": "Pehli `return number_sum` waali line se neeche aapne jo bhi `code` likha hai uss `code` mein se kuch bhi nahi chalega. Yeh isliye nahi chalega kyunki function chalate hue jab `python` ko ek return `statement` milti hai, toh `python` uss return `statement` ka use kar ke value return kar deta hai aur fir uske neeche wala koi bhi `code` nahi chalata hai.\n\n\n",
	"functions-return_values_key30": "Thodi aur depth mein jake mein function execution samajhte hain `python` mein. Pehle iss `code` ko run kare bina samjahne ki try karo. Fir ek baar run kar ke dekho.\n",
	"functions-return_values_key31": "**`Output` :-**\n",
	"functions-return_values_key32": "Butter Chicken\nMutton Chaap\nChole Bhature\n",
	"functions-return_values_key33": "Humara `menu` function `day` argument ke hisaab se uss din ki menu ki item ki value return kar deta hai\n",
	"functions-return_values_key34": "Yahan mon_menu mein \"Butter Chicken\" ki value hogi kyunki humari if-elif-else `statement` yahan dekhti hai ki din \"monday\" diya hua hai toh \"Butter Chicken\" return kar deti hai. Jaise hi `python` ko return `statement` dikhti hai woh \"Butter Chicken\" return kar deti hai aur function chalna banda ho jata hai. Iss vajah se aakhir waali print command nahi chalti. Kyunki uss print command se pehle hi humesha return `statement` ki vajah se function chalna band ho jata hai\n",
	"functions-return_values_key35": "Aise hi jab day ki value \"tuesday\" hoti hai toh return \"Mutton Chaap\" waali return `statement` `execute` ho jati hai\n",
	"functions-return_values_key36": "Aur jab \"monday\" aur \"tuesday\" dono hi nahi hote, toh return \"Chole Bhature\" wali return `statement` `execute` ho jati hai.\n",
	"functions-return_values_key37": "**Lekin kyunki if-elif-else ke andar se hi return `statement` `execute` ho jaati hai, humara program kabhi bhi aakhir wali if `statement` tak pahunchta hi nahi hai aur woh kabhi print nahi hoti.**\n\n\n",
	"functions-return_values_key38": "Ab hum same function iss dhang se likhenge ki aakhri wali print command bhi run hoye aur `\"Kya main priunt ho payungi? :-(\"` waali line print ho paye :D\n",
	"functions-return_values_key39": "**`Output` :-**\n",
	"functions-return_values_key40": "Kya main print ho payungi? :-(\nButter Chicken\n",
	"functions-return_values_key41": "Yahan humne if-elif-else mein directly return `statement` ka use nahi kiya. Humne ek `food` naam ke `variable` mein woh value store karva li jo humne return karvani thi. Ab Jab if-elif-else chal jata hai, toh humara program uske neeche wali print `statement` pe pahunchta hai. Kyunki `python` ko abhi tak koi return `statement` nahi mili hai, woh print command chalata hai. Print karne ke baad woh return `statement` se *food* `variable` ki value return kar deta hai Lekin jo akhri wali print `statement` hai woh nahi print hoyegi. Kyunki uss print `statement` se pehle return `statement` chal jati hai aur uski vajah se `python` needche walai print `statement` tak pahunchti hi nahi hai\n"
}