[
	{
		"component": "text",
		"value": "<h1 id=\"htmlbrbeforeyoupickapartwebpagesyoulllearnsomehtmlbasicsyoullalsoseehowtoaccessyourwebbrowserspowerfuldevelopertoolswhichwillmakescrapinginformationfromthewebmucheasier\">HTML<br>Before you pick apart web pages, you’ll learn some HTML basics. You’ll also see how to access your web browser’s powerful developer tools, which will make scraping information from the Web much easier.</h1>"
	},
	{
		"component": "text",
		"value": "<h1 id=\"resourcesforlearninghtmlbrhypertextmarkuplanguagehtmlistheformatthatwebpagesarewritteninthischapterassumesyouhavesomebasicexperiencewithhtmlbutifyouneedabeginnertutorialisuggestoneofthefollowingsites\">Resources for Learning HTML<br>Hypertext Markup Language (HTML) is the format that web pages are written in. This chapter assumes you have some basic experience with HTML, but if you need a beginner tutorial, I suggest one of the following sites:</h1>"
	},
	{
		"component": "text",
		"value": "<span><a href=\"http://htmldog.com/guides/html/beginner/\">http://htmldog.com/guides/html/beginner/</a></span>"
	},
	{
		"component": "text",
		"value": "<span><a href=\"http://www.<span style=\"\">code</span>cademy.com/tracks/web/\"&gt;http://www.<span style=\"\">code</span>cademy.com/tracks/web/</a></span>"
	},
	{
		"component": "text",
		"value": "<span><a href=\"https://developer.mozilla.org/en-US/learn/html/\">https://developer.mozilla.org/en-US/learn/html/</a></span>"
	},
	{
		"component": "text",
		"value": "<h1 id=\"aquickrefresherbrincaseitsbeenawhilesinceyouvelookedatanyhtmlheresaquickoverviewofthebasicsanhtmlspanstylefilespanisaplaintextspanstylefilespanwiththehtmlspanstylefilespanextensionthetextinthesespanstylefilesspanissurroundedbytagswhicharewordsenclosedinanglebracketsthetagstellthebrowserhowtoformatthewebpageastartingtagandclosingtagcanenclosesometexttoformanelementthetextorinnerhtmlisthecontentbetweenthestartingandclosingtagsforexamplethefollowinghtmlwilldisplayhelloworldinthebrowserwithhelloinbold\">A Quick Refresher<br>In case it’s been a while since you’ve looked at any HTML, here’s a quick overview of the basics. An HTML <span style=\"\">file</span> is a plaintext <span style=\"\">file</span> with the .html <span style=\"\">file</span> extension. The text in these <span style=\"\">files</span> is surrounded by tags, which are words enclosed in angle brackets. The tags tell the browser how to format the web page. A starting tag and closing tag can enclose some text to form an element. The text (or inner HTML) is the content between the starting and closing tags. For example, the following HTML will display Hello world! in the browser, with Hello in bold:</h1>"
	},
	{
		"component": "text",
		"value": "<b>Hello</b> world!<br>This HTML will look like Figure 11-1 in a browser."
	},
	{
		"component": "text",
		"value": "Hello world! rendered in the browser"
	},
	{
		"component": "text",
		"value": "The opening <b> tag says that the enclosed text will appear in bold. The closing </b> tags tells the browser where the end of the bold text is."
	},
	{
		"component": "text",
		"value": "There are many different tags in HTML. Some of these tags have extra properties in the form of attributes within the angle brackets. For example, the <a> tag encloses text that should be a link. The URL that the text links to is determined by the href attribute. Here’s an example:"
	},
	{
		"component": "text",
		"value": "Al's free <a href=\"http://inventwith<span style=\"\">python</span>.com\"><span style=\"\">Python</span> books</a>.<br>This HTML will look like Figure 11-2 in a browser."
	},
	{
		"component": "text",
		"value": "The link rendered in the browser"
	},
	{
		"component": "text",
		"value": "Some elements have an id attribute that is used to uniquely identify the element in the page. You will often instruct your programs to seek out an element by its id attribute, so figuring out an element’s id attribute using the browser’s developer tools is a common task in writing web scraping programs.<br>#Viewing the Source HTML of a Web Page<br>You’ll need to look at the HTML source of the web pages that your programs will work with. To do this, right-click (or CTRL-click on OS X) any web page in your web browser, and select View Source or View page source to see the HTML text of the page (see Figure 11-3). This is the text your browser actually receives. The browser knows how to display, or render, the web page from this HTML."
	},
	{
		"component": "text",
		"value": "Viewing the source of a web page"
	},
	{
		"component": "text",
		"value": "I highly recommend viewing the source HTML of some of your favorite sites. It’s fine if you don’t fully understand what you are seeing when you look at the source. You won’t need HTML mastery to write simple web scraping programs—after all, you won’t be writing your own websites. You just need enough knowledge to pick out data from an existing site."
	}
]