[
	{
		"component": "header",
		"variant": 1,
		"value": "Practice Projects"
	},
	{
		"component": "text",
		"value": "For practice, write programs to do the following tasks."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Command Line Emailer"
	},
	{
		"component": "text",
		"value": "Write a program that takes an email address and <span style=\"\">string</span> of text on the command line and then, using Selenium, logs into your email account and sends an email of the <span style=\"\">string</span> to the provided address. (You might want to set up a separate email account for this program.)"
	},
	{
		"component": "text",
		"value": "This would be a nice way to add a notification feature to your programs. You could also write a similar program to send messages from a Facebook or Twitter account."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Image Site Downloader"
	},
	{
		"component": "text",
		"value": "Write a program that goes to a photo-sharing site like Flickr or Imgur, searches for a category of photos, and then downloads all the resulting images. You could write a program that works with any photo site that has a search feature."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "2048"
	},
	{
		"component": "text",
		"value": "2048 is a simple game where you combine tiles by sliding them up, down, left, or right with the arrow <span style=\"\">keys</span>. You can actually get a fairly high score by repeatedly sliding in an up, right, down, and left pattern over and over again. Write a program that will open the game at <span><a href=\"https://gabrielecirulli.github.io/2048/\">https://gabrielecirulli.github.io/2048/</a></span> and keep sending up, right, down, and left <span style=\"\">keys</span>trokes to automatically play the game."
	},
	{
		"component": "header",
		"variant": 1,
		"value": "Link Verification"
	},
	{
		"component": "text",
		"value": "Write a program that, given the URL of a web page, will attempt to download every linked page on the page. The program should flag any pages that have a 404 “Not Found” status <span style=\"\">code</span> and print them out as broken links."
	},
	{
		"component": "text",
		"value": "[2] The answer is no."
	}
]