[
	{
		"component": "text",
		"value": "Code academy ke <a href=\"https://www.codecademy.com/courses/learn-git/lessons/git-workflow/exercises/git-workflow?action=resume_content_item\">iss</a> link ko padh kar, Git ke workflow ko samajhne ki kosis kijiye."
	},
	{
		"component": "text",
		"value": "Git ke workflow mein 3 stages hote hain:"
	},
	{
		"component": "text",
		"value": "Working Directory: Aap jab apne files mein kuch edit karte hain, toh aap git ke working directory mein kaam kar rahe hote hain. Jaise aapne isse pehle exercise mein apne story ke file mein story ki beginning add ki. Working directory mein hi hum apne kisi file mein changes karte hain.",
		"decoration": {
			"type": "number",
			"value": 1
		}
	},
	{
		"component": "text",
		"value": "Staging Area: Jab hum apne file mein kiye hue changes se kuch had tak khush hote hain aur usme kiye hue changes ko git ko store karne ke liye kehna chahte hain, toh hum apne file ko staging area mein daal dete hain. Staging area humare system mein hi hota hai. Staging area mein daalte hi humare file ki 2 copies ban jati hain. Ek staging area mein chali jaati hai aur doosri working directory mein. Working directory mein hum abhi bhi apne file ko edit kar sakte hain lekin wo staging area mein stored file mein reflect nahi hoga. Uske liye hume wapas se apne file ko stage karna hoga.",
		"decoration": {
			"type": "number",
			"value": 2
		}
	},
	{
		"component": "text",
		"value": "Staging ke baare mein hum detail mein agle lessons mein dekhenge."
	},
	{
		"component": "text",
		"value": "Repository: Jab hum apne file ko doosre developers ke saath share karne ke liye ready hote hain, toh hum usey apne system ya system ke bahar kahin external space (jaise cloud) mein store kar sakte hain. Iss space ko hum repository kehte hain.",
		"decoration": {
			"type": "number",
			"value": 3
		}
	},
	{
		"component": "text",
		"value": "GitHub, jisme aapne apna account banaya hai - wah ek cloud hai jo hume repositories banane ke liye space provide karti hai.<br>Github mein banaye hue repositories hum logon ke saath share kar sakte hain."
	},
	{
		"component": "text",
		"value": "<b>Assignment</b>"
	},
	{
		"component": "text",
		"value": "Working Directory, Staging Area aur Repository mein difference apne peers ke saath discuss karo.",
		"decoration": {
			"type": "bullet"
		}
	}
]